if Page==nil then
	Page={}  --所有用到的页面数据，全部放在Page里面
end
Page["种类"]= {页面类型="6代10系统：QQ页面数据4.6"}

Page["QQ"] = {}
Page["QQ验证粉"] = {}
Page["QQ"]['登录模块'] = {}
Page["QQ"]['登录成功模块'] = {}
Page["QQ"]['登录失败模块'] = {}
Page["QQ"]['TIM验证'] = {}
Page["QQ"]['空间验证'] = {}
Page["QQ"]['添加好友'] = {}
Page["QQ"]['腾讯视频'] = {}
Page["QQ"]['拼多多'] = {}


Page["QQ"]['拼多多']["拼多多安全码"] = {页面名称="拼多多安全码",查询范围={208,  347,549,  444},点击范围={},多点颜色={{0x1d1d1d, "16|0|0x060606,39|-4|0x555555,54|-4|0xfcfcfc,28|3|0xf8f8f8,51|2|0xfbfbfb,44|-13|0x181818,14|-1|0x5c5c5c,2|-12|0x282828,-2|0|0xadadad"} } }
Page["QQ"]['拼多多']["开启消息通知"] = {页面名称="开启消息通知",查询范围={422,  741,634,  893},点击范围={},多点颜色={{0x23c857, "24|-24|0x23c857,12|-28|0xeeffef,-19|-43|0x23c857,-27|-30|0x23c857,-4|-4|0x23c857,-13|-28|0xf7fff8,0|-26|0xf0fff1,27|-31|0x23c857,8|-50|0x23c857"} } }
Page["QQ"]['拼多多']["开门大吉"] = {页面名称="开门大吉",查询范围={227,  639,554,  881},点击范围={},多点颜色={{0xf83804, "0|-9|0xfff4a6,-33|-17|0xfffce2,-3|-53|0xfefede,40|-14|0xffcc82,38|30|0xff8e48,5|27|0xfea85c,-48|27|0xffa758,2|51|0xff7a3a,-29|-44|0xfeffeb"} } }
Page["QQ"]['拼多多']["使用数据允许"] = {页面名称="使用数据允许",查询范围={381,  722,630,  814},点击范围={},多点颜色={{0x007aff, "-9|-2|0x007aff,5|-5|0xf3f6f9,-3|14|0xf9f9f9,13|6|0xf9f9f9,23|-2|0x3f9afe,26|12|0x007aff,47|-4|0xf9f9f9,40|3|0x007aff,33|-13|0xf9f9f9"} } }
Page["QQ"]['拼多多']["首页"] = {页面名称="首页",查询范围={4, 1237,162, 1331},点击范围={},多点颜色={{0xffe39f, "18|-4|0xfff3d3,16|-12|0xfff7e3,4|2|0xfff1cb,2|7|0xfff1cd,13|4|0xf57161,26|-3|0xffe197,11|-13|0xfff0ca,-2|-1|0xffde8d,9|15|0xf4afa5"} } }
Page["QQ"]['拼多多']["个人中心"] = {页面名称="个人中心",查询范围={585, 1236,741, 1330},点击范围={},多点颜色={{0xfffbdb, "6|-13|0xfffce6,7|-6|0xffe3bd,-6|-8|0xffe1a6,-12|6|0xfff2cd,4|7|0xfffbcb,3|-7|0xfff0d7,-3|-18|0xffe8b0,-12|-8|0xfdd689,4|-4|0xb77960"} } }
Page["QQ"]['拼多多']["其他登陆方式"] = {页面名称="其他登陆方式",查询范围={195,  276,542,  434},点击范围={},多点颜色={{0xe02e24, "2|-30|0xe02d23,-3|-27|0xf09792,25|-13|0xfffefe,58|-9|0xe02e24,63|-51|0xffffff,27|-64|0xe02e24,41|-36|0xe02e24,28|-41|0xfffdfd,29|3|0xf5bab6"} } }
Page["QQ"]['拼多多']["QQ登陆"] = {页面名称="QQ登陆",查询范围={223, 1131,455, 1222},点击范围={},多点颜色={{0x309ae4, "0|-15|0xffffff,-17|-19|0x309ae4,17|-24|0x309ae4,5|-13|0xffffff,-3|-24|0xffffff,-18|-24|0x309ae4,2|-5|0xffffff,15|-9|0x309ae4,7|-11|0xffffff"} } }
Page["QQ"]['拼多多']["拼多多打开QQ"] = {页面名称="拼多多打开QQ",查询范围={368,  680,666,  777},点击范围={},多点颜色={{0x007aff, "16|-5|0x63b9e3,9|12|0xc6f9c6,22|12|0xc6f9c6,40|14|0xc6f9c6,34|4|0xc6f9c6,36|-6|0xb7efca,52|-5|0x007aff,59|12|0xc6f9c6,9|12|0xc6f9c6"} } }
Page["QQ"]['拼多多']["QQ授权页面"] = {页面名称="QQ授权页面",查询范围={368,  680,666,  777},点击范围={},多点颜色={{0xf7c7c5, "17|19|0xe02e24,-19|22|0xe02e24,-2|-19|0xe42f25,16|6|0xf9d9d7,1|14|0xffffff,-12|13|0xed847e,-11|-5|0xffffff,-3|2|0xea736d,5|4|0xe34239"} } }
Page["QQ"]['拼多多']["绑定手机号码跳过"] = {页面名称="绑定手机号码跳过",查询范围={71,  526,676,  615},点击范围={},多点颜色={{0xe02e24, "31|-4|0xf4b8b4,49|-4|0xffffff,76|-6|0xffffff,77|1|0xffffff,79|27|0xe02e24,88|4|0xe02e24,89|-25|0xe02e24,218|-9|0xf1a19d,195|9|0xe02e24"} } }
Page["QQ"]['拼多多']["登陆成功"] = {页面名称="登陆成功",查询范围={7,   46,232,  210},点击范围={},多点颜色={{0xffffff, "-22|-13|0xe7201e,-14|-20|0xe71f1f,-11|-40|0x422600,-14|-49|0x010101,1|-55|0xffffff,1|-52|0x818181,-16|-53|0xbdbdbd,-8|-34|0xfbae08,-19|-21|0xde2528"} } }
--------------------------------------------------------------
Page["QQ"]['腾讯视频']["腾讯视频首页"] = {页面名称="腾讯视频首页",查询范围={25, 1237,115, 1316},点击范围={},多点颜色={{0xf7d8cc, "6|-4|0xf7d8cb,3|-10|0xfe733c,-16|-10|0xff6022,-4|-26|0xff6022,0|-17|0xf5f5f5,13|-7|0xff6022,3|1|0xf7d8cc,-11|1|0xf6edea,-17|-22|0xf6f6f6"} } }
Page["QQ"]['腾讯视频']["腾讯视频授权登录页"] = {页面名称="腾讯视频授权登录页",查询范围={460,  617,578,  724},点击范围={},多点颜色={{0xdfe2dc, "16|-6|0x82dc00,35|-3|0x288dcc,4|14|0x58b300,-23|3|0xdf7905,-10|-22|0x8ce500,-3|16|0x53ad00,20|-10|0x90e900,11|20|0x126ca4,30|-3|0x8ee506"} } }
Page["QQ"]['腾讯视频']["腾讯视频登录成功"] = {页面名称="腾讯视频登录成功",查询范围={86,  210,131,  257},点击范围={},多点颜色={{0xffffff, "9|-2|0x00bafb,-11|-3|0x00bafb,-6|11|0x00bafb,5|10|0x00bafb,2|1|0xffffff,-9|-6|0x00bafb,7|0|0x00bafb,-11|-3|0x00bafb,10|-2|0x00bafb"} } }
Page["QQ"]['腾讯视频']["腾讯视频登录成功2"] = {页面名称="腾讯视频登录成功2",查询范围={32,   53,165,  120},点击范围={},多点颜色={{0xff4d02, "1|-18|0xff4d02,-1|17|0xff4d02,16|6|0xff6d30,22|14|0xffffff,21|23|0xffffff,9|6|0xffffff,6|19|0xffffff,-4|13|0xffa179,1|-8|0xff4d02"} } }
Page["QQ"]['腾讯视频']["腾讯视频添加QQ账号"] = {页面名称="腾讯视频添加QQ账号",查询范围={293,  639,448,  719},点击范围={},多点颜色={{0x00aced, "0|-7|0x00aced,0|-13|0x00aced,0|-23|0x9edff8,-15|-16|0x00aced,-10|-29|0x00aced,11|-3|0x00aced,-17|-6|0x00aced,-5|4|0xffffff,-4|12|0x00aced"} } }
Page["QQ"]['腾讯视频']["腾讯视频添加账号输入账号密码页"] = {页面名称="腾讯视频添加账号输入账号密码页",查询范围={295,  638,448,  719},点击范围={},多点颜色={{0x00aced, "13|6|0x96ddf8,17|5|0x00aced,18|-4|0x00aced,18|-10|0x01aced,18|-18|0x00aced,10|-14|0xddf4fd,3|-10|0x45c2f2,17|-4|0x00aced,31|0|0x00aced"} } }
Page["QQ"]['腾讯视频']["腾讯视频左下角QQ登录入口"] = {页面名称="腾讯视频左下角QQ登录入口",查询范围={82, 1143,339, 1224},点击范围={},多点颜色={{0xffffff, "19|-11|0x009cff,29|2|0x7acbff,32|-5|0x009cff,54|-6|0x009cff,43|4|0x24aaff,29|-3|0xf7fcff,29|-10|0xffffff,-3|-11|0xffffff,11|-27|0x009cff"} } }
Page["QQ"]['腾讯视频']["腾讯视频用户隐私政策概要页面"] = {页面名称="腾讯视频用户隐私政策概要页面",查询范围={470, 1148,618, 1215},点击范围={},多点颜色={{0xff6022, "7|-2|0xff6022,16|-1|0xff6022,21|-15|0xffffff,2|-16|0xffffff,8|1|0xff6022,21|5|0xfff1ec,8|0|0xff8e62,17|-2|0xff6022,10|-2|0xffffff"} } }
Page["QQ"]['腾讯视频']["腾讯视频个人中心"] = {页面名称="腾讯视频个人中心",查询范围={594, 1235,738, 1327},点击范围={},多点颜色={{0xff6022, "-7|5|0xff6529,6|6|0xff6022,20|6|0xff6022,31|-24|0xfeded1,41|-30|0xe88f64,20|-26|0xf86a32,35|3|0xff6022,43|6|0xfefefe,40|10|0xff6022"} } }
Page["QQ"]['腾讯视频']["我知道了弹出窗口"] = {页面名称="我知道了弹出窗口",查询范围={286,  885,465,  965},点击范围={},多点颜色={{0xfffffe, "6|-3|0xff6022,16|6|0xff6b31,8|11|0xff6022,12|11|0xfffffe,20|17|0xffffff,0|18|0xffffff,7|-2|0xff6022,-6|16|0xff6022,-6|5|0xff6022"} } }
Page["QQ"]['腾讯视频']["下次再说"] = {页面名称="下次再说",查询范围={88,  356,665,  512},点击范围={},多点颜色={{0xfdbb0f, "19|0|0x160b11,53|0|0x160f07,96|-7|0x824d19,158|-7|0xbd8433,198|-3|0xe8b315,218|-8|0xfdbe01,227|16|0xfdbe01,132|15|0xfac10f,109|49|0xf58000"} } }

Page["QQ"]['腾讯视频']["QQ设置页"] = {页面名称="QQ设置页",查询范围={331,   59,424,  104},点击范围={},多点颜色={{0x000000, "6|8|0x040404,13|8|0xffffff,7|12|0x707070,-10|9|0x000000,-9|-1|0x000000,15|-11|0xffffff,15|-11|0xffffff,6|-7|0xffffff,-14|-10|0xffffff"} } }
Page["QQ"]['腾讯视频']["QQ账号管理页"] = {页面名称="QQ账号管理页",查询范围={33,  312,186,  382},点击范围={},多点颜色={{0xebedf5, "-1|-11|0xebedf5,10|-11|0xebedf5,4|-4|0xb0b3bf,82|-12|0x74b2e7,87|-11|0x4799df,87|-6|0xffffff,81|4|0xffffff,88|4|0x65aae4,94|4|0x4799df"} } }
Page["QQ"]['腾讯视频']["QQ添加或注册账号"] = {页面名称="QQ添加或注册账号",查询范围={274,  438,479,  527},点击范围={},多点颜色={{0x00cafc, "-16|-1|0x00cafc,-3|6|0x00cafc,8|5|0x07cbfc,1|2|0xd1f5fe,1|0|0x00cafc,-6|8|0xfcfeff,5|9|0xffffff,-1|-1|0x30d4fd,-8|-14|0x21d1fc"} } }
Page["QQ"]['腾讯视频']["腾讯视频立即更新页"] = {页面名称="腾讯视频立即更新页",查询范围={284,  758,474,  850},点击范围={},多点颜色={{0xff6022, "6|13|0xff6022,11|3|0xff9e78,8|2|0xffffff,8|-7|0xff6022,20|-6|0xffaa88,28|12|0xff6022,33|6|0xffffff,28|0|0xff6022,35|-1|0xffffff"} } }
Page["QQ"]['腾讯视频']["腾讯视频图形验证码"] = {页面名称="腾讯视频图形验证码",查询范围={373,   60,440,  108},点击范围={},多点颜色={{0x484c59, "-5|4|0xffffff,-18|7|0xffffff,-10|12|0x060b1d,-1|12|0x03081a,-9|23|0xa4a6ac,-26|6|0xffffff,-23|9|0x03081a,-23|24|0x03081a,-6|8|0xffffff"} } }
Page["QQ"]['腾讯视频']["腾讯视频错误"] = {页面名称="腾讯视频错误",查询范围={331,  556,422,  604},点击范围={},多点颜色={{0xfcfcfc, "6|-5|0x393939,-2|-2|0xe4e4e4,-16|-4|0x020202,-16|5|0x000000,-22|16|0xffffff,-3|20|0x868686,6|19|0xebebeb,-2|12|0x000000,7|14|0x040404"} } }
Page["QQ"]['腾讯视频']["腾讯视频错误110023"] = {页面名称="腾讯视频错误110023",查询范围={332,  473,422,  514},点击范围={},多点颜色={{0x8e8e8e, "11|-3|0x494949,19|-1|0xffffff,37|-2|0xe4e4e4,37|-8|0xffffff,22|8|0xffffff,25|17|0x000000,39|9|0x000000,37|15|0x181818,12|10|0x000000"} } }
Page["QQ"]['腾讯视频']["腾讯视频错误11003"] = {页面名称="腾讯视频错误11003",查询范围={1,  457,565,  742},点击范围={},多点颜色={{0x202020, "4|0|0x000000,-276|109|0x00678e,-275|137|0x00678e,-276|156|0x00678e,24|19|0x000000,2|12|0x7d7d7d,3|21|0x010101,25|14|0x000000,-271|104|0x00678e	"} } }
Page["QQ"]['腾讯视频']["腾讯视频错误11004"] = {页面名称="腾讯视频错误11004",查询范围={325,  514,419,  557},点击范围={},多点颜色={{0x000000, "4|-1|0x909090,2|9|0x000000,21|24|0x000000,20|21|0xffffff,22|15|0xadadad,37|11|0x000000,37|11|0x000000,52|18|0x161616,50|24|0xffffff"} } }
Page["QQ"]['腾讯视频']["腾讯视频允许"] = {页面名称="腾讯视频允许",查询范围={375,  720,627,  810},点击范围={},多点颜色={{0x5ca1ef, "-14|3|0x007aff,36|8|0x007aff,-2|14|0x007aff,18|2|0x007aff,28|-8|0x007aff,34|10|0x007aff,0|0|0x5ca1ef,18|3|0x007aff,33|7|0x007aff"} } }
Page["QQ"]['腾讯视频']["腾讯视频允许1"] = {页面名称="腾讯视频允许1",查询范围={378,  724,623,  799},点击范围={},多点颜色={{0xe0ffff, "5|-5|0xfef3f7,-13|7|0xfefeff,8|10|0x3b7ab0,29|5|0x007af3,19|-13|0xf7f7f7,42|-19|0xf7f7f7,42|5|0x1474da,27|18|0xa2c3e2,-5|-7|0xe0faff"} } }

Page["QQ"]['腾讯视频']["腾讯视APP"] = {页面名称="腾讯视APP",查询范围={10, 1098,739, 1289},点击范围={},多点颜色={{0xffffff, "22|0|0xc2f2fe,60|5|0xffffff,3|41|0x00cafc,94|29|0x00cafc,97|7|0x00cafc,65|107|0xffffff,76|107|0xffffff,37|104|0x7fbfff,-8|100|0xd8ecff"} } }
Page["QQ"]['腾讯视频']["腾讯视APP添加账号"] = {页面名称="腾讯视APP添加账号",查询范围={3,  974,187, 1110},点击范围={},多点颜色={{0xeceff6, "-8|-22|0xeceff6,-30|-1|0xeceff6,-30|-20|0xeceff6,-15|-23|0xc3c6cd,-15|4|0xbbbec5,-25|-11|0xe6e9f2,-16|-10|0xbfc2cb,-6|-8|0xb8bbc4,-1|-10|0xbfc2cb"} } }
Page["QQ"]['腾讯视频']["有新版本"] = {页面名称="有新版本",查询范围={46,  319,718,  666},点击范围={},多点颜色={{0xf88300, "93|0|0xfc8100,192|-1|0xf97e00,398|18|0xfb8a00,391|91|0xfc8100,384|67|0xde9b00,316|112|0xfb8000,190|113|0xfa8301,13|111|0xfe8804,-38|76|0xff8a04"} } }


Page["QQ"]['腾讯视频']["腾讯视频用户隐私政策概要页面同意按钮"] = {点击范围={495, 1120,551, 1145} }
Page["QQ"]['腾讯视频']["我知道了弹出窗口按钮"] = {点击范围={286,  885,465,  965} }
Page["QQ"]['腾讯视频']["个人中心按钮"] = {点击范围={594, 1235,738, 1327} }
Page["QQ"]['腾讯视频']["腾讯视频左下角QQ登录入口按钮"] = {点击范围={82, 1143,339, 1224} }

Page["QQ"]['腾讯视频']["腾讯视频添加账号激活账号输入框"] = {点击范围={68,  394,254,  437} }
Page["QQ"]['腾讯视频']["腾讯视频添加账号激活密码输入框"] = {点击范围={69,  489,238,  558} }
Page["QQ"]['腾讯视频']["腾讯视频登录按钮"] = {点击范围={296,  654,452,  707} }


Page["QQ"]['腾讯视频']["QQ添加账号激活账号输入框"] = {点击范围={162,  214,334,  260} }
Page["QQ"]['腾讯视频']["QQ添加账号激活密码输入框"] = {点击范围={147,  311,335,  371} }
Page["QQ"]['腾讯视频']["QQ登录按钮"] = {点击范围={307,  452,451,  504} }


Page["QQ"]['腾讯视频']["QQ账号管理按钮"] = {点击范围={579,  194,666,  272} }
Page["QQ"]['腾讯视频']["QQ账号管理页添加按钮"] = {点击范围={33,  312,186,  382} }









Page["QQ"]['登录模块']["勋章"] = {页面名称="勋章",查询范围={304, 1150,452, 1253},点击范围={},多点颜色={{0xcea57d, "-9|9|0xcea57d,7|6|0xcea57d,8|-8|0xcea57d,-3|-13|0x47484b,-16|-4|0x4a4b4c,13|-5|0x47484b,4|13|0x4a4a4b,-7|-8|0xcea57d,4|-6|0x514f50"} } }

Page["QQ"]['登录模块']["服务协议和隐私政策弹窗"] = {页面名称="服务协议和隐私政策弹窗",查询范围={104,334,646,1024},点击范围={},多点颜色={{0x000000, "1|4|0xffffff,1|9|0x000000,1|13|0xffffff,1|17|0x000000,47|17|0x000000,47|20|0xffffff,274|567|0x40a0ff,274|569|0xffffff,274|572|0x40a0ff"} } }
Page["QQ"]['登录模块']["服务协议和隐私政策弹窗同意按钮"] = {点击范围={496,948,552,976} }
Page["QQ"]['登录模块']["登录注册首页面"] = {页面名称="登录注册首页面",查询范围={214,316,626,1288},点击范围={},多点颜色={{0x000000, "19|-23|0xffffff,39|29|0xffa600,58|57|0x000000,56|78|0xf90012,147|759|0x00cafc,217|758|0xffffff"} } }
Page["QQ"]['登录模块']["登录注册首页面二"] = {页面名称="登录注册首页面二",查询范围={379, 1146,718,1253},点击范围={},多点颜色={{0x00cafc, "53|-16|0x00cafc,107|10|0x00cafc,5|16|0x00cafc,61|35|0x00cafc,119|20|0x00cafc,-25|-3|0x00cafc,96|-21|0x00cafc,96|-1|0x00cafc,125|14|0x00cafc"} } }
Page["QQ"]['登录模块']["登录注册首页面一"] = {页面名称="登录注册首页面一",查询范围={389, 1160,707, 1236},点击范围={},多点颜色={{0x00cafc, "-14|-59|0x00cafc,48|-3|0x00cafc,-43|-3|0x00cafc,-153|-15|0x00cafc,-147|-48|0x00cafc,-17|-50|0x00cafc"} } }
Page["QQ"]['登录模块']["登录注册首页面新用户按钮"] = {点击范围={154,1184,242,1208} }
Page["QQ"]['登录模块']["登录注册首页面新用户按钮一"] = {点击范围={400, 1161,695, 1239} }
Page["QQ"]['登录模块']["登录注册首页面登录按钮"] = {点击范围={520,1190,576,1208} }
Page["QQ"]['登录模块']["登录输入账号密码界面"] = {页面名称="登录输入账号密码界面",查询范围={191,76,545,350},点击范围={},多点颜色={{0x000000, "0|6|0xf9ae08,0|12|0x000000,0|19|0xea1c27,-8|33|0xffffff,-5|33|0xea1c27,8|33|0xffffff,109|42|0xffffff,112|42|0x000000,115|36|0xffffff"} } }
Page["QQ"]['登录模块']["登录输入账号密码界面无键盘时账号输入框区域"] = {点击范围={244,424,494,448} }
Page["QQ"]['登录模块']["登录输入账号密码界面有键盘时账号输入框区域"] = {点击范围={240,328,378,366} }
Page["QQ"]['登录模块']["登录输入账号密码界面有键盘时账号输入框区域删除按钮"] = {点击范围={603,343,614,355} }
Page["QQ"]['登录模块']["登录输入账号密码界面有键盘时密码输入框区域"] = {点击范围={309,470,436,493} }
Page["QQ"]['登录模块']["登录输入账号密码界面有键盘时下一步箭头按钮"] = {点击范围={352,639,402,682} }
Page["QQ"]['登录模块']["登录输入账号密码界面无键盘时下一步箭头按钮"] = {点击范围={341,781,412,849} }
Page["QQ"]['登录模块']["输入密码输入框"] = {页面名称="输入密码输入框",查询范围={211,394,597,729},点击范围={},多点颜色={{0xb0b3bf, "1|13|0xf2f3f7,5|13|0xb0b3bf,25|13|0xb0b3bf,29|13|0xf2f3f7,43|13|0xb0b3bf,47|13|0xf2f3f7,52|13|0xb0b3bf,72|19|0xb0b3bf,77|19|0xf2f3f7"} } }
Page["QQ"]['登录模块']["已经输入过账号密码等待点击登录按钮的界面"] = {页面名称="已经输入过账号密码等待点击登录按钮的界面",查询范围={78,492,594,1292},点击范围={},多点颜色={{0x000000, "10|3|0xf2f3f7,19|3|0x000000,-146|622|0x03081a,-146|625|0xffffff,-131|631|0x03081a,-128|631|0xffffff,-100|637|0x03081a,-96|636|0xffffff"} } }
Page["QQ"]['登录模块']["已经输入过账号密码等待点击登录按钮的界面蓝色登录按钮"] = {点击范围={344,786,412,848} }
Page["QQ"]['登录模块']["禁止登录当前上网环境异常请更换网络环境再试弹窗"] = {页面名称="禁止登录当前上网环境异常请更换网络环境再试弹窗",查询范围={263,523,399,649},点击范围={},多点颜色={{0x000000, "0|3|0xffffff,5|3|0x000000,13|3|0xffffff,40|9|0x000000,44|9|0xffffff,48|9|0x000000,6|74|0x000000,10|74|0xfafafa,22|74|0x000000"} } }
Page["QQ"]['登录模块']["禁止登录当前上网环境异常请更换网络环境再试弹窗确定按钮"] = {点击范围={343,778,398,806} }



	-- 验证码部分
Page["QQ"]['登录模块']["填写验证码标题输入短信验证码界面"] = {页面名称="填写验证码标题输入短信验证码界面",查询范围={268,51,468,124},点击范围={},多点颜色={{0x000000, "1|5|0x000000,5|5|0xffffff,14|6|0x000000,46|8|0x000000,46|10|0xffffff,103|10|0x000000,107|10|0xffffff,112|10|0x000000,120|10|0x000000"} } }
Page["QQ"]['登录模块']["填写验证码标题输入短信验证码界面左上角返回键"] = {点击范围={37,66,50,99} }
Page["QQ"]['登录模块']["验证码标题界面"] = {页面名称="验证码标题界面",查询范围={240,61,479,145},点击范围={},多点颜色={{0x020202, "0|2|0xf9f9f9,1|12|0xf9f9f9,1|16|0x000000,7|26|0x000000,11|26|0xf9f9f9,57|26|0x000000,61|26|0xf9f9f9,66|26|0x000000,70|26|0xf9f9f9"} } }
Page["QQ"]['登录模块']["验证码标题界面图形验证码区域"] = {点击范围={223,175,526,298} }
Page["QQ"]['登录模块']["验证码标题界面输入框区域"] = {点击范围={66,413,186,447} }
Page["QQ"]['登录模块']["验证码标题界面输入框区域删除按钮"] = {点击范围={686,423,698,433} }
Page["QQ"]['登录模块']["验证码标题界面右上角完成按钮"] = {点击范围={646,87,709,113} }

Page["QQ"]['登录模块']["验证码标题界面"] = {页面名称="验证码标题界面",查询范围={285,48,458,131},点击范围={},多点颜色={{0x03081a, "0|2|0xffffff,0|14|0x03081a,0|16|0xffffff,21|16|0x03081a,25|16|0xffffff,43|16|0x03081a,47|16|0xffffff,51|16|0x03081a,55|12|0x03081a"} } }
Page["QQ"]['登录模块']["验证码标题界面刷新按钮"] = {点击范围={679,779,707,804} }
Page["QQ"]['登录模块']["验证码标题界面滑块按钮"] = {点击范围={137,688,137,713} }
	-- 验证码部分 结束
	


-- 登录成功部分
Page["QQ"]['登录成功模块']["完成新手任务界面"] = {页面名称="完成新手任务界面",查询范围={3,451,130,537},点击范围={},多点颜色={{0x777777, "0|2|0xffffff,0|5|0x777777,0|7|0xffffff,31|6|0x777777,31|8|0xffffff,33|8|0x777777,36|8|0xffffff,37|6|0x777777,43|8|0xffffff"} } }
Page["QQ"]['登录成功模块']["完成新手任务界面头像设置按钮"] = {点击范围={612,589,695,615} }
Page["QQ"]['登录成功模块']["完成新手任务界面生日设置按钮"] = {点击范围={608,853,701,883} }


Page["QQ"]['登录成功模块']['左上角返回键'] = {点击范围={24,72,71,95} }
--Page["QQ"]['登录成功模块']["消息首页"] = {页面名称="消息首页",查询范围={93,   82,327, 1323},点击范围={},多点颜色={{0x2feb8d, "-10|0|0x31ed8e,-8|9|0x1ce288,1|11|0x19e087,162|1181|0xfafbfe,149|1169|0xb0b3bf,164|1155|0xf9fbfd,149|1161|0xb0b3bf,164|1179|0xfafbfe,147|1166|0xb0b3bf"} } }
Page["QQ"]['登录成功模块']["消息首页"] = {页面名称="消息首页",查询范围={24,1218,152,1322},点击范围={},多点颜色={{0x56d2ff, "11|0|0x2f77d4,11|6|0x3cc6ff"},{0x5fd1ff, "8|-9|0x3256a6,12|-4|0x83ddff,14|3|0xffffff,14|14|0x33c3ff"} } }

Page["QQ"]['登录成功模块']["消息首页左上角头像按钮"] = {点击范围={48,68,77,102} }
Page["QQ"]['登录成功模块']["消息首页底部设置按钮"] = {点击范围={642,1254,675,1284} }
Page["QQ"]['登录成功模块']["设置首页"] = {页面名称="设置首页",查询范围={580,1224,735,1332},点击范围={},多点颜色={{0x0079ff, "6|0|0xf9f9f9,6|11|0x0079ff,0|21|0xf9f9f9"} } }
Page["QQ"]['登录成功模块']["设置首页我的资料按钮"] = {点击范围={44,401,180,427} }
Page["QQ"]['登录成功模块']["底部有设置按钮的界面"] = {页面名称="底部有设置按钮的界面",查询范围={10,1192,120,1309},点击范围={},多点颜色={{0x989eb4, "4|0|0xffffff,9|0|0x989eb4,17|0|0xffffff,12|4|0x989eb4,12|8|0xffffff,12|13|0x989eb4"} } }
Page["QQ"]['登录成功模块']["底部有设置按钮的界面头像区域"] = {点击范围={96,199,475,275} }
Page["QQ"]['登录成功模块']["有好友才有聊弹窗图"] = {页面名称="有好友才有聊弹窗图",查询范围={238,840,583,963},点击范围={},多点颜色={{0x03081a, "0|2|0xffffff,0|4|0x03081a,0|7|0xffffff,34|7|0x03081a,34|11|0xffffff,39|11|0x03081a,42|11|0xffffff,188|2|0x03081a,188|6|0xffffff"}} }
Page["QQ"]['登录成功模块']["有好友才有聊弹窗图"] = {页面名称="有好友才有聊弹窗图",查询范围={238,840,583,963},点击范围={},多点颜色={{0x03081a, "0|2|0xffffff,0|4|0x03081a,0|7|0xffffff,34|7|0x03081a,34|11|0xffffff,39|11|0x03081a,42|11|0xffffff,188|2|0x03081a,188|6|0xffffff"}} }

Page["QQ"]['登录成功模块']["安全提示重新登陆"] = {页面名称="安全提示重新登陆",查询范围={272,  547,484,  615},点击范围={},多点颜色={{0x212121, "8|-7|0xffffff,6|7|0xffffff,2|14|0x0b0b0b,3|31|0xffffff,30|22|0xfcfcfc,37|3|0x9b9b9b,36|3|0x9a9a9a,47|9|0x000000,43|20|0x000000"}} }



--扫码部分
Page["QQ"]["QQ验证粉"]={}
Page["QQ"]["QQ验证粉"]["扫一扫添加好友界面"] = {页面名称="扫一扫添加好友界面",查询范围={592, 1258,703, 1314},点击范围={},多点颜色={{0xffffff, "-1|-11|0x8a8a8a,14|-2|0x090a08,40|-1|0xe8e8e8,72|1|0x1b1b1c,91|0|0xffffff,97|-13|0xf6f6f6,94|12|0xffffff,-37|-32|0x0a0b0b"}}}
Page["QQ"]["QQ验证粉"]["二维码打开相册"] = {页面名称="二维码打开相册",查询范围={648, 53,731, 114},点击范围={695,   74,695,   74},多点颜色={{0x0a0c0b, "-2|0|0x090c0b,-1|2|0x090c0b,-18|3|0xffffff,-10|12|0x090b0b,9|11|0x090b09,-53|-23|0x0a0b0b"}}}
Page["QQ"]["QQ验证粉"]["扫一扫标题界面"] = {页面名称="扫一扫标题界面",查询范围={65,842,695,1325},点击范围={},多点颜色={{0x00cafc, "-1|5|0x00cafc,1|18|0x00cafc,26|18|0x00cafc,125|21|0xffffff,235|20|0xffffff,235|24|0xffffff,387|-321|0x02a8e9,-121|-321|0x02a8e9"}}}
Page["QQ"]["QQ验证粉"]["扫一扫标题界面右上角相册按钮"] = {点击范围={673,72,707,94}}
Page["QQ"]["QQ验证粉"]["相机胶卷标题界面"] = {页面名称="相机胶卷标题界面",查询范围={291,55,431,125},点击范围={},多点颜色={{0x000000, "0|4|0xffffff,0|8|0x000000,0|12|0xffffff,10|12|0x000000,26|12|0x000000,26|8|0xffffff,26|18|0xffffff,42|20|0xffffff,45|20|0x000000"}}}
Page["QQ"]["QQ验证粉"]["相机胶卷标题界面第一张图片"] = {点击范围={26,163,162,295}}
Page["QQ"]["QQ验证粉"]["预览标题_确定"] = {页面名称="预览标题_确定",查询范围={592, 1258,703, 1314},点击范围={638, 1289,638, 1289},多点颜色={{0x00cafc, "27|15|0xdbf7ff,41|15|0x22d1fc,67|7|0xffffff,63|19|0xffffff,79|28|0x00cafc,76|4|0x00cafc,81|-3|0x00cafc"}}}
Page["QQ"]["QQ验证粉"]["相机胶卷_确定"] = {页面名称="相机胶卷_确定",查询范围={536,1233,731,1325},点击范围={619,1281,660,1298},多点颜色={{0xffffff, "-1|6|0x00cafc,5|6|0x00cafc,4|8|0xfdffff,4|13|0x00cafc,6|13|0xffffff,10|13|0xffffff,13|13|0x00cafc,16|13|0xffffff,19|13|0x00cafc"},{0x00cafc, "27|15|0xdbf7ff,41|15|0x22d1fc,67|7|0xffffff,63|19|0xffffff,79|28|0x00cafc,76|4|0x00cafc,81|-3|0x00cafc"}}}
Page["QQ"]["QQ验证粉"]["扫描结果标题界面"] = {页面名称="扫描结果标题界面",查询范围={361,40,484,148},点击范围={},多点颜色={{0x03081a, "0|3|0xffffff,5|3|0x03081a,5|8|0x03081a,5|10|0xffffff,5|13|0x03081a,5|17|0xffffff,28|9|0x03081a,28|6|0xffffff,28|3|0x03081a"}}}
Page["QQ"]["QQ验证粉"]["QQ推广标题界面"] = {页面名称="QQ推广标题界面",查询范围={257,51,491,154},点击范围={},多点颜色={{0x03081a, "5|0|0xffffff,9|8|0xffffff,14|7|0x03081a,23|7|0xffffff,27|7|0x03081a,33|7|0xffffff,40|7|0x03081a,69|7|0x03081a,69|10|0xffffff"}}}
Page["QQ"]["QQ验证粉"]["QQ推广标题界面左上角返回键"] = {点击范围={36,71,48,95}}
Page["QQ"]["QQ验证粉"]["QQ推广标题界面推广工具按钮"] = {点击范围={307,156,350,162}}
Page["QQ"]["QQ验证粉"]["QQ推广标题界面立即免费开通按钮"] = {页面名称="QQ推广标题界面立即免费开通按钮",查询范围={223,677,608,943},点击范围={324,798,423,807},多点颜色={{0xe0f0cc, "6|3|0x79c128,6|12|0xecf6e2,26|3|0xf6faef,28|3|0x7bc22a,31|3|0xedf7e2,45|2|0xf7fbf2,45|4|0x78c028"}}}
Page["QQ"]["QQ验证粉"]["系统繁忙弹窗"] = {页面名称="系统繁忙弹窗",查询范围={125,534,435,722},点击范围={344,754,398,782},多点颜色={{0x0e0e0e, "0|2|0xffffff,5|2|0x000000,9|2|0xffffff,5|17|0xffffff,8|17|0x000000,11|17|0xffffff,15|17|0x000000"}}}
--扫码部分 结束
-- 各个封号弹窗
Page["QQ验证粉"]["被冻结弹窗"] = {页面名称="被冻结弹窗",查询范围={93,496,661,837},点击范围={},多点颜色={{0x55a0e1, "0|3|0xffffff,0|8|0x4799df,4|12|0xffffff,19|13|0x58a2e2,19|16|0xffffff,23|16|0x4799df,28|20|0x4a9bdf,42|7|0x4e9de0,45|7|0xffffff"}}}
Page["QQ验证粉"]["身份验证失败弹窗"] = {页面名称="身份验证失败弹窗",查询范围={173,617,301,696},点击范围={},多点颜色={{0x080808, "2|1|0xffffff,5|0|0x000000,2|4|0x232323,5|8|0xffffff,7|11|0x000000,18|11|0x000000,20|11|0xffffff,51|1|0x070707,51|4|0xffffff"}}}
Page["QQ验证粉"]["服务协议和隐私政策弹窗"] = {页面名称="服务协议和隐私政策弹窗",查询范围={102,334,638,1038},点击范围={},多点颜色={{0x000000, "0|4|0xffffff,0|8|0x000000,0|12|0xffffff,47|17|0x000000,47|22|0xffffff,47|28|0x000000,274|567|0x40a0ff,274|569|0xffffff,274|572|0x40a0ff"}}}
Page["QQ验证粉"]["登录失败请重新输入密码登录弹窗"] = {页面名称="登录失败请重新输入密码登录弹窗",查询范围={88,592,302,732},点击范围={},多点颜色={{0x242424, "0|2|0xffffff,27|-2|0x292929,27|1|0xffffff,55|-7|0x070707,55|-4|0xffffff,60|-4|0x010101,64|-4|0xffffff,94|-3|0xffffff,94|5|0x000000"}}}
Page["QQ验证粉"]["下线通知QQ密码已更改重新登录弹窗"] = {页面名称="下线通知QQ密码已更改重新登录弹窗",查询范围={222,452,546,823},点击范围={},多点颜色={{0x070707, "0|4|0xffffff,10|4|0x000000,15|4|0xffffff,47|73|0x101010,47|77|0xffffff,51|77|0x000000,43|174|0x4799df,47|174|0xffffff,52|174|0x4799df"}}}
Page["QQ验证粉"]["名称未知"] = {页面名称="名称未知",查询范围={222,452,546,823},点击范围={},多点颜色={{0x070707, "0|4|0xffffff,10|4|0x000000,15|4|0xffffff,47|73|0x101010,47|77|0xffffff,51|77|0x000000,43|174|0x4799df,47|174|0xffffff,52|174|0x4799df"}}}


Page["QQ验证粉"]["QQ登录界面"] = {页面名称="QQ登录界面",查询范围={205,184,552,645},点击范围={},多点颜色={{0xea1c27, "1|9|0xea1c27,-5|24|0xf1686f,2|-20|0xe8e8e8,5|-28|0x040404,76|14|0x454545,135|2|0x000000,172|22|0x000000"}}}
Page["QQ验证粉"]["消息底部logo"] = {页面名称="消息底部logo",查询范围={24,1218,152,1322},点击范围={},多点颜色={{0x6ccefc, "5|0|0xe6f0f9,10|-3|0x3c66ba"},{0x5fd1ff, "8|-9|0x3256a6,12|-4|0x83ddff,14|3|0xffffff,14|14|0x33c3ff"} } }
Page["QQ验证粉"]["消息顶部"] = {页面名称="消息顶部",查询范围={317, 54,425, 113},点击范围={},多点颜色={{0xf6fdff, "5|2|0xffffff,6|2|0xb3eaff,0|9|0xfcfeff,-1|26|0x70d7fe,4|22|0xf8fdff,10|12|0xffffff,11|17|0xffffff,9|22|0x49cbfe,21|27|0xffffff"}}}
Page["QQ验证粉"]["顶部搜索"] = {页面名称= "顶部搜索",查询范围 = {259, 151,531, 216},点击范围={320, 166,435, 203},多点颜色={{0xb0b3bf, "3|-3|0xb6b9c4,5|-7|0xbec1cb,27|-5|0xb9bcc6,43|-11|0xe1e2e9,40|-5|0xcbcdd6,43|3|0xb0b3bf,64|-3|0xc7c9d2,73|-3|0xcfd1da,73|-11|0xf5f6fa"}}}
Page["QQ验证粉"]["搜索指定内容"] = {页面名称="搜索指定内容",查询范围={261,147,455,205},点击范围={},多点颜色={{0xb0b3bf, "-2|6|0xffffff,0|6|0xb0b3bf,17|2|0xffffff,19|2|0xb0b3bf,32|0|0xb0b3bf,32|2|0xffffff,32|4|0xb0b3bf,88|0|0xb0b3bf,88|3|0xffffff"}}} 
Page["QQ验证粉"]["来自"] = {页面名称="来自",查询范围={109,207,475,326},点击范围={125, 219,380, 302},多点颜色={{0x9da0ab, "-1|0|0xffffff,6|5|0x9295a2,7|8|0xffffff,16|5|0x878b99,20|5|0xffffff,29|5|0x878b99,47|4|0x9194a1,47|6|0xffffff,71|2|0x9397a3"},{0x9497a4, "-2|0|0xffffff,2|0|0xffffff,8|5|0x9195a1,8|7|0xffffff,24|3|0x9ea1ac,24|5|0xffffff,32|3|0x878b99,90|3|0x878b99,90|5|0xfdfdfd"},{0x9497a4, "-2|0|0xffffff,2|0|0xffffff,8|5|0x9195a1,8|7|0xffffff,24|3|0x9ea1ac,24|5|0xffffff,32|3|0x878b99,41|3|0x878b99,41|6|0xffffff"}}} 
Page["QQ验证粉"]["群聊"] = {页面名称= "群聊",查询范围={17,138,108,196},点击范围={},多点颜色={{0x878b99, "3|0|0xffffff,5|0|0x878b99,7|0|0xffffff,10|5|0xffffff,14|5|0x878b99,26|1|0x878b99,29|1|0xffffff,31|1|0x878b99"}}}
Page["QQ验证粉"]["网络查找"] = {页面名称= "网络查找",查询范围={17, 147,607, 222},点击范围={},多点颜色={{0x090e20, "1|6|0x03081a,0|20|0x090e20,2|17|0xd7d8db,7|10|0x2d3140,7|3|0xffffff,10|11|0xffffff,16|14|0x03081a,14|10|0x03081a,18|6|0x03081a"},{0xffffff, "6|0|0x0b1022,34|6|0x9799a0,71|2|0x03081a,76|6|0x03081a,103|4|0x03081a"}}}
Page["QQ验证粉"]["黑色大小写开关按钮"] = {页面名称="黑色大小写开关按钮",查询范围={12,1146,91,1225},点击范围={},多点颜色={{0x000000, "0|7|0xacb3bd,-7|7|0x000000,-5|12|0x000000,-5|16|0xacb3bd,-1|16|0x000000,2|16|0xacb3bd"},{0x000000, "-10|9|0xffffff,-10|3|0x000000,-10|-8|0xffffff,2|-10|0x000000,12|-10|0xffffff"} } }
Page["QQ验证粉"]["已启动键盘输入"] = {页面名称="已启动键盘输入",查询范围={572, 1242,748, 1328},点击范围={},多点颜色={{0x007aff, "-6|0|0x007aff,-5|14|0x007aff,4|4|0x007aff,-11|-3|0x007aff,-20|14|0x007aff"} } }
Page["QQ验证粉"]["右下角Send按钮"] = {点击范围={655,1261,720,1312} }	
Page["QQ验证粉"]["左上角返回键"] = {点击范围={18,62,57,108}}
Page["QQ验证粉"]["用户对话界面输入框下面的图片按钮"] = {页面名称="用户对话界面输入框下面的图片按钮",查询范围={12,678,350,1324},点击范围={},多点颜色={{0xf0f2fd, "-5|0|0x989eb4,7|0|0x989eb4,15|-6|0xf0f2fd,15|-1|0x989eb4,22|11|0x989eb4,16|14|0xf0f2fc,16|17|0x989eb4,-9|17|0x989eb4,-9|14|0xf0f2fc"}}}
-- 用户对话界面：以右上角三个横线为判断标准
Page["QQ验证粉"]["用户对话界面"] = {页面名称="用户对话界面",查询范围={646,56,742,137},点击范围={},多点颜色={{0x000000, "0|2|0x171718,0|5|0xeff2fd,0|13|0x000000,0|18|0xeef2fc,0|21|0xeef2fc,0|27|0x000000,0|31|0xeef1fd,28|26|0x000000,32|26|0xeff2fe"}}}
Page["QQ验证粉"]["用户对话界面底部输入框区域"] = {点击范围={108,1186,250,1219}}
Page["QQ验证粉"]["用户对话界面获取好友失败提示"] = {页面名称="用户对话界面获取好友失败提示",查询范围={131,23,380,146},点击范围={},多点颜色={{0xff596a, "7|0|0xffffff,12|0|0xff596a,7|13|0xffffff,7|18|0xff596a,58|-7|0x2b2f3f,58|-3|0xffffff,60|4|0x101527"}}}
Page["QQ验证粉"]["用户对话界面加为好友按钮"] = {页面名称="用户对话界面加为好友按钮",查询范围={448,133,659,208},点击范围={487,155,631,178},多点颜色={{0x171818, "5|0|0xe6e9f3,16|1|0x171818,9|11|0xe6e9f3,11|11|0x171818,23|7|0xe6e9f3,23|9|0x171818,31|7|0xe6e9f3,43|1|0x262626,43|4|0xe6e9f3"}}}
Page["QQ验证粉"]["用户对话界面底部麦克风按钮选中和未选中状态"] = {页面名称="用户对话界面底部麦克风按钮选中和未选中状态",查询范围={30,727,140,1325},点击范围={487,155,631,178},多点颜色={{0x989eb4, "6|0|0xeff2fc,6|6|0x989eb4,3|20|0x989eb4,3|25|0xeff2fc,3|28|0x989eb4,3|32|0xeff2fb,3|35|0x989eb4,15|13|0xf0f3fc,18|13|0x989eb4"},{0x00cafc, "5|0|0xeff2fc,5|6|0x00cafc,3|20|0x00cafc,3|24|0xeff2fc,3|27|0x00cafc,3|31|0xeff2fb,3|34|0x00cafc,14|13|0xf0f3fc,17|13|0x00cafc"}}}
Page["QQ验证粉"]["用户对话界面底部麦克风按钮选中状态"] = {页面名称="用户对话界面底部麦克风按钮选中状态",查询范围={30,727,140,1325},点击范围={487,155,631,178},多点颜色={{0x00cafc, "5|0|0xeff2fc,5|6|0x00cafc,3|20|0x00cafc,3|24|0xeff2fc,3|27|0x00cafc,3|31|0xeff2fb,3|34|0x00cafc,14|13|0xf0f3fc,17|13|0x00cafc"}}}
Page["QQ验证粉"]["用户对话界面底部麦克风按钮未选中状态"] = {页面名称="用户对话界面底部麦克风按钮未选中状态",查询范围={30,727,140,1325},点击范围={487,155,631,178},多点颜色={{0x989eb4, "6|0|0xeff2fc,6|6|0x989eb4,3|20|0x989eb4,3|25|0xeff2fc,3|28|0x989eb4,3|32|0xeff2fb,3|35|0x989eb4,15|13|0xf0f3fc,18|13|0x989eb4"}}}
Page["QQ验证粉"]["用户对话界面按住说话按钮"] = {点击范围={108,1186,250,1219}}


	-- 我的资料界面，识别的是底部编辑资料按钮 
Page["QQ"]['登录成功模块']["编辑资料通用左上角返回箭头"] = {点击范围={40,70,48,96} }
Page["QQ"]['登录成功模块']["我的资料界面"] = {页面名称="我的资料界面",查询范围={253,1212,492,1326},点击范围={},多点颜色={{0x03081a, "13|2|0x03081a,13|4|0xebedf5,13|8|0x03081a,33|13|0x03081a,33|16|0xebedf5,118|2|0x03081a,124|8|0x03081a,128|8|0xebedf5,128|17|0x03081a"} } }
Page["QQ"]['登录成功模块']["我的资料界面QQ号字样"] = {页面名称="我的资料界面QQ号字样",查询范围={215,120,429,469},点击范围={},多点颜色={{0x03081a, "-2|5|0x03081a,3|5|0xffffff,5|12|0xffffff,9|12|0x03081a,9|18|0xffffff,13|17|0x03081a,27|12|0xffffff,30|12|0x03081a,30|18|0xffffff"} } }
Page["QQ"]['登录成功模块']["我的资料界面编辑资料按钮"] = {点击范围={322,1267,470,1292} }
Page["QQ"]['登录成功模块']["我的资料界面底部弹起的修改昵称按钮"] = {页面名称="我的资料界面底部弹起的修改昵称按钮",查询范围={176,1123,522,1229},点击范围={244,1155,497,1178},多点颜色={{0x000000, "2|0|0xffffff,5|0|0x000000,10|0|0x000000,11|3|0xffffff,12|6|0x000000,14|8|0xffffff,95|12|0xffffff,99|12|0x000000,102|12|0xffffff"} } }
Page["QQ"]['登录成功模块']["修改我的QQ昵称标题界面"] = {页面名称="修改我的QQ昵称标题界面",查询范围={204,54,530,147},点击范围={},多点颜色={{0xffffff, "0|4|0x09bffd,2|9|0xffffff,4|14|0x09bffd,100|16|0xffffff,106|16|0x10b7fe,115|20|0xffffff,122|20|0x10b6fd,128|20|0xffffff,133|17|0x11b5fd"},{0x000000, "2|0|0xefefef,5|0|0x000000,35|-8|0x000000,35|-4|0xffffff,39|-4|0x000000,140|9|0xffffff,146|9|0x000000,159|9|0x000000,166|9|0xffffff"} } }
Page["QQ"]['登录成功模块']["修改我的QQ昵称标题界面输入框区域"] = {点击范围={37,203,299,231} }
Page["QQ"]['登录成功模块']["修改我的QQ昵称标题界面输入框区域删除按钮"] = {点击范围={678,212,689,222} }
Page["QQ"]['登录成功模块']["修改我的QQ昵称标题界面右上角完成按钮"] = {点击范围={669,72,724,96} }


Page["QQ"]['登录成功模块']["编辑资料标题界面恭喜你获得新勋章"] = {页面名称="编辑资料标题界面恭喜你获得新勋章",查询范围={112,  271,608,  522},点击范围={},多点颜色={{0xa18366, "-37|17|0xbc9b7b,37|24|0x947b61,32|8|0x947b61,-3|26|0xad8f71,-39|36|0xc2a07f,1|58|0xbf9e7d,6|76|0xd8a470,-35|78|0xffcd8d,78|64|0x8b6f54"} } }
Page["QQ"]['登录成功模块']["编辑资料标题界面"] = {页面名称="编辑资料标题界面",查询范围={248,52,476,135},点击范围={},多点颜色={{0x000000, "4|0|0xffffff,12|0|0x000000,12|4|0xffffff,12|6|0x000000,12|9|0xffffff,50|8|0x000000,50|10|0xffffff,73|13|0x000000,73|16|0xffffff"} } }
Page["QQ"]['登录成功模块']["编辑资料标题界面头像按钮"] = {点击范围={40,196,182,224} }
Page["QQ"]['登录成功模块']["编辑资料标题界面性别按钮"] = {点击范围={197,505,309,528} }
Page["QQ"]['登录成功模块']["编辑资料标题界面生日按钮"] = {点击范围={199,595,286,613} }


	-- 更改头像部分
	-- 选择头像底部弹起菜单界面，识别的是弹起菜单中的“从相册选择照片”这个文字
Page["QQ"]['登录成功模块']["选择头像底部弹起菜单界面从相册选择照片文字"] = {页面名称="选择头像底部弹起菜单界面从相册选择照片文字",查询范围={145,830,598,1177},点击范围={},多点颜色={{0x000000, "5|0|0xffffff,29|4|0x000000,29|7|0xffffff,50|7|0x000000,50|10|0xffffff,181|7|0x000000,181|10|0xffffff,225|6|0x000000,225|9|0xffffff"} } }
Page["QQ"]['登录成功模块']["相机胶卷标题界面"] = {页面名称="相机胶卷标题界面",查询范围={268,53,477,134},点击范围={},多点颜色={{0x000000, "0|3|0xffffff,0|9|0x000000,1|16|0xffffff,5|16|0x000000,70|7|0x000000,73|7|0xffffff,77|7|0x000000,114|11|0x000000,114|14|0xffffff"} } }
Page["QQ"]['登录成功模块']["相机胶卷标题界面第一张图片"] = {点击范围={23,162,152,284} }
	-- 移动和缩放标题标题界面，识别的是右下角完成按钮
Page["QQ"]['登录成功模块']["移动和缩放标题标题界面"] = {页面名称="移动和缩放标题标题界面",查询范围={577,1223,730,1311},点击范围={},多点颜色={{0xffffff, "0|2|0x00cafc,5|5|0xffffff,5|7|0x00cafc,30|7|0xffffff"} } }
Page["QQ"]['登录成功模块']["移动和缩放标题标题界面右下角完成按钮"] = {点击范围={637,1255,688,1278} }
	-- 头像完成后预览界面，识别的是“头像商城”文字
Page["QQ"]['登录成功模块']["头像完成后预览界面"] = {页面名称="头像完成后预览界面",查询范围={560,540,744,635},点击范围={},多点颜色={{0xf3fafd, "0|3|0x008fd1,11|-10|0xffffff,15|-10|0x0190d2,16|0|0xf3fafd,122|-9|0x0190d2,128|-9|0xffffff,128|-2|0x008fd1,128|6|0xffffff,129|10|0x018dd0"} } }
Page["QQ"]['登录成功模块']["头像完成后预览界面头像按钮区域"] = {点击范围={291,290,442,450} }
Page["QQ"]['登录成功模块']["头像完成后预览界面QQ默认头像"] = {页面名称="头像完成后预览界面QQ默认头像",查询范围={241,220,490,472},点击范围={},多点颜色={{0xffffff, "23|7|0x000000,44|3|0xffffff,68|10|0x000000,88|1|0xffffff,104|21|0x000000,71|46|0xf8ad08,55|81|0xe82121"} } }
	-- 更改头像部分 结束
	
	--更改性别部分
Page["QQ"]['登录成功模块']["底部性别选择弹起界面"] = {页面名称="底部性别选择弹起界面",查询范围={280,968,480,1294},点击范围={},多点颜色={{0x313131, "0|5|0xf6f6f6,8|5|0x313131,15|5|0xf6f6f6,18|13|0xf6f6f6,19|18|0x313131,23|-49|0xa1a1a1,23|-52|0xf6f6f6,23|-55|0xa1a1a1,23|-58|0xf6f6f6"},{0x313131, "4|1|0xf6f6f6,4|5|0x313131,4|9|0xf6f6f6,14|9|0x313131,20|9|0xf6f6f6,17|71|0xa0a0a0,17|75|0xf6f6f6,16|86|0xa2a2a2,15|81|0xf6f6f6"} } }
Page["QQ"]['登录成功模块']["底部性别选择弹起界面女按钮"] = {点击范围={368,1172,398,1196} }	
Page["QQ"]['登录成功模块']["底部性别选择弹起界面完成按钮"] = {点击范围={649,852,708,874} }	
	--更改性别部分 结束
	
	-- 更改生日部分
Page["QQ"]['登录成功模块']["首次登陆验证码"] = {页面名称="首次登陆验证码",查询范围={225,  433,575,  519},点击范围={},多点颜色={{0x00cafc, "-25|-5|0x00cafc,14|-8|0xffffff,1|3|0xccf4fe,11|-17|0x00cafc,5|20|0x00cafc,14|12|0x00cafc,1|4|0xffffff,25|3|0xffffff,20|-7|0x00cafc"} } }
Page["QQ"]['登录成功模块']["选择出生日期标题界面"] = {页面名称="选择出生日期标题界面",查询范围={229,55,488,139},点击范围={},多点颜色={{0x000000, "0|5|0xffffff,0|9|0x000000,3|15|0x000000,46|15|0x000000,46|18|0xffffff,46|21|0x000000,68|21|0x000000,72|21|0xffffff,72|24|0x000000"} } }
Page["QQ"]['登录成功模块']["选择出生日期标题界面完成按钮"] = {点击范围={650,853,704,873} }
	-- 更改生日部分 结束
	



-- QQ各种弹窗
Page["QQ"]['登录成功模块']["发现新版本升级弹窗"] = {页面名称="发现新版本升级弹窗",查询范围={157,  380,579,  497},点击范围={},多点颜色={{0xc3c3c3, "12|-4|0xffffff,5|6|0x000000,21|15|0xffffff,-11|9|0xffffff,32|5|0x3c3c3c,47|8|0x787878,42|17|0xffffff,54|17|0xffffff,56|5|0x000000"}}}
Page["QQ"]['登录成功模块']["发现新版本升级弹窗暂不升级按钮"] = {点击范围={161,885,287,900} }
Page["QQ"]['登录成功模块']["绑定手机号码标题左上角没有返回但是右上角有关闭界面"] = {页面名称="绑定手机号码标题左上角没有返回但是右上角有关闭界面",查询范围={2,35,747,292},点击范围={},多点颜色={{0x03081a, "6|-2|0xffffff,13|-2|0x03081a,14|2|0xffffff,18|2|0x03081a,242|-6|0x03081a,242|-2|0xffffff,45|-121|0xffffff,45|-118|0xffffff,617|-116|0x000000"}}}
Page["QQ"]['登录成功模块']["绑定手机号码标题左上角没有返回但是右上角有关闭界面右上角关闭按钮"] = {点击范围={653,76,711,95} }
Page["QQ"]['登录成功模块']["iMessage运营商激活弹窗"] = {页面名称="iMessage运营商激活弹窗",查询范围={283,  561,458,  616},点击范围={},多点颜色={{0x000000, "0|3|0xf9f9f9,-1|9|0x8b8b8b,1|17|0x000000,9|14|0x000000,18|16|0x000000,18|7|0xf9f9f9,25|7|0x000000,26|15|0xf9f9f9,13|19|0xf9f9f9"}} }
Page["QQ"]['登录成功模块']["iMessage运营商激活弹窗好按钮"] = {点击范围={481,749,562,788} }
Page["QQ"]['登录成功模块']["通讯录标题界面"] = {页面名称="通讯录标题界面",查询范围={257,50,458,129},点击范围={},多点颜色={{0x000000, "0|3|0xffffff,3|7|0x000000,3|9|0xffffff,3|12|0x000000,3|15|0xffffff,41|16|0xffffff,46|16|0x000000,50|16|0xffffff,62|16|0x000000"} } }
Page["QQ"]['登录成功模块']["通讯录标题界面关闭按钮"] = {点击范围={647,90,709,111} }
Page["QQ"]['登录成功模块']["绑定手机号码标题左上角返回界面"] = {页面名称="绑定手机号码标题左上角返回界面",查询范围={4,41,505,366},点击范围={},多点颜色={{0x03081a, "69|-8|0xffffff,75|-8|0x03081a,80|-8|0xffffff,249|-7|0x03081a,249|-4|0xffffff,41|-122|0x000000,41|-119|0xffffff,41|-115|0x000000,41|-111|0xffffff"} } }
Page["QQ"]['登录成功模块']["绑定手机号码标题界面左上角返回按钮"] = {点击范围={38,71,95,95} }
Page["QQ"]['登录成功模块']["绑定手机号码标题左上角返回按钮的界面"] = {页面名称="绑定手机号码标题左上角返回按钮的界面",查询范围={4,40,319,291},点击范围={},多点颜色={{0x03081a, "1|4|0xffffff,6|5|0x03081a,10|5|0xffffff,108|23|0x03081a,108|19|0xffffff,108|10|0x03081a,30|-112|0x000000,30|-108|0xffffff,35|-108|0x000000"}}}
Page["QQ"]['登录成功模块']["绑定手机号码标题左上角返回按钮的界面左上角返回按钮"] = {点击范围={34,69,90,96} }
Page["QQ"]['登录成功模块']["绑定手机号码标题界面左上角关闭按钮"] = {点击范围={23,76,77,97} }
Page["QQ"]['登录成功模块']["绑定手机号码点击关闭后确定关闭弹窗"] = {页面名称="绑定手机号码点击关闭后确定关闭弹窗",查询范围={205,514,500,656},点击范围={},多点颜色={{0x0f0f0f, "6|4|0xffffff,4|9|0x000000,4|14|0xffffff,8|14|0x000000,76|5|0x000000,76|8|0xffffff,81|8|0x000000,86|8|0xffffff,88|13|0x000000"} } }
Page["QQ"]['登录成功模块']["绑定手机号码点击关闭后确定关闭弹窗关闭按钮"] = {点击范围={493,779,545,798} }
Page["QQ"]['登录成功模块']["确定关闭弹窗"] = {页面名称="确定关闭弹窗",查询范围={399,701,624,876},点击范围={},多点颜色={{0x000000, "0|3|0xffffff,0|8|0x000000,0|12|0xffffff,18|0|0x000000,18|3|0xffffff,39|4|0x000000,39|8|0xffffff,44|13|0xffffff,47|13|0x000000"} } }
Page["QQ"]['登录成功模块']["确定关闭弹窗关闭按钮"] = {点击范围={493,779,551,798} }
Page["QQ"]['登录成功模块']["恭喜你获得新勋章弹窗"] = {页面名称="恭喜你获得新勋章弹窗",查询范围={111,104,506,265},点击范围={},多点颜色={{0x4c4c4c, "0|5|0xd8bc73,0|9|0x4c4c4c,24|4|0xd8bc73,37|19|0xd8bc73,49|19|0xd8bc73,-103|5|0xd8bc73,-105|12|0xd8bc73,-100|25|0xd8bc73"} } }
Page["QQ"]['登录成功模块']["恭喜你获得新勋章弹窗底部关闭按钮"] = {点击范围={364,1191,383,1209} }
Page["QQ"]['登录成功模块']["寻找你的好友弹窗"] = {页面名称="寻找你的好友弹窗",查询范围={99,495,556,870},点击范围={},多点颜色={{0x000000, "-1|6|0xffffff,3|6|0x000000,6|17|0xffffff,8|66|0x000000,12|66|0xffffff,15|66|0x000000,-18|123|0x010101,-20|123|0xffffff,-109|226|0x000000"} } }
Page["QQ"]['登录成功模块']["寻找你的好友弹窗取消按钮"] = {点击范围={196,776,250,798} }
Page["QQ"]['登录成功模块']["开启通讯录弹窗界面"] = {页面名称="开启通讯录弹窗界面",查询范围={153,554,504,872},点击范围={},多点颜色={{0x03081a, "0|5|0xf5f6fa,0|12|0x03081a,69|-4|0x03081a,44|161|0x00cafc,223|185|0x00cafc,173|185|0xffffff,173|189|0x00cafc,175|193|0xffffff"},{0x03081a, "0|6|0xf5f6fa,-5|6|0x03081a,3|14|0xf5f6fa,3|19|0x03081a,45|176|0x00cafc,54|191|0xffffff,54|199|0xffffff,57|199|0x00cafc,104|199|0xffffff"} } }
Page["QQ"]['登录成功模块']["开启通讯录弹窗界面关闭按钮"] = {点击范围={657,74,707,95} }
Page["QQ"]['登录成功模块']["开启QQ之旅"] = {页面名称="开启QQ之旅",查询范围={132,1179,637,1315},点击范围={},多点颜色={{0x000000, "0|3|0xffffff,6|3|0x000000,9|3|0xffffff,9|11|0x000000,9|16|0xffffff,78|20|0xffffff,83|20|0x000000,86|17|0xffffff,86|28|0xffffff"} } }
Page["QQ"]['登录成功模块']["开启QQ之旅右上角全部跳过按钮"] = {点击范围={597,70,716,94} }
Page["QQ"]['登录成功模块']["开启QQ之旅全部跳过弹窗"] = {页面名称="开启QQ之旅全部跳过弹窗",查询范围={90,527,608,811},点击范围={},多点颜色={{0x000000, "3|0|0xffffff,9|0|0x000000,11|0|0xffffff,14|0|0x000000,25|-2|0x000000,25|2|0xffffff,28|2|0x000000,37|2|0x000000,40|2|0xffffff"} } }
Page["QQ"]['登录成功模块']["开启QQ之旅全部跳过弹窗跳过按钮"] = {点击范围={491,759,548,783} }
Page["QQ"]['登录成功模块']["消息首页喜庆提示"] = {页面名称="消息首页喜庆提示",查询范围={642,131,746,223},点击范围={},多点颜色={{0xbe2c4a, "15|12|0xffffff,24|13|0xbe2c4a,32|13|0xffffff,41|13|0xbe2c4a,41|43|0xbe2c4a,41|49|0xb21e3d"}}}
Page["QQ"]['登录成功模块']["消息首页喜庆提示关闭按钮"] = {点击范围={718,171,727,183}}
Page["QQ"]['登录成功模块']["消息首页点击搜索后的界面"] = {页面名称="消息首页点击搜索后的界面",查询范围={4,25,749,383},点击范围={},多点颜色={{0xb0b3bf, "-1|4|0xf5f6fa,2|14|0xb0b3bf,5|14|0xf5f6fa,44|16|0xb0b3bf,66|16|0xf5f6fa,344|-5|0x4aa5ff,347|-1|0xffffff,347|2|0x57abff,347|5|0xffffff"},{0x4aa5ff, "-2|10|0x40a0ff,-345|4|0xb0b3bf,-596|162|0x989eb4,-407|166|0x989eb4,-393|166|0xffffff,-378|166|0x989eb4,-192|171|0x989eb4,7|160|0x989eb4"}}}
Page["QQ"]['登录成功模块']["消息首页点击搜索后的界面取消按钮"] = {点击范围={665,74,720,96}}



-- QQ授权第三方应用登录4.6版本
Page["QQ"]['登录成功模块']["QQ登录标题界面"] = {页面名称="使用QQ登录标题界面",查询范围={233,66,477,161},点击范围={},多点颜色={{0x000000, "5|4|0xf9f9f9,5|17|0xf9f9f9,11|17|0x000000,18|17|0x000000,24|17|0xf9f9f9,75|16|0x000000,75|21|0xf9f9f9,75|26|0x000000,105|23|0x000000"} } }
Page["QQ"]['登录成功模块']["QQ登录标题界面登录按钮"] = {点击范围={331,421,410,453} }
Page["QQ"]['登录成功模块']["QQ想要打开QQ安全中心弹窗"] = {页面名称="QQ想要打开QQ安全中心弹窗",查询范围={490,689,581,782},点击范围={},多点颜色={{0x007aff, "4|0|0xf5f5f5,4|-5|0x007aff,4|6|0x007aff,4|12|0xf5f5f5,12|12|0x007aff,16|12|0xf7f7f7,16|7|0x007aff,16|-1|0xf6f6f7,16|-5|0x007aff"} } }
Page["QQ"]['登录成功模块']["QQ想要打开QQ安全中心弹窗打开按钮"] = {点击范围={471,706,536,742} }


-- 获得勋章弹窗
-- QQ各种弹窗 结束


-- 登录失败各种弹窗
Page["QQ"]['登录失败模块']["下线通知涉嫌传播违法信息被冻结弹窗"] = {页面名称="下线通知涉嫌传播违法信息被冻结弹窗",查询范围={260,491,499,702},点击范围={},多点颜色={{0x000000, "8|9|0x000000,72|77|0x000000,72|82|0x000000,88|82|0x232323,93|128|0x4799df,69|128|0x4799df,58|128|0x4799df"}}}
Page["QQ"]['登录失败模块']["冻结解除保护弹窗"] = {页面名称="冻结解除保护弹窗",查询范围={155,458,627,933},点击范围={},多点颜色={{0x000000, "2|0|0xffffff,5|0|0x000000,8|0|0xffffff,84|-10|0x000000,84|-6|0xffffff,93|-5|0x000000,124|-7|0x000000,124|-4|0xffffff,129|-4|0x000000"}}}
Page["QQ"]['登录失败模块']["登录失败请重新输入密码登录弹窗"] = {页面名称="登录失败请重新输入密码登录弹窗",查询范围={88,592,302,732},点击范围={},多点颜色={{0x242424, "0|2|0xffffff,27|-2|0x292929,27|1|0xffffff,55|-7|0x070707,55|-4|0xffffff,60|-4|0x010101,64|-4|0xffffff,94|-3|0xffffff,94|5|0x000000"}}}
Page["QQ"]['登录失败模块']["登录失败请重新输入密码登录弹窗确定按钮"] = {点击范围={342,755,403,781} }
Page["QQ"]['登录失败模块']['身份验证失败请你重新登录弹窗'] = {页面名称="身份验证失败请你重新登录弹窗",查询范围={92,592,413,721},点击范围={},多点颜色={{0x000000, "3|0|0xf4f4f4,3|2|0x2c2c2c,3|4|0xffffff,41|6|0x0a0a0a,41|9|0xffffff,126|0|0x070707,126|3|0xffffff,122|3|0x010101,143|3|0x1b1b1b"} } }
Page["QQ"]['登录失败模块']['登录失败请重新输入密码登录弹窗'] = {页面名称="登录失败请重新输入密码登录弹窗",查询范围={102,594,591,713},点击范围={},多点颜色={{0x1b1b1b, "1|2|0xfafafa,60|4|0x070707,60|7|0xffffff,64|7|0x010101,325|0|0x2b2b2b,325|3|0xffffff,330|3|0x000000,348|11|0x242424,348|13|0xffffff"} } }
Page["QQ"]['登录失败模块']['登录失败请重新输入密码登录弹窗确定按钮'] = {点击范围={346,760,399,783} }
Page["QQ"]['登录失败模块']['去安全中心弹窗'] = {页面名称="去安全中心弹窗",查询范围={244,665,398,751},点击范围={},多点颜色={{0x000000, "0|4|0xffffff,0|9|0x000000,-1|14|0xffffff,4|14|0x000000,9|14|0xffffff,9|21|0x000000,44|17|0x000000,44|12|0xffffff,44|7|0x000000"} } }
Page["QQ"]['登录失败模块']['去安全中心弹窗去安全中心按钮'] = {点击范围={297,691,443,716} }
Page["QQ"]['登录失败模块']['密码错误弹窗'] = {页面名称="密码错误弹窗",查询范围={205,611,334,714},点击范围={},多点颜色={{0x000000, "2|0|0xffffff,1|10|0xffffff,4|10|0x000000,8|10|0xffffff,13|10|0x000000,28|7|0x000000,31|6|0xffffff,62|6|0x0b0b0b,65|6|0xffffff"} } }
Page["QQ"]['登录失败模块']["密码错误弹窗确定按钮"] = {点击范围={346,759,397,779} }
Page["QQ"]['登录模块']["登录输入账号密码界面无键盘时密码输入框区域"] = {点击范围={310,553,439,592} }
Page["QQ"]['登录模块']["登录输入账号密码界面有键盘时密码输入框区域删除按钮"] = {点击范围={602,476,614,487} }
Page["QQ"]['登录失败模块']['网络错误弹窗'] = {页面名称="网络错误弹窗",查询范围={94,588,306,729},点击范围={},多点颜色={{0x000000, "3|8|0xffffff,7|8|0x000000,10|8|0xffffff,15|8|0x000000,18|8|0xffffff,88|8|0x000000,91|8|0xffffff,100|8|0x000000,103|8|0xffffff"} } }
Page["QQ"]['登录失败模块']["网络错误弹窗确定按钮"] = {点击范围={344,755,400,784} }
--8.1.5登录时设备锁验证部分
Page["QQ"]['登录失败模块']['登录失败需要解设备锁界面'] = {页面名称="登录失败需要解设备锁界面",查询范围={218,338,513,602},点击范围={},多点颜色={{0xfdc23c, "9|-6|0xb58a2b,16|2|0xfdc23c,77|30|0x4da1fe"} } }
Page["QQ"]['登录失败模块']["登录失败需要解设备锁界面其他验证方式按钮"] = {点击范围={301,925,447,942} }
Page["QQ"]['登录失败模块']['登录失败需要解设备锁界面密保手机更改按钮'] = {页面名称="登录失败需要解设备锁界面密保手机更改按钮",查询范围={381,683,504,764},点击范围={},多点颜色={{0x509ee0, "24|1|0x539fe1,24|4|0xebedf5,24|9|0x56a0e1"} } }
Page["QQ"]['登录失败模块']['资料辅助页面重新识别'] = {页面名称="资料辅助页面重新识别",查询范围={43,  450,112,  648},点击范围={},多点颜色={{0x989eb4, "6|-16|0xffffff,29|-12|0xffffff,29|-21|0xffffff,29|-29|0xffffff,28|-33|0x989eb4,35|-23|0x989eb4,27|-9|0x989eb4,16|-22|0x989eb4,-2|-22|0x989eb4"} } }


Page["QQ"]['登录失败模块']['登录验证标题界面扫码二维码界面'] = {页面名称="登录验证标题界面扫码二维码界面",查询范围={113,38,629,881},点击范围={},多点颜色={{0x03081a, "8|4|0xffffff,8|8|0x03081a,8|13|0x03081a,111|0|0x03081a,111|4|0xffffff,117|4|0x03081a,95|719|0x000000,95|722|0xf7f7f9,98|722|0x000000"} } }
Page["QQ"]['登录失败模块']['登录验证标题界面扫码二维码界面左上角返回键'] = {点击范围={35,70,50,99} }
Page["QQ"]['登录失败模块']['登录验证标题界面文字资料辅助验证按钮'] = {页面名称="登录验证标题界面文字资料辅助验证按钮",查询范围={6,388,473,800},点击范围={163,429,351,452},多点颜色={{0x03081a, "-89|2|0x989eb4,-89|7|0xffffff,-94|15|0x989eb4,-94|30|0xffffff,-103|34|0x989eb4,-109|34|0xffffff,140|5|0xffffff,140|8|0x03081a,177|7|0x03081a"} } }
Page["QQ"]['登录失败模块']['登录验证标题界面浅蓝色资料辅助验证按钮'] = {页面名称="登录验证标题界面浅蓝色资料辅助验证按钮",查询范围={183,307,534,823},点击范围={},多点颜色={{0xb0b3bf, "-24|0|0x575b6a,17|-2|0x4d5261,11|210|0xf5f6f9,11|213|0xb2effe,11|287|0xb2effe,11|340|0xf5f6f9,11|349|0xb2effe,11|360|0xb2effe"} } }
Page["QQ"]['登录失败模块']['登录验证标题界面深蓝色资料辅助验证按钮'] = {页面名称="登录验证标题界面深蓝色资料辅助验证按钮",查询范围={374,694,563,826},点击范围={275,740,478,771},多点颜色={{0x00cafc, "0|3|0xffffff,0|7|0x00cafc,6|7|0xffffff,11|11|0x00cafc,11|15|0xffffff,11|20|0x00cafc,-29|12|0xffffff,-29|9|0x00cafc,-45|4|0xffffff"} } }
Page["QQ"]['登录失败模块']['登录验证标题界面填写密保手机界面'] = {页面名称="登录验证标题界面填写密保手机界面",查询范围={174,150,394,273},点击范围={},多点颜色={{0x03081a, "0|5|0xffffff,-8|9|0x03081a,15|10|0x03081a,19|10|0xffffff,37|14|0x03081a,37|19|0xffffff,37|27|0x03081a,87|9|0x03081a,87|13|0xffffff"} } }
Page["QQ"]['登录失败模块']["登录验证标题界面填写密保手机界面手机号输入框"] = {点击范围={207,415,296,444} }
Page["QQ"]['登录失败模块']["登录验证标题界面填写密保手机界面下一步按钮"] = {点击范围={315,600,424,640} }
Page["QQ"]['登录失败模块']['填写密保手机界面点击下一步后顶部红色错误提示'] = {页面名称="填写密保手机界面点击下一步后顶部红色错误提示",查询范围={100,25,244,113},点击范围={},多点颜色={{0xff596a, "6|0|0xffffff,11|0|0xff596a"} } }
	--密保手机验证成功后
Page["QQ"]['登录失败模块']['以上都不是选项'] = {页面名称="以上都不是选项",查询范围={6,706,479,1115},点击范围={},多点颜色={{0x000000, "5|0|0xffffff,6|3|0x000000,43|3|0x000000,47|3|0xffffff,47|10|0x000000,147|0|0x000000,147|2|0xffffff,147|5|0x000000,147|8|0xffffff"} } }
Page["QQ"]['登录失败模块']['登录验证标题选择你加入的群界面'] = {页面名称="登录验证标题选择你加入的群界面",查询范围={225,47,606,349},点击范围={},多点颜色={{0x03081a, "0|3|0xffffff,0|5|0x03081a,0|8|0xffffff,78|118|0x03081a,78|123|0xffffff,84|123|0x03081a,88|123|0xffffff,97|129|0x03081a,121|202|0x878b99"} } }
Page["QQ"]['登录失败模块']["登录验证标题选择你加入的群界面以上都不是按钮"] = {点击范围={104,1006,252,1028} }
Page["QQ"]['登录失败模块']['登录验证标题选择你加入的群界面灰色下一步按钮'] = {页面名称="登录验证标题选择你加入的群界面灰色下一步按钮",查询范围={186,1096,640,1269},点击范围={},多点颜色={{0xf5f6f9, "0|2|0xb2effe"} } }
Page["QQ"]['登录失败模块']['登录验证标题选择你加入的群界面蓝色下一步按钮'] = {页面名称="登录验证标题选择你加入的群界面蓝色下一步按钮",查询范围={186,1096,640,1269},点击范围={327,1191,417,1217},多点颜色={{0xf5f6f9, "0|2|0x00cafc"} } }
Page["QQ"]['登录失败模块']['登录验证标题选择你用过的头像界面'] = {页面名称="登录验证标题选择你用过的头像界面",查询范围={300,45,561,361},点击范围={},多点颜色={{0x03081a, "0|2|0xffffff,0|14|0x03081a,0|17|0xffffff,6|121|0x03081a,6|126|0xffffff,6|133|0x03081a,6|138|0xffffff,35|201|0x878b99,35|204|0xffffff"} } }
Page["QQ"]['登录失败模块']["登录验证标题选择你用过的头像界面以上都不是按钮"] = {点击范围={152,778,302,802} }
Page["QQ"]['登录失败模块']['登录验证标题选择你用过的头像界面灰色下一步按钮'] = {页面名称="登录验证标题选择你用过的头像界面灰色下一步按钮",查询范围={191,902,564,1054},点击范围={},多点颜色={{0xf5f6f9, "0|4|0xb2effe"} } }
Page["QQ"]['登录失败模块']['登录验证标题选择你用过的头像界面蓝色下一步按钮'] = {页面名称="登录验证标题选择你用过的头像界面蓝色下一步按钮",查询范围={191,902,564,1054},点击范围={328,968,412,996},多点颜色={{0xf5f6f9, "0|4|0x00cafc"} } }
Page["QQ"]['登录失败模块']['登录验证标题选择你用过的头像界面顶部红色错误提示'] = {页面名称="登录验证标题选择你用过的头像界面顶部红色错误提示",查询范围={102,27,302,143},点击范围={},多点颜色={{0xff596a, "4|0|0xffffff,9|0|0xff596a"} } }
Page["QQ"]['登录失败模块']['登录验证标题验证失败界面'] = {页面名称="登录验证标题验证失败界面",查询范围={237,290,493,509},点击范围={},多点颜色={{0xff4060, "12|0|0xffffff,22|0|0xff4060"} } }
Page["QQ"]['登录失败模块']['登录验证标题验证成功界面'] = {页面名称="登录验证标题验证成功界面",查询范围={227,295,496,521},点击范围={},多点颜色={{0x02c89d, "0|16|0xffffff,-5|33|0x02c89d,29|24|0x02c89d,28|7|0xffffff"} } }
Page["QQ"]['登录失败模块']["登录验证标题验证成功界面左上角返回键"] = {点击范围={37,69,49,97} }
Page["QQ"]['登录失败模块']['QQ输入完账号密码蓝色登录箭头'] = {页面名称="QQ输入完账号密码蓝色登录箭头",查询范围={147,595,596,1060},点击范围={},多点颜色={{0x32a8ff, "11|13|0xffffff,11|24|0x0cc3fd"} } }

-- 登录失败各种弹窗 结束





Page["QQ安全中心"] = {}
Page["QQ安全中心"]['登录QQ开启安全之旅按钮'] = {页面名称="登录QQ开启安全之旅按钮",查询范围={122,525,342,624},点击范围={302,369,413,475},多点颜色={{0x4363f1, "0|4|0xffffff,0|7|0x4365f3,0|10|0xffffff,0|13|0x4365f3,69|16|0x406af3,76|19|0xffffff,86|22|0x3f6bf3,118|25|0x3d6df3,123|25|0xffffff"} } }
Page["QQ安全中心"]['登录标题界面QQ登录按钮'] = {页面名称="登录标题界面QQ登录按钮",查询范围={335,790,467,869},点击范围={356,817,436,842},多点颜色={{0xffffff, "0|4|0x247fed,8|4|0xffffff,5|17|0xffffff,48|17|0x247fed,48|13|0xffffff,48|11|0x247fed,71|7|0xffffff,71|4|0x247fed,71|2|0xffffff"} } }
Page["QQ安全中心"]['登录标题界面该号码不是本机号按钮'] = {页面名称="登录标题界面该号码不是本机号按钮",查询范围={201,527,396,620},点击范围={248,556,490,580},多点颜色={{0x247fed, "0|4|0xeaedf0,4|4|0x247fed,48|4|0x2c83ed,48|6|0xeaedf0,48|9|0x247fed,102|-8|0x247fed,102|-4|0xeaedf0,110|7|0x247fed,113|7|0xeaedf0"} } }
Page["QQ安全中心"]['登录标题界面该号码仍可用按钮'] = {页面名称="登录标题界面该号码仍可用按钮",查询范围={225,457,499,568},点击范围={282,487,457,510},多点颜色={{0x247fed, "-1|4|0xeaedf0,2|4|0x247fed,50|2|0x247fed,50|5|0xeaedf0,47|8|0x247fed,120|1|0x247fed,121|-2|0xeaedf0,118|5|0xeaedf0,122|6|0x247fed"} } }
Page["QQ安全中心"]['我的密码标题我已发送按钮'] = {页面名称="我的密码标题我已发送按钮",查询范围={269,538,474,649},点击范围={311,574,436,604},多点颜色={{0xffffff, "10|6|0xfefeff,10|8|0x1476ee,40|9|0xffffff,40|4|0x1476ee,52|4|0xffffff,57|4|0x1476ee,79|5|0xffffff,79|8|0x1476ee,112|10|0xffffff"} } }
Page["QQ安全中心"]['我的密码标题正在处理提示条'] = {页面名称="我的密码标题正在处理提示条",查询范围={214,601,491,745},点击范围={},多点颜色={{0x000000, "0|5|0xebedef,8|5|0x000000,13|5|0xebedef,13|13|0x000000,112|14|0x000000,112|17|0xebedef,134|23|0x000000,138|23|0xebedef,143|23|0x000000"} } }
Page["QQ安全中心"]['我的密码标题短信还未送达弹窗'] = {页面名称="我的密码标题短信还未送达弹窗",查询范围={109,533,476,721},点击范围={},多点颜色={{0x000000, "0|3|0xc6e8f9,-3|8|0x000000,41|15|0x000000,45|15|0xcaeaf9,119|8|0x000000,119|13|0xcceaf9,123|13|0x000000,159|2|0x000000,159|6|0xccebf9"} } }
Page["QQ安全中心"]['我的密码标题停留时间过长弹窗'] = {页面名称="我的密码标题停留时间过长弹窗",查询范围={267,539,488,676},点击范围={},多点颜色={{0x000000, "0|5|0xcbebf9,4|5|0x000000,14|5|0x000000,14|9|0xcdebf9,20|9|0x000000,83|4|0x000000,83|7|0xccebf9,87|7|0x000000,116|11|0x000000"} } }
Page["QQ安全中心"]['我的密码标题短信还未送达弹窗确定按钮'] = {点击范围={345,737,400,760} }
Page["QQ安全中心"]['验证成功标题开启安全之旅按钮'] = {页面名称="验证成功标题开启安全之旅按钮",查询范围={140,376,596,900},点击范围={278,760,465,788},多点颜色={{0x19bf3d, "0|8|0xffffff,6|9|0x19bf3d,-144|287|0x1476ee,-144|290|0xffffff,-144|294|0x1476ee,-140|294|0xffffff,-135|294|0x1476ee,-7|295|0xffffff,-7|298|0x1476ee"} } }


Page["QQ空间"] = {}
Page["QQ空间"]['QQ空间启动首页'] = {页面名称="QQ空间启动首页",查询范围={199,847,512,989},点击范围={},多点颜色={{0x5192ed, "2|0|0xffffff,5|0|0x5192ed,7|0|0xffffff,10|0|0x5192ed,17|5|0x5192ed,19|5|0xffffff,84|9|0xffffff,87|9|0x5192ed,91|9|0xffffff"} } }
Page["QQ空间"]['QQ空间启动首页账号密码登录按钮'] = {点击范围={269,893,468,916} }
--QQ空间输入账号密码界面，以蓝色登录按钮为识别依据
Page["QQ空间"]['QQ空间输入账号密码界面'] = {页面名称="QQ空间输入账号密码界面",查询范围={231,580,545,1024},点击范围={},多点颜色={{0xecf3ff, "2|4|0x3d87ff,10|9|0xecf3ff,10|12|0x3d87ff,10|14|0xecf3ff,40|13|0xecf3ff,40|15|0x3d87ff,45|15|0xecf3ff,49|16|0x3d87ff,49|21|0xecf3ff"} } }
Page["QQ空间"]['QQ空间输入账号密码界面无键盘时账号输入框区域'] = {点击范围={78,639,265,663} }
Page["QQ空间"]['QQ空间输入账号密码界面有键盘时账号输入框区域'] = {点击范围={80,439,265,462} }
Page["QQ空间"]['QQ空间输入账号密码界面有键盘时密码输入框区域'] = {点击范围={79,526,133,554} }
Page["QQ空间"]['QQ空间输入账号密码界面无键盘时登录按钮'] = {点击范围={346,891,400,918} }
Page["QQ空间"]['QQ空间输入账号密码界面有键盘时登录按钮'] = {点击范围={338,668,407,700} }
Page["QQ空间"]['QQ空间身份验证标题界面'] = {页面名称="QQ空间身份验证标题界面",查询范围={234,39,500,141},点击范围={},多点颜色={{0x2d2d2d, "0|3|0xf8f8f8,0|5|0x2d2d2d,0|8|0xf8f8f8,26|13|0x2d2d2d,30|13|0xf8f8f8,42|11|0x2d2d2d,42|14|0xf8f8f8,97|14|0x2d2d2d,100|14|0xf8f8f8"} } }
Page["QQ空间"]['QQ空间身份验证标题界面输入框区域'] = {点击范围={60,440,161,463} }
Page["QQ空间"]['QQ空间身份验证标题界面输入框区域删除按钮'] = {点击范围={675,446,686,455} }
Page["QQ空间"]['QQ空间身份验证标题界面右上角提交按钮'] = {点击范围={665,74,722,97} }
Page["QQ空间"]['QQ空间去安全中心界面'] = {页面名称="QQ空间去安全中心界面",查询范围={375,465,653,838},点击范围={},多点颜色={{0x181818, "0|3|0xffffff,0|8|0x000000,10|14|0xffffff,46|7|0x000000,46|12|0xffffff,46|18|0x000000,78|14|0x000000,78|17|0xffffff,83|17|0x000000"} } }
Page["QQ空间"]['QQ空间密码提示输入密码错误界面'] = {页面名称="QQ空间密码提示输入密码错误界面",查询范围={43,667,198,778},点击范围={},多点颜色={{0x7f7f7f, "3|3|0xffffff,2|11|0xffffff,5|11|0x7f7f7f,14|13|0xffffff,14|16|0x7f7f7f,11|21|0x7f7f7f,16|21|0xffffff,22|23|0x7f7f7f,18|29|0xffffff"} } }
Page["QQ空间"]['QQ空间登录失败请重试界面'] = {页面名称="QQ空间登录失败请重试界面",查询范围={170,456,493,788},点击范围={},多点颜色={{0xfecc2f, "0|2|0xffffff,-6|127|0x000000,-6|131|0xffffff,-2|131|0x000000,2|131|0xffffff,2|127|0x000000,5|136|0x000000,5|140|0xffffff,1|140|0x000000"} } }

Page["QQ空间"]['QQ空间登录成功动态界面'] = {页面名称="QQ空间登录成功动态界面",查询范围={14,1233,144,1332},点击范围={},多点颜色={{0xffc600, "10|0|0xffffff,10|8|0xffc600,10|-10|0xffc600"} } }

Page["QQ空间"]["QQ空间登录成功"] = {页面名称="QQ空间登录成功",查询范围={ 333, 1248, 410, 1316},点击范围={},多点颜色={{0x1b2328, "16|0|0x1b2328,16|-15|0x1b2328,36|-15|0xffd412,28|15|0xffd410,2|-9|0xffd718,-26|-34|0xffda21"}}}
--QQ空间各种弹窗
--Page["QQ空间"]['QQ空间登录成功广告界面'] = {页面名称="QQ空间登录成功广告界面",查询范围={14,1233,144,1332},点击范围={},多点颜色={{0xffc600, "10|0|0xffffff,10|8|0xffc600,10|-10|0xffc600"} } }



---------------以下是QQ国际版部分-----------------------------
Page["QQ国际版"] = {}
Page["QQ国际版"]['登录模块'] = {}
Page["QQ国际版"]['登录成功模块'] = {}


Page["QQ国际版"]['登录模块']['启动宣传页1'] = {页面名称="启动宣传页1",查询范围={95,109,547,620},点击范围={},多点颜色={{0xfcbb4c, "53|-26|0xca9947,93|-4|0x7d6b4f,58|168|0xffffff,96|165|0xca9947"} } }
Page["QQ国际版"]['登录模块']['启动宣传页2'] = {页面名称="启动宣传页2",查询范围={41,206,547,475},点击范围={},多点颜色={{0x67cdb6, "6|-51|0xfe9651,170|17|0x67cdb6,163|-11|0xfe9651,263|33|0xfe9651,294|23|0x59bbc1"} } }
Page["QQ国际版"]['登录模块']['启动宣传页3'] = {页面名称="启动宣传页3",查询范围={87,  143,609,  611},点击范围={},多点颜色={{0xca9947, "17|-42|0x7d6b4f,46|-21|0xfcbb4c,66|-17|0xffffff,126|-32|0x7d6b4f,-57|-198|0xca9947,95|-172|0xffffff,-56|-50|0xffffff,-120|-37|0xfcbb4c,-5|-42|0x7d6b4f"} } }
Page["QQ国际版"]['登录模块']['启动宣传页4'] = {页面名称="启动宣传页4",查询范围={47,  249,352,  490},点击范围={},多点颜色={{0x321a13, "43|-28|0x67cdb6,-79|19|0xf6f5f5,-3|26|0xffffff,68|24|0xf6f5f5,9|21|0x321a13,3|73|0x9aa292,64|84|0x321a13,38|103|0x67cdb6,-60|44|0x67cdb6"} } }
Page["QQ国际版"]['登录模块']['启动宣传页2进入QQ按钮'] = {点击范围={305,1168,436,1197} }
Page["QQ国际版"]['登录模块']['启动输入账号密码界面'] = {页面名称="启动输入账号密码界面",查询范围={156,87,541,379},点击范围={},多点颜色={{0x000000, "28|45|0xf9ae08,51|80|0xe81f1f"} } }
Page["QQ国际版"]['登录模块']['启动输入账号密码界面账号输入框'] = {页面名称="启动输入账号密码界面账号输入框",查询范围={193,247,564,510},点击范围={},多点颜色={{0xc7c7cd, "0|10|0xc7c7cd,2|10|0xffffff,5|10|0xc7c7cd,26|9|0xc7c7cd,26|5|0xffffff,53|3|0xc7c7cd,53|-1|0xffffff,53|-5|0xc7c7cd"} } }
Page["QQ国际版"]['登录模块']['启动输入账号密码界面账号输入框删除按钮'] = {点击范围={711,  331,731,  343} }
Page["QQ国际版"]['登录模块']['启动输入账号密码界面密码输入框'] = {页面名称="启动输入账号密码界面密码输入框",查询范围={193,247,564,510},点击范围={},多点颜色={{0xc7c7cd, "3|20|0xc7c7cd,7|20|0xffffff,13|20|0xc7c7cd,18|20|0xffffff,21|24|0xc7c7cd,55|21|0xffffff,55|18|0xc7c7cd,55|14|0xffffff,55|11|0xc7c7cd"} } }
Page["QQ国际版"]['登录模块']['启动输入账号密码界面登录按钮'] = {点击范围={346,551,403,579} }
Page["QQ国际版"]['登录模块']['隐私政策变更协议界面'] = {页面名称="隐私政策变更协议界面",查询范围={403,42,561,334},点击范围={},多点颜色={{0xffffff, "0|-2|0x4c9bff,-11|0|0xffffff,-22|-4|0xffffff,-11|152|0x333333,-11|158|0xffffff,-7|158|0x333333,-6|165|0xffffff,-6|167|0x333333"} } }
Page["QQ国际版"]['登录模块']['隐私政策变更协议界面我同意上述变更勾选框'] = {点击范围={39,961,51,978} }
Page["QQ国际版"]['登录模块']['隐私政策变更协议界面蓝色继续按钮'] = {页面名称="隐私政策变更协议界面蓝色继续按钮",查询范围={438,1047,689,1173},点击范围={486,1094,573,1132},多点颜色={{0x3399ff, "0|-3|0xffffff"} } }
Page["QQ国际版"]['登录模块']['字母验证码标题界面'] = {页面名称="字母验证码标题界面",查询范围={230,39,514,138},点击范围={},多点颜色={{0xffffff, "0|3|0x005eb3,0|15|0xffffff,0|18|0x005bb3,41|19|0xffffff,44|19|0x0058b3,51|28|0xffffff,92|0|0xffffff,92|4|0x0056b3"} } }
Page["QQ国际版"]['登录模块']['字母验证码标题界面验证码输入框'] = {点击范围={38,353,112,373} }
Page["QQ国际版"]['登录模块']['字母验证码标题界面验证码输入框删除按钮'] = {点击范围={687,360,698,370} }
Page["QQ国际版"]['登录模块']['字母验证码标题界面右上角完成按钮'] = {点击范围={648,74,704,96} }
Page["QQ国际版"]['登录模块']['请求超时标题界面'] = {页面名称="请求超时标题界面",查询范围={248,46,496,140},点击范围={},多点颜色={{0xffffff, "-12|10|0xffffff,-12|14|0x4ca9ff,-8|14|0xffffff,32|5|0xffffff,32|1|0x4ca8ff,84|0|0xffffff,84|4|0x4ca4ff,88|4|0xffffff,92|4|0x4ca3ff"} } }
Page["QQ国际版"]['登录模块']['请求超时标题界面左上角返回按钮'] = {点击范围={50,72,98,95} }


Page["QQ国际版"]['登录模块']['设备锁标题界面'] = {页面名称="设备锁标题界面",查询范围={264,43,477,143},点击范围={},多点颜色={{0xffffff, "0|3|0x4ca9ff,-3|9|0xffffff,-3|14|0x4ca8ff,16|13|0xffffff,16|17|0x4ca6ff,71|16|0xffffff,71|20|0x4ca2ff,74|20|0xffffff,78|20|0x4ca1ff"} } }

Page["QQ国际版"]['登录成功模块']['国际版空间'] = {页面名称="国际版空间",查询范围={256,  841,471, 1231},点击范围={},多点颜色={{0xfcfcfc, "-1|15|0x3a97fe,-9|11|0x0079ff,-14|8|0xfcfcfc,-19|12|0x0079ff,-15|18|0x0079ff,-12|0|0xfcfcfc,-22|12|0xfcfcfc,-24|13|0x95c6fd,-10|18|0x0079ff"} } }
Page["QQ国际版"]['登录成功模块']['国际版加为好友'] = {页面名称="国际版加为好友",查询范围={274,  730,447,  818},点击范围={},多点颜色={{0x0079ff, "-12|7|0xffffff,-18|9|0x0079ff,-24|3|0x0079ff,-20|1|0xffffff,-24|-2|0x0079ff,-21|-7|0xffffff,-15|-11|0x0079ff,-24|-11|0x0079ff,-20|-7|0xffffff"} } }
Page["QQ国际版"]['登录成功模块']['消息首页'] = {页面名称="消息首页",查询范围={41,1232,181,1330},点击范围={},多点颜色={{0x0079ff, "9|22|0x0079ff,9|26|0x0079ff,16|28|0xf9f9f9"} } }
Page["QQ国际版"]['登录成功模块']['联系人首页'] = {页面名称="联系人首页",查询范围={296,1224,436,1331},点击范围={},多点颜色={{0x0079ff, "-5|16|0xf9f9f9,-5|25|0x0079ff"} } }

	--QQ国际版冻结窗口
Page["QQ国际版"]['登录成功模块']["暂时无法登录密码泄露被冻结保护弹窗"] = {页面名称="暂时无法登录密码泄露被冻结保护弹窗",查询范围={64,423,677,894},点击范围={},多点颜色={{0x2b2b2b, "11|0|0x2b2b2b,53|5|0x2b2b2b,57|11|0x2b2b2b,-42|70|0x000000,-43|87|0x000000,-64|110|0x000000,-62|117|0x000000,-154|285|0x2b2b2b,96|285|0x2b2b2b"} } }
Page["QQ国际版"]['登录成功模块']["下线通知涉嫌传播违法违规信息被冻结弹窗"] = {页面名称="下线通知涉嫌传播违法违规信息被冻结弹窗",查询范围={113,497,633,843},点击范围={},多点颜色={{0x0079ff, "11|3|0x0079ff,18|3|0x0079ff,29|3|0x0079ff,24|16|0x298cf9,-19|-46|0x000000,47|-41|0x000000,-152|-10|0x000000,-147|-6|0x000000,-61|127|0x2b2b2b"} } }
Page["QQ国际版"]['登录成功模块']["下线通知涉嫌传播色情被冻结弹窗"] = {页面名称="下线通知涉嫌传播色情被冻结弹窗",查询范围={84,506,654,836},点击范围={},多点颜色={{0x2b2b2b, "1|10|0x2b2b2b,26|72|0x000000,26|78|0x000000,74|82|0x000000,84|82|0x000000,121|82|0x131414,255|115|0x0079ff,265|115|0x0079ff,46|247|0x2b2b2b"} } }
Page["QQ国际版"]['登录成功模块']["身份验证失败请您重新登录弹窗"] = {页面名称="身份验证失败请您重新登录弹窗",查询范围={84,506,654,836},点击范围={},多点颜色={{0x000000, "16|18|0x000000,50|14|0x000000,69|15|0x000000,148|9|0x0e0e0e,398|-4|0x080808,407|2|0x000000,197|98|0x2b2b2b,213|99|0x2b2b2b,237|100|0x2b2b2b"} } }
Page["QQ国际版"]['登录成功模块']["下线通知被暂时冻结弹窗"] = {页面名称="下线通知被暂时冻结弹窗",查询范围={270,578,619,864},点击范围={},多点颜色={{0x0079ff, "11|0|0x0079ff,-154|26|0x037aff,-166|39|0x0079ff,-150|-5|0x000000,-153|6|0x000000,-181|4|0x000000,-175|5|0x000000,-159|125|0x2b2b2b,-110|127|0x2b2b2b"} } }
Page["QQ国际版"]['登录成功模块']["下线通知被暂时冻结弹窗确定按钮"] = {点击范围={345,765,399,791} }
-------------------以下是 815 设备锁关闭界面识别

Page["815设备锁"]={}
Page["815设备锁"]["左上角小头像进入设置界面"] = {页面名称="左上角小头像进入设置界面",查询范围={},点击范围={63,   79,63,   79},多点颜色={}}
Page["815设备锁"]["左上角返回键"] = {页面名称="左上角返回键",查询范围={},点击范围={63,   79,63,   79},多点颜色={}}

Page["815设备锁"]["左下角设置按钮"] = {页面名称="左下角设置按钮",查询范围={ 0, 1196, 120, 1313},点击范围={  69, 1237,  69, 1237},多点颜色={{0x989eb4, "0|-10|0x989eb4,-1|-19|0xfcfcfd,9|-6|0x989eb4,-16|-11|0xa5aabe,11|-4|0x989eb4"}}}
Page["815设备锁"]["账号安全"] = {页面名称="账号安全",查询范围={14, 409, 259, 486},点击范围={92,  448,92,  448},多点颜色={{0xffffff, "27|34|0xdadbde,39|35|0x5e616d,73|37|0x8e9098,99|43|0x03081a,130|49|0x7d8089,133|39|0xffffff"}}}
Page["815设备锁"]["设备锁已启用"] = {页面名称="设备锁已启用",查询范围={452, 875, 733, 971},点击范围={ 545,  917, 545,  917},多点颜色={{0xffffff, "3|3|0x18b4ed,11|-8|0x18b4ed,-1|-19|0x18b4ed,45|-2|0x9fa3ae,84|-2|0x878b99"}}}
Page["815设备锁"]["设备锁未启用"] = {页面名称="设备锁未启用",查询范围={452, 875, 733, 971},点击范围={ 545,  917, 545,  917},多点颜色={{0xffffff, "2|-6|0xa6a6a6,3|4|0xffffff,57|0|0x878b99,82|3|0x878b99,114|1|0xe6e7ea,112|5|0x878b99"}}}

Page["815设备锁"]["登录保护"] = {页面名称="登录保护",查询范围={17, 183, 198, 261},点击范围={},多点颜色={{0xffffff, "7|11|0xa9abb1,17|18|0xffffff,40|16|0x03081a,81|8|0xb3b4ba,110|10|0xbdbfc3"}}}
Page["815设备锁"]["设备锁开关"] = {页面名称="设备锁开关",点击范围={ 647,  229,  647,  229},查询范围={},多点颜色={{}}}
Page["815设备锁"]["设备锁关闭失败"] = {页面名称="设备锁关闭失败",点击范围={566, 183, 735, 268},查询范围={566, 183, 735, 268},多点颜色={{0x00cafc, "0|19|0x01cafc,33|13|0xffffff,18|-5|0x05cafb,3|27|0x02cafc"}}}
Page["815设备锁"]["设备锁关闭成功"] = {页面名称="设备锁关闭成功",点击范围={},查询范围={602, 186, 727, 266},多点颜色={{0xffffff, "-1|9|0xffffff,0|21|0xf9f9fc,16|21|0xebedf5,19|3|0xebedf5,19|-3|0xebedf5,17|-8|0xebedf5,15|27|0xebedf5"}}}
Page["815设备锁"]["关闭登录保护关闭按钮"] = {页面名称="关闭登录保护关闭按钮",点击范围={  214,  793,   214,  793},查询范围={150, 761, 290, 840},多点颜色={{0xffffff, "-3|16|0x000000,8|29|0xffffff,34|15|0x464646,44|17|0xffffff,36|3|0x4e4e4e,39|-6|0xffffff"}}}



Page["815设备锁"]["允许电脑手机同时在线"] = {页面名称="允许电脑手机同时在线",查询范围={18, 1027, 729, 1122},点击范围={63,   79,63,   79},多点颜色={{0x03081a, "41|-1|0xffffff,103|9|0xffffff,169|8|0x03081a,194|5|0xffffff,242|5|0x484c59,282|8|0xffffff,291|-3|0x03081a,562|-2|0x00cafc,-54|-47|0xffffff"}}}

--------------以下是QQ国际版部分-----------------------------
Page["QQ标准版"] = {}
Page["QQ标准版"]['回复模块'] = {}

Page["QQ标准版"]['回复模块']['用户对话界面输入框下面的笑脸按钮'] = {页面名称="用户对话界面输入框下面的笑脸按钮",查询范围={189,  646,263, 1318},点击范围={},多点颜色={{0xeff2fd, "13|-13|0xeff2fc,-13|-16|0x989eb4,12|-5|0x989eb4,6|5|0xeff2fd,-14|5|0xeff2fd,-20|2|0x989eb4,10|-13|0xeff2fc,16|-20|0x989eb4,4|-17|0x989eb4"} } }
Page["QQ标准版"]['回复模块']['下线通知重新登录弹出页'] = {页面名称="下线通知重新登录弹出页",查询范围={449,  828,595,  877},点击范围={},多点颜色={{0x000000, "1|6|0xffffff,7|8|0xffffff,-5|15|0xffffff,4|14|0xffffff,14|19|0xffffff,11|7|0x000000,18|2|0x000000,18|13|0x000000,19|27|0x000000"} } }
Page["QQ标准版"]['回复模块']['输入框已启用'] = {页面名称="输入框已启用",查询范围={197,  730,269,  817},点击范围={},多点颜色={{0xeff2fd, "13|-13|0xeff2fc,-13|-16|0x989eb4,12|-5|0x989eb4,6|5|0xeff2fd,-14|5|0xeff2fd,-20|2|0x989eb4,10|-13|0xeff2fc,16|-20|0x989eb4,4|-17|0x989eb4"} } }
Page["QQ标准版"]['回复模块']['佩奇代码非好友聊天界面'] = {页面名称="佩奇代码非好友聊天界面",查询范围={377,  129,702,  207},点击范围={},多点颜色={{0x202121, "14|0|0x171818,19|-3|0xe6e9f3,10|-3|0xe6e9f3,20|4|0xe6e9f3,34|-11|0xd5d8e1,40|-9|0x262626,38|-3|0xe6e9f3,50|9|0x262626,52|1|0xe6e9f3"} } }
Page["QQ标准版"]['回复模块']['佩奇代码非好友聊天界面一'] = {页面名称="佩奇代码非好友聊天界面一",查询范围={463,  130,568,  205},点击范围={},多点颜色={{0x171818, "6|-4|0xe6e9f3,-3|-4|0xe6e9f3,2|5|0xe6e9f3,-2|1|0x171818,0|-4|0x171818,18|-8|0x262626,24|-8|0x262626,22|2|0xe6e9f3,25|10|0x262626"} } }
Page["QQ标准版"]['回复模块']['佩奇代码非好友聊天界面二'] = {页面名称="佩奇代码非好友聊天界面二",查询范围={86,  130,149,  198},点击范围={},多点颜色={{0x333435, "-5|5|0x363739,-13|16|0x252627,5|-5|0x202122,-6|-1|0xe6e9f3,-1|10|0xe6e9f3,-10|3|0xe6e9f3,6|4|0xe6e9f3,-3|12|0xe6e9f3,1|-10|0x1b1c1c"} } }
Page["QQ标准版"]['回复模块']['好友通用标识符'] = {页面名称="好友通用标识符",查询范围={585,   53,728,  118},点击范围={},多点颜色={{0x171718, "-1|-11|0x000000,0|-26|0x2b2c2e,-2|-18|0xf0f2fe,-6|-7|0xf0f2fe,-59|0|0x000000,-71|-5|0x000000,-80|-23|0x000000,-71|-15|0xf4f2fb,-12|-20|0xf1f3fd"} } }
Page["QQ标准版"]['回复模块']['好友通用标识符一'] = {页面名称="好友通用标识符一",查询范围={589,   57,659,  105},点击范围={},多点颜色={{0x000000, "-14|-6|0x000000,-22|-17|0x000000,-22|-21|0x000000,-13|-18|0xc0e1f9,-20|-2|0xbbe2fc,-8|-10|0xc0e0f8,-2|-4|0x000000,-19|-7|0x07090a,-22|-7|0xbbe2fd"} } }
Page["QQ标准版"]['回复模块']['话术输入为空'] = {页面名称="话术输入为空",查询范围={31,  649,153,  795},点击范围={},多点颜色={{0xeff2fc, "-6|8|0x989eb4,10|14|0x989eb4,0|33|0x989eb4,-13|25|0x989eb4,-19|14|0x989eb4,5|-72|0xffffff,32|-64|0xffffff,20|-64|0xffffff,71|-61|0xffffff"} } }
Page["QQ标准版"]['回复模块']['佩奇验证照片页面'] = {页面名称="佩奇验证照片页面",查询范围={329,   61,415,  110},点击范围={},多点颜色={{0xffffff, "3|8|0xeff7ff,5|13|0x4ca6ff,5|1|0x4ca8ff,8|9|0xffffff,6|26|0x4ca4ff,14|23|0x4ca4ff,21|24|0x4ca3ff,6|8|0xeff7ff,18|13|0x4ca5ff"} } }
Page["QQ标准版"]['回复模块']['备注识别为空'] = {页面名称="备注识别为空",查询范围={131,  290,182,  338},点击范围={},多点颜色={{0xfcfcfc, "-7|-9|0xfcfcfc,-3|-3|0xfcfcfc,-1|-14|0xfcfcfc,-4|-2|0xfcfcfc,4|3|0xfcfcfc,4|-5|0xfcfcfc,-7|-11|0xfcfcfc,-4|-7|0xfcfcfc,-5|4|0xfcfcfc"} } }

Page["QQ标准版"]['回复模块']['禁止登陆'] = {页面名称="禁止登陆",查询范围={292,  530,391,  588},点击范围={},多点颜色={{0x363636, "0|8|0x4b4b4b,4|23|0xffffff,12|24|0xffffff,20|25|0x000000,21|21|0xffffff,16|18|0x000000,-5|22|0xffffff,-2|24|0x0f0f0f,10|2|0x0a0a0a"} } }


--------发送图片
Page["QQ标准版"]['回复模块']['激活图片'] = {页面名称="激活图片",查询范围={537, 1244,742, 1333},点击范围={},多点颜色={{0xb2effe, "-8|0|0xb2effe,-15|6|0xb2effe,5|-2|0xffffff,10|-2|0xb2effe,8|-11|0xb2effe,20|3|0xb2effe,25|-5|0xb2effe,42|-3|0xb2effe,1|11|0xffffff"} } }
Page["QQ标准版"]['回复模块']['已激活图片确定'] = {页面名称="已激活图片确定",查询范围={537, 1244,742, 1333},点击范围={},多点颜色={{0xffffff, "15|4|0xb7f0fe,-9|5|0x00cafc,-26|8|0x00cafc,4|5|0x00cafc,36|4|0x00cafc,47|4|0xbaf1fe,25|-4|0x00cafc,9|8|0x94e9fe,7|16|0x00cafc"} } }


--------发送图片
Page["QQ标准版"]['回复模块']['登录输入账号密码界面无输入法时企鹅位置'] = {页面名称="登录输入账号密码界面无输入法时企鹅位置",查询范围={259,  116,371,  378},点击范围={},多点颜色={{0xea1c27, "8|-17|0xf9ae08,3|-32|0x060606,0|-34|0xffffff,20|-3|0xea1c27,45|8|0x000000,34|44|0xf9ae08,-11|41|0x845c04,-24|14|0x000000,13|18|0xffffff"} } }
Page["QQ标准版"]['回复模块']['登录输入账号密码界面启用输入法时企鹅位置'] = {页面名称="登录输入账号密码界面启用输入法时企鹅位置",查询范围={259,  116,371,  378},点击范围={},多点颜色={{0xea1c27, "2|13|0xea1c27,21|-16|0xf9ae08,24|-28|0xffffff,25|-32|0xffffff,-4|44|0xf9ae08,39|46|0xf9ae08,52|18|0x000000,-17|18|0x000000,0|18|0xea1c27"} } }

Page["QQ标准版"]['回复模块']['登录输入账号密码界面启用输入法时有密码'] = {页面名称="登录输入账号密码界面启用输入法时有密码",查询范围={201,  120,547,  534},点击范围={},多点颜色={{0x000000, "30|5|0x000000,57|5|0x000000,88|0|0x000000,118|1|0x000000,73|-238|0xf9ae08,31|-246|0x000000,36|-271|0xea1c27,52|-299|0xf9ae08,80|-286|0xea1c27"} } }
Page["QQ标准版"]['回复模块']['登录输入账号密码界面无输入法时有密码'] = {页面名称="登录输入账号密码界面无输入法时有密码",查询范围={259,  116,371,  378},点击范围={},多点颜色={{0xea1c27, "2|13|0xea1c27,21|-16|0xf9ae08,24|-28|0xffffff,25|-32|0xffffff,-4|44|0xf9ae08,39|46|0xf9ae08,52|18|0x000000,-17|18|0x000000,0|18|0xea1c27"} } }



---------------以下是QQ国际版部分-----------------------------
Page["QQ国际版"] = {}
Page["QQ国际版"]['登录模块'] = {}
Page["QQ国际版"]['登录成功模块'] = {}


Page["QQ国际版"]['登录模块']['启动宣传页1'] = {页面名称="启动宣传页1",查询范围={95,109,547,620},点击范围={},多点颜色={{0xfcbb4c, "53|-26|0xca9947,93|-4|0x7d6b4f,58|168|0xffffff,96|165|0xca9947"} } }
Page["QQ国际版"]['登录模块']['启动宣传页2'] = {页面名称="启动宣传页2",查询范围={41,206,547,475},点击范围={},多点颜色={{0x67cdb6, "6|-51|0xfe9651,170|17|0x67cdb6,163|-11|0xfe9651,263|33|0xfe9651,294|23|0x59bbc1"} } }
Page["QQ国际版"]['登录模块']['启动宣传页2进入QQ按钮'] = {点击范围={305,1168,436,1197} }
Page["QQ国际版"]['登录模块']['启动输入账号密码界面'] = {页面名称="启动输入账号密码界面",查询范围={156,87,541,379},点击范围={},多点颜色={{0x000000, "28|45|0xf9ae08,51|80|0xe81f1f"} } }
Page["QQ国际版"]['登录模块']['启动输入账号密码界面账号输入框'] = {页面名称="启动输入账号密码界面账号输入框",查询范围={193,247,564,510},点击范围={},多点颜色={{0xc7c7cd, "0|10|0xc7c7cd,2|10|0xffffff,5|10|0xc7c7cd,26|9|0xc7c7cd,26|5|0xffffff,53|3|0xc7c7cd,53|-1|0xffffff,53|-5|0xc7c7cd"} } }
Page["QQ国际版"]['登录模块']['启动输入账号密码界面密码输入框'] = {页面名称="启动输入账号密码界面密码输入框",查询范围={193,247,564,510},点击范围={},多点颜色={{0xc7c7cd, "3|20|0xc7c7cd,7|20|0xffffff,13|20|0xc7c7cd,18|20|0xffffff,21|24|0xc7c7cd,55|21|0xffffff,55|18|0xc7c7cd,55|14|0xffffff,55|11|0xc7c7cd"} } }
Page["QQ国际版"]['登录模块']['启动输入账号密码界面登录按钮'] = {点击范围={346,551,403,579} }
Page["QQ国际版"]['登录模块']['隐私政策变更协议界面'] = {页面名称="隐私政策变更协议界面",查询范围={81, 1074,351, 1155},点击范围={},多点颜色={{0xffffff, "1|-9|0x3399ff,-6|-6|0x3399ff,4|-3|0x3399ff,6|6|0xffffff,-16|5|0x3399ff,-10|4|0xffffff,-9|-4|0xacd5ff,-18|-8|0xffffff,-14|-8|0x3399ff"} } }
Page["QQ国际版"]['登录模块']['隐私政策变更协议界面我同意上述变更勾选框'] = {点击范围={39,961,51,978} }
Page["QQ国际版"]['登录模块']['隐私政策变更协议界面蓝色继续按钮'] = {页面名称="隐私政策变更协议界面蓝色继续按钮",查询范围={438,1047,689,1173},点击范围={486,1094,573,1132},多点颜色={{0x3399ff, "0|-3|0xffffff"} } }
Page["QQ国际版"]['登录模块']['字母验证码标题界面'] = {页面名称="字母验证码标题界面",查询范围={230,39,514,138},点击范围={},多点颜色={{0xffffff, "0|3|0x005eb3,0|15|0xffffff,0|18|0x005bb3,41|19|0xffffff,44|19|0x0058b3,51|28|0xffffff,92|0|0xffffff,92|4|0x0056b3"} } }
Page["QQ国际版"]['登录模块']['字母验证码标题界面验证码输入框'] = {点击范围={38,353,112,373} }
Page["QQ国际版"]['登录模块']['字母验证码标题界面验证码输入框删除按钮'] = {点击范围={687,360,698,370} }
Page["QQ国际版"]['登录模块']['字母验证码标题界面右上角完成按钮'] = {点击范围={648,74,704,96} }
	--原有记录基础上重登国际版
Page["QQ国际版"]['登录模块']['安全提示重新输入密码登录弹窗'] = {页面名称="安全提示重新输入密码登录弹窗",查询范围={223,594,470,801},点击范围={},多点颜色={{0x000000, "-3|0|0xdadddf,7|7|0x000000,2|20|0x000000,50|-4|0x161616,49|9|0x020202,70|98|0x2b2b2b,69|114|0x2b2b2b"} } }
Page["QQ国际版"]['登录模块']['安全提示重新输入密码登录弹窗确定按钮'] = {点击范围={347,729,397,750} }
Page["QQ国际版"]['登录模块']['输入账号密码界面已输入账号界面'] = {页面名称="输入账号密码界面已输入账号界面",查询范围={197,304,542,402},点击范围={},多点颜色={{0x333333, ""} } }

Page["QQ国际版"]['登录模块']['登录页面无密码'] = {页面名称="登录页面无密码",查询范围={241,  415,550,  599},点击范围={},多点颜色={{0xffffff, "22|6|0xc7c7cd,37|131|0x4190fc,39|-1|0xf3f3f5,30|10|0xffffff,53|9|0xffffff,32|83|0x4190fc,29|118|0xbdd8fe,37|124|0x4190fc,45|124|0xf1f7ff"} } }
Page["QQ国际版"]['登录模块']['登录页面有账号密码'] = {页面名称="登录页面有账号密码",查询范围={241,  415,550,  599},点击范围={},多点颜色={{0x333333, "21|-2|0x333333,49|2|0x333333,65|-3|0x333333,91|-3|0x333333,27|98|0x4190fc,124|97|0x4190fc,103|124|0xffffff,103|116|0xffffff,103|104|0x9dc6fe"} } }

Page["QQ国际版"]['登录模块']['下线通知重新登录弹出页'] = {页面名称="下线通知重新登录弹出页",查询范围={159,  788,363,  865},点击范围={},多点颜色={{0x2c2c2c, "-2|11|0xdee1e6,-1|17|0x2f2f2f,-1|23|0xbabcc0,16|19|0xdbdee3,21|20|0x4b4c4d,27|22|0x3c3c3d,26|5|0xe0e4e8,20|7|0xdfe3e8,26|-3|0xe3e7eb"} } }
--Page["QQ国际版"]['登录模块']['下线通知重新登录弹出页重登按钮'] = {点击范围={648,74,704,96} }

Page["QQ国际版"]['登录模块']['设备锁标题界面'] = {页面名称="设备锁标题界面",查询范围={264,43,477,143},点击范围={},多点颜色={{0xffffff, "0|3|0x4ca9ff,-3|9|0xffffff,-3|14|0x4ca8ff,16|13|0xffffff,16|17|0x4ca6ff,71|16|0xffffff,71|20|0x4ca2ff,74|20|0xffffff,78|20|0x4ca1ff"} } }

Page["QQ国际版"]['登录模块']['账号密码蓝色登录按钮界面'] = {页面名称="账号密码蓝色登录按钮界面",查询范围={264,43,636,696},点击范围={},多点颜色={{0xffffff, "2|2|0x4190fc,10|8|0xffffff,10|13|0xffffff,10|16|0x4190fc,10|19|0xffffff,43|15|0xffffff,47|15|0x4190fc,47|11|0xffffff,55|8|0x4190fc"},{0xffffff, "0|3|0x4ca9ff,-3|9|0xffffff,-3|14|0x4ca8ff,16|13|0xffffff,16|17|0x4ca6ff,71|16|0xffffff,71|20|0x4ca2ff,74|20|0xffffff,78|20|0x4ca1ff"} } }

Page["QQ国际版"]['登录模块']['登录失败账号密码错误'] = {页面名称="登录失败账号密码错误",查询范围={295,  603,409,  670},点击范围={},多点颜色={{0x898b8c, "4|3|0xdadddf,11|-1|0xdadddf,4|-18|0xdadddf,15|-20|0xdadddf,-9|-9|0x353636,1|-12|0xdadddf,4|-7|0x000000,-2|-1|0xdadddf,-2|-16|0x000000"} } }
---------佩奇大神内置页面--------
Page["QQ国际版"]['登录模块']['注册登录页面有账号空密码状态页'] = {页面名称="注册登录页面有账号空密码状态页",查询范围={223,  398,525, 1258},点击范围={},多点颜色={{0xffffff, "15|661|0x007aff,18|661|0xe6e6e6,24|12|0x4190fc,15|-4|0xfafcff,22|670|0xe6e6e6,35|659|0xe6e6e6,15|-121|0xc7c7cd,18|-117|0xebebee,-6|-124|0xc7c7cd"} } }
Page["QQ国际版"]['登录模块']['底部更多页面'] = {页面名称="底部更多页面",查询范围={573, 1236,700, 1329},点击范围={},多点颜色={{0x0079ff, "19|0|0x0079ff,34|0|0x0079ff,26|-2|0xf9f9f9,9|-1|0xf9f9f9,15|14|0xf9f9f9,4|33|0xf9f9f9,22|42|0xf9f9f9,23|35|0x298efe,17|43|0xf9f9f9"} } }
Page["QQ国际版"]['登录模块']['有账号密码登录页面'] = {页面名称="有账号密码登录页面",查询范围={201,  412,709,  606},点击范围={},多点颜色={{0x4190fc, "18|-9|0x4190fc,38|-13|0x4190fc,14|-113|0x333333,33|-114|0x333333,58|-116|0x333333,79|-115|0x333333,96|-111|0x333333,120|-114|0x333333,149|-113|0x333333"} } }




---------佩奇大神内置页面--------
	--QQ国际版登录成功部分
Page["QQ国际版"]['登录成功模块']['底部消息按钮'] = {点击范围={108,1261,140,1283} }
Page["QQ国际版"]['登录成功模块']['底部联系人按钮'] = {点击范围={366,1259,390,1293} }
Page["QQ国际版"]['登录成功模块']['底部更多按钮'] = {点击范围={605,1271,649,1306} }
Page["QQ国际版"]['登录成功模块']['消息首页'] = {页面名称="消息首页",查询范围={24, 1235,486, 1332},点击范围={},多点颜色={{0x1382ff, "-3|-22|0x0079ff,-9|-25|0x0079ff,-8|-37|0x0079ff,-8|-46|0x0079ff,15|-4|0x228bfe,16|1|0xd2e5fa,230|-2|0x7a7a7a,261|-21|0xf9f9f9,260|-55|0xb8b8b8"} } }
Page["QQ国际版"]['登录成功模块']['三无号登录验证'] = {页面名称="三无号登录验证",查询范围={140,  667,687,  835},点击范围={},多点颜色={{0x00cafc, "-15|-4|0x00cafc,-56|-1|0x00cafc,-87|23|0xffffff,-126|10|0x00cafc,-126|-5|0x00cafc,-51|-53|0xf5f6fa,-76|-58|0xf5f6fa,-165|-58|0xf5f6fa,-190|-58|0xf5f6fa"} } }



Page["QQ国际版"]['登录成功模块']['联系人首页'] = {页面名称="联系人首页",查询范围={301,1240,424,1333},点击范围={},多点颜色={{0x0079ff, "0|9|0x0079ff,0|20|0x0079ff,0|31|0x0079ff,0|36|0x0079ff,0|37|0x0079ff,-3|46|0x0079ff,-3|43|0xf9f9f9,-1|57|0xf9f9f9,0|57|0x0079ff"} } }
Page["QQ国际版"]['登录成功模块']['联系人首页右上角＋号按钮'] = {点击范围={680,71,706,105} }

Page["QQ国际版"]['登录成功模块']['视频对话弹窗'] = {页面名称="视频对话弹窗",查询范围={18,1019,746,1332},点击范围={},多点颜色={{0xffffff, "12|-4|0xffffff,45|-2|0xffffff,46|7|0xffffff,183|122|0x000000,187|127|0x000000,187|134|0x000000,421|-3|0xffffff,421|4|0xffffff,457|14|0xffffff"} } }
Page["QQ国际版"]['登录成功模块']['视频对话弹窗拒绝按钮'] = {点击范围={107,1097,257,1154} }



--联系人栏目添加标题界面，识别的是当前页绿色的添加好友文字
Page["QQ国际版"]['登录成功模块']['联系人栏目添加标题界面'] = {页面名称="联系人栏目添加标题界面",查询范围={2,248,414,642},点击范围={},多点颜色={{0x1fc984, "17|0|0xffffff,34|0|0x1fc984,101|13|0x000000,104|12|0xfcfcfc,135|12|0x000000,139|12|0xfcfcfc,200|8|0x000000,200|11|0xfcfcfc"} } }
Page["QQ国际版"]['登录成功模块']['联系人栏目添加标题界面添加好友文字按钮'] = {点击范围={37,376,248,426} }
Page["QQ国际版"]['登录成功模块']['联系人栏目添加好友标题有搜索框的界面'] = {页面名称="联系人栏目添加好友标题有搜索框的界面",查询范围={76,35,552,226},点击范围={},多点颜色={{0xffffff, "0|5|0x4cabff,0|10|0xffffff,121|4|0xffffff,121|7|0x4ca1ff,123|11|0xffffff,-138|85|0x878787,-138|88|0xf5f5fa,34|100|0x808080,37|100|0xf5f5fa"} } }
Page["QQ国际版"]['登录成功模块']['联系人栏目添加好友标题有搜索框的界面搜索框区域'] = {点击范围={39,232,151,256} }
Page["QQ国际版"]['登录成功模块']['联系人栏目添加好友标题有搜索框的界面搜索框删除按钮'] = {点击范围={661,242,671,252} }
Page["QQ国际版"]['登录成功模块']['联系人栏目没有符合搜索条件的用户文字'] = {页面名称="联系人栏目没有符合搜索条件的用户文字",查询范围={374,40,591,366},点击范围={},多点颜色={{0x919192, "0|3|0xf5f5fa,0|6|0x848484,0|9|0xf5f5fa,15|9|0x808080,32|9|0x828282,32|6|0xf5f5fa,32|9|0x828282,-50|-223|0x4ca0ff,-50|-217|0xffffff"} } }
Page["QQ国际版"]['登录成功模块']['好友资料界面底部加好友按钮'] = {页面名称="好友资料界面底部加好友按钮",查询范围={220,1225,616,1329},点击范围={291,1269,458,1298},多点颜色={{0x007aff, "0|4|0xf7f7f9,-17|21|0x0079ff,-17|16|0xf7f7f9,89|-6|0x007aff,89|-2|0xf7f7f8,114|-2|0x007aff,113|1|0xf7f7f8,126|5|0x007aff"} } }
Page["QQ国际版"]['登录成功模块']['好友资料界面底部发消息按钮'] = {页面名称="好友资料界面底部发消息按钮",查询范围={426,1242,684,1326},点击范围={483,1271,625,1299},多点颜色={{0x0079ff, "0|4|0xf6f6f8,-22|38|0x0079ff,-15|38|0xf7f7f9,78|15|0x007aff,78|17|0xf7f7f9,78|21|0x007aff,104|30|0x007aff,107|30|0xf7f7f9,110|34|0x007aff"} } }
Page["QQ国际版"]['登录成功模块']['添加失败对方拒绝任何人添加其为好友弹窗'] = {页面名称="添加失败对方拒绝任何人添加其为好友弹窗",查询范围={149,548,607,851},点击范围={},多点颜色={{0x111111, "-3|4|0x000000,3|8|0x121313,284|5|0x000000,299|11|0x000000,121|102|0x2b2b2b,120|118|0x2b2b2b,125|118|0x2b2b2b,130|118|0x2b2b2b,167|118|0x2b2b2b"} } }
Page["QQ国际版"]['登录成功模块']['添加失败对方拒绝任何人添加其为好友弹窗确定按钮'] = {点击范围={344,725,408,751} }
Page["QQ国际版"]['登录成功模块']['添加好友验证信息标题填写验证信息界面'] = {页面名称="添加好友验证信息标题填写验证信息界面",查询范围={156,37,478,216},点击范围={},多点颜色={{0xffffff, "19|6|0x4ca9ff,19|9|0xffffff,48|16|0xffffff,52|16|0x4ca5ff,-64|84|0x808080,-64|87|0xf5f5fa,-64|91|0x808080,1|101|0x808080,5|101|0xf5f5fa"} } }
Page["QQ国际版"]['登录成功模块']['添加好友验证信息标题填写验证信息灰色下一步按钮界面'] = {页面名称="添加好友验证信息标题填写验证信息灰色下一步按钮界面",查询范围={258,47,746,137},点击范围={},多点颜色={{0xffffff, "19|9|0xffffff,17|27|0xffffff,17|31|0x4ca6ff,52|31|0x4ca3ff,52|28|0xffffff,335|1|0x94c1ff,335|5|0x4c98ff,342|5|0x94c1ff,347|5|0x4c98ff"} } }
Page["QQ国际版"]['登录成功模块']['添加好友验证信息标题填写问题答案界面'] = {页面名称="添加好友验证信息标题填写问题答案界面",查询范围={3,16,453,328},点击范围={},多点颜色={{0xffffff, "49|0|0xffffff,49|4|0x4ca7ff,105|84|0x808080,111|96|0x808080,100|92|0x808080,100|97|0xf5f5fa,-255|149|0x000000,-255|153|0xfcfcfc,-257|161|0x000000"},{0xffffff, "20|5|0x4ca9ff,20|9|0xffffff,40|14|0xffffff,43|14|0x4ca6ff,-272|177|0x000000,-269|177|0xfcfcfc,-265|180|0x000000,-221|178|0x000000,-219|178|0xfcfcfc"} } }
Page["QQ国际版"]['登录成功模块']['添加好友验证信息标题界面验证信息输入框区域'] = {点击范围={487,363,659,459} }
Page["QQ国际版"]['登录成功模块']['添加好友验证信息标题界面右上角下一步按钮'] = {点击范围={638,72,720,92} }
--联系人栏目添加好友标题备注发送界面，识别的是顶部：添加好友+发送几个文字
Page["QQ国际版"]['登录成功模块']['联系人栏目添加好友标题备注发送界面'] = {页面名称="联系人栏目添加好友标题备注发送界面",查询范围={248,41,740,122},点击范围={},多点颜色={{0xffffff, "0|3|0x4caaff,14|6|0xffffff,14|4|0x4ca9ff,48|4|0xffffff,48|0|0x4ca7ff,354|7|0xffffff,353|3|0x4c98ff,372|8|0x4c98ff,371|10|0xffffff"} } }
Page["QQ国际版"]['登录成功模块']['联系人栏目添加好友标题备注发送界面备注文字'] = {页面名称="联系人栏目添加好友标题备注发送界面备注文字",查询范围={4,300,150,374},点击范围={},多点颜色={{0x808080, "6|0|0x808080,5|15|0x808080,8|15|0xfcfcfc,8|17|0x808080,58|18|0x808080,67|18|0xfcfcfc,67|12|0x808080,67|8|0xfcfcfc,71|8|0x808080"} } }
Page["QQ国际版"]['登录成功模块']['联系人栏目添加好友标题备注发送界面备注输入框区域'] = {点击范围={156,321,181,343} }
Page["QQ国际版"]['登录成功模块']['联系人栏目添加好友标题备注发送界面备注输入框区域删除按钮'] = {点击范围={696,326,706,336} }
Page["QQ国际版"]['登录成功模块']['联系人栏目添加好友标题备注发送界面右上角发送按钮'] = {点击范围={656,74,710,93} }
Page["QQ国际版"]['登录成功模块']['添加好友通用左上角返回文字按钮'] = {点击范围={47,71,99,95} }

	--QQ国际版对话界面
Page["QQ国际版"]['登录成功模块']['用户对话界面'] = {页面名称="用户对话界面",查询范围={639,37,749,350},点击范围={},多点颜色={{0x4c98ff, "4|0|0x4c98ff,14|18|0xe9f2ff,14|27|0x4c98ff,14|31|0xffffff,19|31|0xffffff,23|31|0xffffff,23|52|0x4c98ff,53|52|0x4c98ff,47|267|0xe6e6e8"} } }
Page["QQ国际版"]['登录成功模块']['用户对话界面气泡提示'] = {页面名称="用户对话界面气泡提示",查询范围={203,36,529,570},点击范围={},多点颜色={{0xcd4816, "0|6|0xe5e5e5,0|14|0xffffff,209|88|0xc9e1f9,161|144|0xcd4816,161|150|0x6a6a6a,167|-4|0x6a6a6a"},{0xffffff, "-2|3|0x4cabff,23|119|0x6a6a6a,23|141|0xcd4816,18|167|0xffffff,181|226|0xc9e1f9,112|305|0x6a6a6a,46|371|0xffffff"} } }
Page["QQ国际版"]['登录成功模块']['用户对话界面气泡提示空白区域'] = {点击范围={179,852,586,1015} }
Page["QQ国际版"]['登录成功模块']['用户对话界面加为好友按钮'] = {页面名称="用户对话界面加为好友按钮",查询范围={460,138,636,197},点击范围={},多点颜色={{0x007aff, "0|4|0xf4f4f5,4|4|0x007aff,10|4|0x007aff,15|4|0x007aff,19|4|0xf4f4f5"} } }
Page["QQ国际版"]['登录成功模块']["用户对话界面底部麦克风按钮选中和未选中状态"] = {页面名称="用户对话界面底部麦克风按钮选中和未选中状态",查询范围={7,813,79,1331},点击范围={},多点颜色={{0x797979, "-3|6|0xf3f3f3,2|6|0x797979,8|6|0xf3f3f3,14|6|0x797979,18|6|0xf3f3f3,26|6|0x797979,30|6|0xf3f3f3"},{0x797979, "2|0|0xf3f3f3,5|3|0x797979,8|3|0xf3f3f3,8|-2|0x797979,32|-2|0x797979,32|3|0xf3f3f3,32|7|0x797979,32|11|0x797979,32|15|0xf3f3f3"} } }
Page["QQ国际版"]['登录成功模块']["用户对话界面输入框下面的笑脸按钮"] = {页面名称="用户对话界面输入框下面的笑脸按钮",查询范围={586,666,682,1333},点击范围={},多点颜色={{0x797979, "8|0|0xf3f3f3,7|8|0x818181,14|10|0xf3f3f3,24|12|0x797979,24|17|0xf3f3f3,34|18|0xf3f3f3,38|18|0x797979,14|28|0x797979,14|34|0xf3f3f3"} } }
Page["QQ国际版"]['登录成功模块']["用户对话界面底部麦克风按钮选中状态"] = {页面名称="用户对话界面底部麦克风按钮选中状态",查询范围={3,1245,87,1332},点击范围={},多点颜色={{0x797979, "2|0|0xf3f3f3,5|3|0x797979,8|3|0xf3f3f3,8|-2|0x797979,32|-2|0x797979,32|3|0xf3f3f3,32|7|0x797979,32|11|0x797979,32|15|0xf3f3f3"} } }

Page["QQ国际版"]['登录成功模块']["输入框已启用"] = {页面名称="输入框已启用",查询范围={558, 1238,743, 1330},点击范围={},多点颜色={{0x007aff, "-1|-11|0x007aff,-14|-6|0x007aff,-12|9|0x007aff,-3|0|0x007aff,-12|-7|0x007aff"} } }

Page["QQ国际版"]['登录成功模块']["用户对话界面底部麦克风按钮未选中状态"] = {页面名称="用户对话界面底部麦克风按钮未选中状态",查询范围={7,813,79,1331},点击范围={},多点颜色={{0x797979, "-3|6|0xf3f3f3,2|6|0x797979,8|6|0xf3f3f3,14|6|0x797979,18|6|0xf3f3f3,26|6|0x797979,30|6|0xf3f3f3"} } }
Page["QQ国际版"]['登录成功模块']["用户对话界面底部输入框区域"] = {点击范围={137,1274,308,1301} }
Page["QQ国际版"]['登录成功模块']["用户对话界面通用左上角返回按钮"] = {点击范围={15,65,34,102} }
	--发送图片部分
Page["QQ国际版"]['登录成功模块']["用户对话界面输入框右侧的加号按钮"] = {页面名称="用户对话界面输入框右侧的加号按钮",查询范围={653,721,742,1330},点击范围={},多点颜色={{0x797979, "0|4|0xf3f3f3,12|4|0x797979,17|4|0xf3f3f3,17|0|0x797979,31|-11|0x797979,25|-11|0xf3f3f3"} } }
Page["QQ国际版"]['登录成功模块']["用户对话界面点击加号按钮后的底部弹窗"] = {页面名称="用户对话界面点击加号按钮后的底部弹窗",查询范围={34,884,196,1046},点击范围={},多点颜色={{0xf68b43, "16|6|0xffffff,16|20|0xf68b43"} } }
Page["QQ国际版"]['登录成功模块']["用户对话界面点击加号按钮后的底部弹窗照片按钮"] = {点击范围={84,926,148,996} }
Page["QQ国际版"]['登录成功模块']["用户对话界面点击加号按钮后的底部弹窗选择照片后的相机胶卷标题界面"] = {页面名称="用户对话界面点击加号按钮后的底部弹窗选择照片后的相机胶卷标题界面",查询范围={207,38,748,135},点击范围={},多点颜色={{0xffffff, "0|4|0x4cabff,0|8|0xffffff,0|12|0x4ca9ff,91|-1|0xffffff,91|2|0x4ca4ff,119|7|0xffffff,119|11|0x4ca1ff,344|1|0xffffff,344|4|0x4c98ff"} } }
Page["QQ国际版"]['登录成功模块']["用户对话界面点击加号按钮后的底部弹窗选择照片后的相机胶卷标题界面第1张图片"] = {点击范围={32,159,160,295} }
Page["QQ国际版"]['登录成功模块']["用户对话界面点击加号按钮后的底部弹窗选择照片后的相机胶卷标题界面右下角发送按钮"] = {点击范围={625,1273,720,1306} }


	
	--QQ国际版冻结窗口
Page["QQ国际版"]['登录成功模块']["暂时无法登录密码泄露被冻结保护弹窗"] = {页面名称="暂时无法登录密码泄露被冻结保护弹窗",查询范围={64,423,677,894},点击范围={},多点颜色={{0x2b2b2b, "11|0|0x2b2b2b,53|5|0x2b2b2b,57|11|0x2b2b2b,-42|70|0x000000,-43|87|0x000000,-64|110|0x000000,-62|117|0x000000,-154|285|0x2b2b2b,96|285|0x2b2b2b"} } }
Page["QQ国际版"]['登录成功模块']["下线通知涉嫌传播违法违规信息被冻结弹窗"] = {页面名称="下线通知涉嫌传播违法违规信息被冻结弹窗",查询范围={113,497,633,843},点击范围={},多点颜色={{0x0079ff, "11|3|0x0079ff,18|3|0x0079ff,29|3|0x0079ff,24|16|0x298cf9,-19|-46|0x000000,47|-41|0x000000,-152|-10|0x000000,-147|-6|0x000000,-61|127|0x2b2b2b"} } }
Page["QQ国际版"]['登录成功模块']["下线通知涉嫌传播色情被冻结弹窗"] = {页面名称="下线通知涉嫌传播色情被冻结弹窗",查询范围={84,506,654,836},点击范围={},多点颜色={{0x2b2b2b, "1|10|0x2b2b2b,26|72|0x000000,26|78|0x000000,74|82|0x000000,84|82|0x000000,121|82|0x131414,255|115|0x0079ff,265|115|0x0079ff,46|247|0x2b2b2b"} } }
Page["QQ国际版"]['登录成功模块']["身份验证失败请您重新登录弹窗"] = {页面名称="身份验证失败请您重新登录弹窗",查询范围={84,506,654,836},点击范围={},多点颜色={{0x000000, "16|18|0x000000,50|14|0x000000,69|15|0x000000,148|9|0x0e0e0e,398|-4|0x080808,407|2|0x000000,197|98|0x2b2b2b,213|99|0x2b2b2b,237|100|0x2b2b2b"} } }
Page["QQ国际版"]['登录成功模块']["下线通知被暂时冻结弹窗"] = {页面名称="下线通知被暂时冻结弹窗",查询范围={270,578,619,864},点击范围={},多点颜色={{0x0079ff, "11|0|0x0079ff,-154|26|0x037aff,-166|39|0x0079ff,-150|-5|0x000000,-153|6|0x000000,-181|4|0x000000,-175|5|0x000000,-159|125|0x2b2b2b,-110|127|0x2b2b2b"} } }
Page["QQ国际版"]['登录成功模块']["下线通知被暂时冻结弹窗确定按钮"] = {点击范围={345,765,399,791} }
Page["QQ国际版"]['登录成功模块']["帐号暂时无法登录存在被盗风险已被冻结弹窗"] = {页面名称="帐号暂时无法登录存在被盗风险已被冻结弹窗",查询范围={306,  617,457,  808},点击范围={},多点颜色={{0x2b2b2b, "4|7|0xdcdfe4,-2|7|0xdcdfe4,-2|-4|0xdfe3e8,3|-5|0xcdcfd4,31|-129|0x1a84fb,33|-135|0x0079ff,22|-141|0x5ea3f2,14|11|0xdadde2,49|4|0xdde0e5"} } }
Page["QQ国际版"]['登录成功模块']["下线通知被盗风险较高被暂时冻结弹窗"] = {页面名称="下线通知被盗风险较高被暂时冻结弹窗",查询范围={89,439,659,887},点击范围={},多点颜色={{0x0079ff, "5|7|0x0079ff,10|7|0x0079ff,23|7|0x0079ff,20|-26|0x000000,35|-26|0x000000,41|-26|0x000000,50|5|0x0079ff,56|9|0x0079ff,101|9|0x0079ff"} } }


	--QQ国际版回复推送模式
Page["QQ国际版"]['登录成功模块']["长按推送信息弹出的转发文字"] = {页面名称="长按推送信息弹出的转发文字",查询范围={154,184,619,812},点击范围={},多点颜色={{0xffffff, "-3|5|0x252628,2|8|0xeeeeee,-1|11|0x262627,16|11|0xffffff,19|8|0x252627,19|5|0xffffff,33|3|0xffffff,43|6|0x252627,43|8|0xffffff"} } }
Page["QQ国际版"]['登录成功模块']["发送到标题界面"] = {页面名称="发送到标题界面",查询范围={284,52,740,122},点击范围={},多点颜色={{0xffffff, "13|3|0x4ca7ff,13|6|0xffffff,13|9|0x4ca7ff,46|6|0xffffff,90|3|0xffffff,97|3|0xffffff,327|-6|0xffffff,327|-3|0x4c98ff,327|1|0xffffff"} } }
Page["QQ国际版"]['登录成功模块']["发送到标题界面蓝色QQ图标"] = {点击范围={595,270,655,329} }
Page["QQ国际版"]['登录成功模块']["QQ好友带取消按钮的标题界面"] = {页面名称="QQ好友带取消按钮的标题界面",查询范围={276,51,458,127},点击范围={},多点颜色={{0xffffff, "6|7|0x4ca9ff,13|14|0x4ca7ff,13|19|0xffffff,19|21|0x4ca5ff,33|21|0xffffff,32|16|0x4ca5ff,68|9|0xffffff,68|13|0x4ca3ff,73|13|0xffffff"} } }
Page["QQ国际版"]['登录成功模块']["QQ好友带取消按钮的标题界面搜索框区域"] = {点击范围={319,157,420,179} }
Page["QQ国际版"]['登录成功模块']["右上角灰色取消按钮界面"] = {页面名称="右上角灰色取消按钮界面",查询范围={557,41,744,132},点击范围={},多点颜色={{0x7f7f7f, "2|4|0x7f7f7f,5|4|0xe5e5ec,5|8|0x7f7f7f,20|2|0x7f7f7f,20|6|0xe5e5ec,48|8|0x7f7f7f,48|11|0xe5e5ec,48|14|0x7f7f7f,-32|14|0xffffff"} } }
Page["QQ国际版"]['登录成功模块']["右上角灰色取消按钮界面搜索框区域"] = {点击范围={15,65,34,102} }
Page["QQ国际版"]['登录成功模块']["右上角灰色取消按钮界面搜索框区域删除按钮"] = {点击范围={607,76,617,86} }
Page["QQ国际版"]['登录成功模块']["右上角灰色取消按钮界面搜索结果第1行"] = {点击范围={116,157,306,187} }
Page["QQ国际版"]['登录成功模块']["确定是否要转发弹窗"] = {页面名称="确定是否要转发弹窗",查询范围={408,686,618,826},点击范围={},多点颜色={{0x0079ff, "0|4|0xf4f4f5,12|6|0x0079ff,12|9|0xf4f4f5,34|11|0x0079ff,37|11|0xf4f4f5,46|19|0x0079ff,46|16|0xf4f4f5,43|-2|0x0079ff,43|2|0xf4f4f5"} } }
Page["QQ国际版"]['登录成功模块']["确定是否要转发弹窗发送按钮"] = {点击范围={483,745,538,771} }
Page["QQ国际版"]['登录成功模块']["清空账号按钮"] = {点击范围={710,  329,730,  344} }

Page["QQ"]['TIM验证']["QQ安全提示"] = {页面名称="QQ安全提示",查询范围={298,  558,344,  603},点击范围={},多点颜色={{0xcbcbcb, "-8|1|0xffffff,4|1|0xffffff,-7|10|0xffffff,5|9|0xffffff,-7|19|0x000000,7|14|0x000000,1|24|0x000000,12|28|0x2f2f2f,2|29|0xffffff"} } }

Page["QQ"]['TIM验证']["输入框清空状态"] = {页面名称="输入框清空状态",查询范围={176,  189,402,  468},点击范围={},多点颜色={{0xea1c27, "14|-25|0xf9ae08,7|-43|0x060606,21|-41|0x5a5959,22|-47|0xffffff,-37|155|0xb0b3bf,-5|34|0xf9ae08,-10|152|0xd6d7de,-18|154|0xf2f3f7,-15|165|0xb0b3bf"} } }

Page["QQ"]['TIM验证']["QQ掉登"] = {页面名称="QQ掉登",查询范围={251,  208,496,  609},点击范围={},多点颜色={{0xea1c27, "-1|12|0xea1c27,-9|41|0xf9ae08,35|45|0xfbb51e,4|-34|0x000000,19|296|0xeeeff2,30|285|0xdfe0e6,38|303|0xb0b3bf,45|302|0xf2f3f7,60|296|0xc3c5cf"} } }
Page["QQ"]['TIM验证']["QQ已有账号密码页面"] = {页面名称="QQ已有账号密码页面",查询范围={225,  199,536,  607},点击范围={},多点颜色={{0xea1c27, "6|-16|0xf9ae08,-13|-25|0x000000,23|-26|0x000000,0|-34|0x040404,-16|41|0xf9ae08,-42|296|0x000000,-26|298|0xf2f3f7,-12|300|0x000000,15|300|0x000000"} } }


--Page["QQ验证粉"] = {}
Page["QQ验证粉"]["添加好友左上角取消按钮"] = {点击范围={38,70,95,95}}


Page["QQ"]['重登录'] = {}
Page["QQ"]['重登录']["带密码登录页"] = {页面名称="带密码登录页",查询范围={ 147,  196,531,  597},点击范围={},多点颜色={{0xea1c27, "12|-28|0xf9ae08,5|-43|0x000000,-7|-35|0x000000,47|2|0x000000,35|35|0xf9ae08,-5|288|0x000000,10|291|0xf2f3f7,7|292|0xf2f3f7,21|289|0x000000"} } }
Page["QQ"]['重登录']["空密码登录页"] = {页面名称="空密码登录页",查询范围={ 207,  188,530,  622},点击范围={},多点颜色={{0xea1c27, "11|-11|0xf9ae08,32|46|0xe2a00d,-11|47|0xf9ae08,17|291|0xcdcfd8,16|306|0xb0b3bf,31|305|0xb0b3bf,46|305|0xf2f3f7,40|305|0xb3b6c1,63|300|0xc6c8d1"} } }
Page["QQ"]['重登录']["相册为空"] = {页面名称="相册为空",查询范围={ 96,   32,581,  572},点击范围={},多点颜色={{0xe7e7e7, "34|39|0xe7e7e7,70|25|0xffffff,32|103|0xe0e0e0,127|93|0xe3e3e3,118|47|0xffffff,96|-233|0x03081a,109|-235|0x03081a,112|-221|0x03081a,101|-215|0xffffff"} } }
Page["QQ"]['重登录']["佩奇代码好友聊天界面未激活输入框"] = {页面名称="佩奇代码好友聊天界面未激活输入框",查询范围={588,   43,736, 1331},点击范围={},多点颜色={{0x65a6ff, "-5|-11|0xffffff,-2|-10|0x4c98ff,-8|-17|0x4c98ff,-4|-20|0xffffff,4|-21|0x4c98ff,-79|1191|0xf3f3f3,-76|1192|0x828282,-60|1192|0x797979,-65|1211|0xf3f3f3"} } }
Page["QQ"]['重登录']["佩奇代码好友聊天界面已激活输入框"] = {页面名称="佩奇代码好友聊天界面已激活输入框",查询范围={577,104,739, 810},点击范围={},多点颜色={{0x65a6ff, "-5|-11|0xffffff,-2|-10|0x4c98ff,-8|-17|0x4c98ff,-4|-20|0xffffff,4|-21|0x4c98ff,-79|1191|0xf3f3f3,-76|1192|0x828282,-60|1192|0x797979,-65|1211|0xf3f3f3"} } }

Page["QQ"]['重登录']["佩奇代码非好友聊天界面"] = {页面名称="佩奇代码非好友聊天界面",查询范围={481,  134,594,  208},点击范围={},多点颜色={{0x007aff, "-4|6|0xf4f4f5,-14|12|0x56a5fb,-16|12|0xf4f4f5,-26|11|0xf4f4f5,-16|-1|0xf4f4f4,-19|-2|0x007aff,-25|17|0xf4f4f4,-17|20|0xf4f4f4,-7|18|0x1986fe"} } }
Page["QQ"]['重登录']["佩奇代码涉嫌发布传播账号暂时无法登录"] = {页面名称="佩奇代码涉嫌发布传播账号暂时无法登录",查询范围={334,  478,640, 1005},点击范围={},多点颜色={{0x2d2d2d, "-4|6|0x7d7f81,2|3|0x2b2b2b,16|6|0xe0e4e8,16|0|0xe2e6eb,18|12|0x2b2b2b,17|21|0x2b2b2b,15|22|0x2b2b2b,23|23|0xd6d9de,23|18|0xdcdfe4"} } }
Page["QQ"]['重登录']["佩奇代码登录身份失效"] = {页面名称="佩奇代码登录身份失效",查询范围={137,  603,289,  671},点击范围={},多点颜色={{0x282829, "6|-5|0xd8dbdd,6|7|0xd8dbdd,12|7|0xd8dbdd,8|12|0x131313,-3|12|0x0b0b0b,-6|6|0xd8dbdd,-14|3|0xd4d7d9,-9|9|0x000000,-11|-7|0xd6d9db"} } }


Page["QQ"]['重登录']["活动通用广告"] = {页面名称="活动通用广告",查询范围={184,  124,243,  119},点击范围={},多点颜色={{0xb0b3bf, "4|-6|0xd2d4dc,-5|-5|0xc3c5cf,-3|0|0xbdc0ca,12|-8|0xf5f6fa,47|-11|0xf5f6fa,339|-111|0xffffff,349|-118|0xffffff,341|-126|0xffffff,330|-121|0xffffff"} } }



Page["QQ"]['重登录']["登录有账号密码识别"] = {页面名称="登录有账号密码识别",查询范围={146,  198,517,  620},点击范围={},多点颜色={{0xea1c27, "-1|14|0xea1c27,34|45|0xf9ae08,-7|47|0xf9ae08,7|-31|0x262626,8|-13|0xf9ae08,-33|304|0x000000,-6|305|0x000000,9|305|0xf2f3f7,21|303|0x000000"} } }


Page["QQ"]['重登录']["佩奇代码输入框有话术状态"] = {页面名称="佩奇代码输入框有话术状态",查询范围={628,  632,724,  893},点击范围={},多点颜色={{0x7f8393, "5|5|0x7f8393,-8|9|0xffffff,-8|-6|0xffffff,-25|-11|0xffffff,-25|-19|0x7f8393,-20|-26|0xffffff,-11|-24|0x9598a6,6|-25|0x7f8393,-22|8|0x7f8393"} } }
Page["QQ"]['重登录']["佩奇代码输入部分点击到语音通话页"] = {页面名称="佩奇代码输入部分点击到语音通话页",查询范围={614,  675,728,  900},点击范围={},多点颜色={{0x00cafc, "16|-1|0x00cafc,-1|19|0x00cafc,6|4|0xf0f2fd,15|14|0x00cafc,-2|-4|0x00cafc,7|0|0xf0f2fc,14|6|0xeff2fc,7|11|0xf0f3fd,-3|15|0x00cafc"} } }
Page["QQ"]['重登录']["佩奇代码聊天页面"] = {页面名称="佩奇代码聊天页面",查询范围={645,   55,732,  111},点击范围={},多点颜色={{0x2b2c2e, "27|-1|0xdbdee8,11|1|0x000000,6|6|0xeff2fd,18|7|0xeff2fc,21|19|0xeef2fc,18|13|0x0e0e0f,5|14|0x000000,9|21|0xeff2fc,8|27|0x000000"} } }

Page["QQ"]['重登录']["佩奇代码未激活输入框页"] = {页面名称="佩奇代码未激活输入框页",查询范围={191, 1234,284, 1333},点击范围={},多点颜色={{0xeff2fd, "13|-14|0xeff2fc,-10|-13|0x989eb4,10|6|0xeff2fd,18|5|0x989eb4,21|10|0x989eb4,-17|-5|0x989eb4,-14|-18|0x989eb4,-2|-18|0x989eb4,12|-14|0xeff2fc"} } }
Page["QQ"]['重登录']["佩奇代码已激活输入框页"] = {页面名称="佩奇代码已激活输入框页",查询范围={187,  718,274,  827},点击范围={},多点颜色={{0xeff2fd, "13|-14|0xeff2fc,-10|-13|0x989eb4,10|6|0xeff2fd,18|5|0x989eb4,21|10|0x989eb4,-17|-5|0x989eb4,-14|-18|0x989eb4,-2|-18|0x989eb4,12|-14|0xeff2fc"} } }
Page["QQ"]['重登录']["佩奇代码已激活输入框页一"] = {页面名称="佩奇代码已激活输入框页一",查询范围={622,  718,747,  893},点击范围={},多点颜色={{0x989eb4, "-15|12|0x989eb4,-1|12|0x989eb4,-14|2|0x989eb4,-7|6|0xf0f2fd,-5|1|0xf0f2fc,1|6|0xeff2fc,-5|12|0xf0f3fd,-11|7|0xf0f2fd,-17|-4|0x989eb4"} } }
Page["QQ"]['重登录']["下线通知色情"] = {页面名称="下线通知色情",查询范围={280,  476,418,  592},点击范围={},多点颜色={{0x000000, "0|6|0x000000,0|19|0x000000,0|26|0x000000,5|17|0xffffff,8|11|0x020202,8|5|0xffffff,12|0|0x000000,-11|1|0x070707,-5|10|0xffffff"} } }


-------TIM
Page["QQ"]['TIM验证'] = {}
---空间
Page["QQ"]['添加好友']["QQ空间登录页面"] = {页面名称="QQ空间登录页面",查询范围={290,  185,454,  335},点击范围={},多点颜色={{0xffffff, "22|-12|0xffd000,13|-14|0xf1a308,1|-26|0xf1a308,-14|-28|0xf4ad06,3|-57|0xffcd00,37|-18|0xffcd00,-1|1|0xffffff,2|23|0xffcd00,-29|35|0xffcd00"} } }
Page["QQ"]['添加好友']["在QQ中打开"] = {页面名称="在QQ中打开",查询范围={290,  185,454,  335},点击范围={},多点颜色={{0x997b00, "26|-17|0x999999,4|14|0x999999,19|24|0x999999,36|9|0x997b00,-8|6|0x997b00,53|-21|0x997b00,-3|42|0x997b00,38|38|0x906005,46|49|0x997b00"} } }
Page["QQ"]['添加好友']["网页应用授权"] = {页面名称="网页应用授权",查询范围={477,  630,565,  708},点击范围={},多点颜色={{0xffc420, "12|-16|0xffffff,12|-24|0xffc028,18|-29|0xffc028,11|-35|0xfffdf9,23|-42|0xffc028,46|-33|0xffc028,36|-25|0xffc028,31|-20|0xffc028,49|-19|0x277ed4"} } }
Page["QQ"]['添加好友']["QQ空间授权登录成功"] = {页面名称="QQ空间授权登录成功",查询范围={12,  146,69,  198},点击范围={},多点颜色={{0x997b00, "2|11|0x999999,-15|11|0x997900,-11|19|0x997b00,-9|28|0x997b00,11|33|0x997b00,7|25|0x916001,7|24|0x978965,10|19|0x997b00,16|8|0x997b00"} } }
Page["QQ"]['TIM验证']["验证自增识别6"] = {页面名称="验证自增识别6",查询范围={180,  319,203,  345},点击范围={},多点颜色={{0x000000, "6|3|0xffffff,6|-6|0xffffff,5|-12|0xb0b0b0,11|-10|0x0e0e0e,10|-3|0x0e0e0e,15|-3|0xffffff,11|3|0x828282,7|3|0xffffff,1|2|0x000000"} } }
Page["QQ"]['TIM验证']["验证自增识别4"] = {页面名称="验证自增识别4",查询范围={180,  319,203,  345},点击范围={},多点颜色={{0x000000, "-4|-5|0xffffff,-1|-14|0x000000,-11|-1|0x252525,0|5|0x000000,3|-3|0xffffff,-12|-9|0xffffff,-1|1|0x000000,-2|2|0x606060,1|3|0x6c6c6c"} } }
Page["QQ"]['TIM验证']["验证自增识别2"] = {页面名称="验证自增识别2",查询范围={180,  319,203,  345},点击范围={},多点颜色={{0x191919, "8|-9|0x2e2e2e,9|-19|0xffffff,0|-17|0xdbdbdb,4|-13|0xffffff,10|-9|0x101010,2|-7|0xffffff,8|0|0xa0a0a0,12|-4|0xffffff,-2|-7|0xffffff"} } }
Page["QQ"]['添加好友']["验证自增识别8"] = {页面名称="验证自增识别8",查询范围={208,  676,237,  704},点击范围={},多点颜色={{0xa6a6a6, "-6|0|0x030303,-6|-6|0x030303,-7|-10|0x4e4e4e,-2|-14|0xffffff,5|-11|0x030303,4|-4|0x868686,8|2|0xbbbbbb,4|11|0x565656,-8|3|0x000000"} } }
Page["QQ"]['添加好友']["验证自增识别6"] = {页面名称="验证自增识别6",查询范围={208,  676,237,  704},点击范围={},多点颜色={{0x000000, "1|-9|0x6b6b6b,5|-12|0x000000,10|-14|0x828282,13|-11|0x000000,12|-4|0x0f0f0f,6|-3|0x303030,14|2|0x000000,8|8|0xffffff,2|3|0x0d0d0d"} } }
Page["QQ"]['添加好友']["验证自增识别9"] = {页面名称="验证自增识别9",查询范围={208,  676,237,  704},点击范围={},多点颜色={{0x000000, "-1|-11|0xfdfdfd,-10|-12|0xeaeaea,-14|-6|0x171717,-10|3|0x050505,-7|0|0xffffff,-1|-1|0x000000,-1|5|0x808080,-8|11|0x000000,-13|6|0xfbfbfb"} } }
Page["QQ"]['添加好友']["新用户界面"] = {页面名称="新用户界面",查询范围={497, 1175,601, 1221},点击范围={},多点颜色={{0xffffff, "-1|-4|0x0accfc,-3|-11|0x00cafc,-10|-3|0xffffff,0|12|0xffffff,-14|0|0x00cafc,12|11|0x00cafc,22|6|0x38d6fd,26|2|0xcff5fe,32|9|0xe4f9ff"} } }

---空间
Page["QQ"]['添加好友']["QQ空间一键登录按钮"] = {点击范围={317,  777,443,  821} }
Page["QQ"]['添加好友']["在QQ中打开按钮"] = {点击范围={467,  707,540,  744} }
Page["QQ"]['添加好友']["网页应用登录按钮"] = {点击范围={332,  959,407, 1003} }
--805各种弹出窗口

---TIM----Page
--Page["QQ"]['TIM验证']["TIM登录界面"] = {页面名称="TIM登录界面",查询范围={12,  146,69,  198},点击范围={},多点颜色={{0x997b00, "2|11|0x999999,-15|11|0x997900,-11|19|0x997b00,-9|28|0x997b00,11|33|0x997b00,7|25|0x916001,7|24|0x978965,10|19|0x997b00,16|8|0x997b00"} } }
Page["QQ"]['TIM验证']["TIM消息页面"] = {页面名称="TIM消息页面",查询范围={496,   28,736,  125},点击范围={},多点颜色={{0x3e58c9, "-12|30|0x0086f1,37|23|0x3448a1,144|22|0x3448a1,157|8|0x3448a1,142|11|0x3448a1,161|25|0x3448a1,151|17|0xffffff,153|6|0xffffff,164|17|0x3448a1"} } }
Page["QQ"]['TIM验证']["TIM搜索页面清空状态"] = {页面名称="TIM搜索页面清空状态",查询范围={290,   56,730,  105},点击范围={},多点颜色={{0x8e8e93, "5|-1|0xbcbdc0,3|14|0xf7f8f9,-3|10|0xdbdbde,356|-5|0xa9d4ff,358|3|0x49a5ff,360|8|0xffffff,364|15|0x79bcff,378|-3|0x8fc7ff,354|18|0x62b1ff"} } }
Page["QQ"]['TIM验证']["TIM搜索页面清空状态V2.2"] = {页面名称="TIM搜索页面清空状态V2.2",查询范围={78,   49,740,  116},点击范围={},多点颜色={{0xb2b2b2, "8|-2|0xb2b2b2,12|10|0xf7f8f9,33|10|0xf7f8f9,84|8|0xf7f8f9,412|3|0xcfcfcf,413|-10|0x7f7f7f,417|-8|0xffffff,417|0|0xffffff,-139|2|0xf7f8f9"} } }
Page["QQ"]['TIM验证']["TIM搜索页面"] = {页面名称="TIM搜索页面",查询范围={26,  281,76,  324},点击范围={},多点颜色={{0x353a41, "-4|-6|0xffffff,0|7|0x353a41,-6|7|0xffffff,1|23|0x353a41,-3|31|0xffffff,17|17|0x353a41,26|11|0xffffff,17|6|0x3f434a,14|-2|0xffffff"} } }
Page["QQ"]['TIM验证']["TIM搜索页面有搜索结果"] = {页面名称="TIM搜索页面有搜索结果",查询范围={37,  148,93,  191},点击范围={},多点颜色={{0x353a41, "-5|-7|0xffffff,3|-13|0x353a41,-3|-14|0xffffff,-4|-21|0x353a41,-9|-12|0xffffff,-14|-15|0x353a41,-18|-2|0xffffff,-9|1|0x353a41,-18|10|0xffffff"} } }
Page["QQ"]['TIM验证']["TIM搜索页面搜索失败"] = {页面名称="TIM搜索页面搜索失败",查询范围={37,  148,96,  278},点击范围={},多点颜色={{0x222224, "9|5|0x4c4c4c,16|10|0x101113,7|23|0x4c4c4c,-6|30|0x101113,4|89|0x353a41,12|84|0x353a41,16|92|0xffffff,5|99|0xffffff,18|117|0x353a41"} } }
Page["QQ"]['TIM验证']["TIM搜索页面搜索失败V2"] = {页面名称="TIM搜索页面搜索失败V2",查询范围={38,  144,93,  196},点击范围={},多点颜色={{0x383839, "1|-12|0x474747,9|-15|0x4c4c4c,4|6|0x4c4c4c,14|1|0x101113,24|8|0x101113,8|12|0x101113,-11|8|0x262728,0|-1|0x4c4c4c,5|-14|0x4c4c4c"} } }
Page["QQ"]['TIM验证']["TIM搜索页面有QQ号状态"] = {页面名称="TIM搜索页面有QQ号状态",查询范围={562,   58,727,  102},点击范围={},多点颜色={{0x8e8e93, "-2|13|0x8f8f94,-5|8|0x8e8e93,5|7|0x8e8e93,-1|6|0xf7f8f9,63|-5|0x4aa5ff,67|7|0xffffff,62|14|0x83c1ff,70|14|0x79bcff,73|-5|0x4aa5ff"} } }
Page["QQ"]['TIM验证']["TIM添加对象信息页面"] = {页面名称="TIM添加对象信息页面",查询范围={306, 1266,366, 1304},点击范围={},多点颜色={{0xffffff, "8|3|0xdaeefe,7|-4|0x0188fb,5|6|0x0188fb,18|4|0x0188fb,15|-1|0xffffff,23|-2|0xffffff,25|19|0xcbe7fe,17|18|0x0188fb,5|18|0x0188fb"} } }
Page["QQ"]['TIM验证']["TIM验证信息异常页面"] = {页面名称="TIM验证信息异常页面",查询范围={23,  242,103,  276},点击范围={},多点颜色={{0x000000, "-6|0|0x888888,-6|10|0x000000,2|6|0x000000,6|9|0xffffff,13|0|0xd4d4d4,17|-3|0x323232,17|9|0x3d3d3d,14|18|0xffffff,7|16|0x000000"} } }
Page["QQ"]['TIM验证']["TIM验证信息页面"] = {页面名称="TIM验证信息页面",查询范围={293,   63,340,  100},点击范围={},多点颜色={{0xf5f5f5, "-4|6|0x767676,-4|14|0x000000,4|17|0x000000,4|20|0x343434,4|24|0x262626,-1|26|0xf5f5f5,-1|10|0xf5f5f5,-1|5|0xf5f5f5,-5|4|0xf5f5f5"} } }
Page["QQ"]['TIM验证']["TIM添加好友发送页面"] = {页面名称="TIM添加好友发送页面",查询范围={653,   62,696,   99},点击范围={},多点颜色={{0x000000, "-2|-6|0xf5f5f5,-9|-4|0xf5f5f5,0|4|0x181818,7|8|0xf5f5f5,0|8|0x0c0c0c,14|7|0x000000,7|17|0xf5f5f5,14|13|0xf5f5f5,0|13|0xf5f5f5"} } }
Page["QQ"]['TIM验证']["TIM添加失败弹出框页面"] = {页面名称="TIM添加失败弹出框页面",查询范围={329,  711,420,  749},点击范围={},多点颜色={{0x007aff, "-3|4|0xf9f9f9,11|4|0x007aff,16|3|0xdceafa,15|10|0xf9f9f9,22|9|0xf9f9f9,26|7|0x007aff,14|25|0xf9f9f9,4|19|0xf9f9f9,1|12|0x007aff"} } }
Page["QQ"]['TIM验证']["TIM验证拒绝任何人添加"] = {页面名称="TIM验证拒绝任何人添加",查询范围={256,  536,478,  778},点击范围={},多点颜色={{0x000000, "-11|9|0xf2f2f2,15|9|0x3b3b3b,6|8|0xf9f9f9,-2|18|0xf9f9f9,31|170|0x1986fe,47|165|0x6db1fc,36|174|0xf9f9f9,36|180|0xf9f9f9,39|180|0x0079ff"} } }
Page["QQ"]['TIM验证']["TIM设置好友动态异常页面"] = {页面名称="TIM设置好友动态异常页面",查询范围={184, 1102,259, 1192},点击范围={},多点颜色={{0x007aff, "-4|-7|0xf8f8f8,-4|5|0xf8f8f8,-11|5|0x007aff,-11|15|0x85befb,1|17|0x007aff,-22|2|0x007aff,-20|-3|0xf8f8f8,-5|-35|0x5e5e5e,14|-39|0x5e5e5e"} } }
Page["QQ"]['TIM验证']["相片下载清空页"] = {页面名称="相片下载清空页",查询范围={233,   35,511,  474},点击范围={},多点颜色={{0xe7e7e7, "-23|26|0xffffff,-24|65|0xe0e0e0,40|52|0xffffff,76|54|0xe0e0e0,-52|-11|0xe7e7e7,-33|-261|0x000000,-26|-267|0xebedf5,-27|-277|0xebedf5,-23|-254|0x000000"} } }


Page["QQ"]['TIM验证']["TIM咨询通道陌生人页面"] = {页面名称="TIM咨询通道陌生人页面",查询范围={475,  143,544,  197},点击范围={},多点颜色={{0x12b7f5, "15|8|0x12b7f5,15|-5|0xcdeefe,11|4|0xcdeefe,22|4|0xcdeefe,13|12|0xcdeefe,18|12|0xcdeefe,3|0|0x12b7f5,0|18|0x12b7f5,10|24|0xcdeefe"} } }
Page["QQ"]['TIM验证']["TIM咨询通道聊天设置加为好友"] = {页面名称="TIM咨询通道聊天设置加为好友",查询范围={284,  575,344,  623},点击范围={},多点颜色={{0x0188fb, "-6|-6|0x0188fb,1|-18|0x0188fb,-7|-17|0x0188fb,5|-1|0xffffff,0|4|0x0188fb,1|9|0x73befd,-7|7|0xf9fcff,-5|0|0x8cc9fd,-2|-13|0xffffff"} } }
Page["QQ"]['TIM验证']["TIM咨询通道搜索对象详细页面"] = {页面名称="TIM咨询通道搜索对象详细页面",查询范围={499, 1260,549, 1308},点击范围={},多点颜色={{0xd8edfe, "-4|-5|0xdef0fe,-5|5|0x0188fb,9|9|0x1f96fc,1|15|0x0188fb,8|22|0x0188fb,2|-1|0xfeffff,0|8|0xffffff,9|15|0x89c8fd,9|11|0x0188fb"} } }
Page["QQ"]['TIM验证']["TIM空间没开通页面"] = {页面名称="TIM空间没开通页面",查询范围={275,  646,388,  718},点击范围={},多点颜色={{0xffffff, "-5|-3|0x1eb9f2,-11|10|0x1eb9f2,1|12|0x1eb9f2,-6|34|0x1eb9f2,-12|16|0x1eb9f2,-16|3|0xffffff,-14|-1|0xffffff,-14|-5|0xffffff,-7|12|0xffffff"} } }



Page["QQ"]['TIM验证']["TIM消息页加好友菜单页"] = {页面名称="TIM消息页加好友菜单页",查询范围={397,   47,743,  216},点击范围={},多点颜色={{0x2c3d89, "14|12|0x2c3d89,16|2|0x2c3d89,2|13|0x2c3d89,6|6|0xd9d9d9,-226|111|0x464c56,-245|114|0x464c56,-241|109|0xffffff,-240|118|0xffffff,-177|113|0x000000"} } }
Page["QQ"]['TIM验证']["TIM空间加为好友页面"] = {页面名称="TIM空间加为好友页面",查询范围={288,  863,344,  909},点击范围={},多点颜色={{0xffffff, "-8|0|0xfdfeff,-4|11|0x1eb9f2,5|8|0x1eb9f2,-3|15|0x1eb9f2,-1|22|0xffffff,-12|23|0x1eb9f2,-11|16|0x1eb9f2,-13|13|0xcceffc,-11|-2|0x1eb9f2"} } }
Page["QQ"]['TIM验证']["TIM空间加为好友页面V2.2"] = {页面名称="TIM空间加为好友页面V2.2",查询范围={284,  862,363,  913},点击范围={},多点颜色={{0xffffff, "-5|-5|0x1eb9f2,3|-7|0x1eb9f2,-5|1|0x8bdbf8,2|5|0x1eb9f2,-1|7|0xffffff,-1|-1|0xffffff,6|1|0xedf9fe,4|8|0x1eb9f2,9|8|0x1eb9f2"} } }
Page["QQ"]['TIM验证']["TIM空间加为好友页面无蓝色加好友按钮V2.2"] = {页面名称="TIM空间加为好友页面无蓝色加好友按钮V2.2",查询范围={328,  564,369,  607},点击范围={},多点颜色={{0x0a0a0a, "-5|1|0xffffff,4|1|0xffffff,0|3|0x0a0a0a,-4|10|0xbdbdbd,4|10|0xffffff,0|9|0x0a0a0a,-5|10|0x0c0c0c,-7|4|0xffffff,-4|13|0xffffff"} } }
Page["QQ"]['TIM验证']["TIM空间加为好友弹出页面V2.2"] = {页面名称="TIM空间加为好友弹出页面V2.2",查询范围={280, 1058,336, 1105},点击范围={},多点颜色={{0x007aff, "7|-5|0xf8f8f8,-5|5|0xf8f8f8,-3|-7|0xf8f8f8,3|7|0xf8f8f8,-1|0|0x007aff,9|1|0x007aff,9|12|0x007aff,7|26|0x007aff,3|20|0xf8f8f8"} } }
Page["QQ"]['TIM验证']["TIM空间设置有权限页面V2.2"] = {页面名称="TIM空间设置有权限页面V2.2",查询范围={211,  787,254,  820},点击范围={},多点颜色={{0x999999, "5|-5|0xececec,-4|-6|0xececec,2|8|0xb2b2b2,8|10|0x808080,-10|10|0x808080,-7|-11|0xececec,3|-13|0xececec,0|-12|0x808080,1|1|0x808080"} } }
Page["QQ"]['TIM验证']["TIM空间有答案V2.2"] = {页面名称="TIM空间有答案V2.2",查询范围={19, 1046,57, 1076},点击范围={},多点颜色={{0x246183, "-3|-3|0xececec,4|-2|0xececec,-3|4|0xececec,4|8|0xececec,7|8|0x246183,6|17|0x246183,2|17|0xa2b9c5,-3|16|0x8ca9ba,1|0|0x246183"} } }
Page["QQ"]['TIM验证']["TIM空间非好友无法查看页面"] = {页面名称="TIM空间非好友无法查看页面",查询范围={360,  324,710,  704},点击范围={},多点颜色={{0xa3a5b4, "-7|-2|0x2c2c46,-2|-14|0x0f0f2b,10|-3|0x14142c,0|12|0x3f3e5d,11|47|0x070824,-2|296|0xececec,-36|293|0xececec,-68|294|0xececec,-106|313|0xececec"} } }
Page["QQ"]['TIM验证']["TIM空间违规页面"] = {页面名称="TIM空间违规页面",查询范围={526,  578,586,  620},点击范围={},多点颜色={{0xc9c9c9, "-3|-4|0xececec,4|-5|0xececec,11|-5|0xececec,-4|5|0xececec,0|8|0x808080,0|11|0x808080,0|16|0x808080,3|0|0xc9c9c9,-7|0|0xc9c9c9"} } }
Page["QQ"]['TIM验证']["TIM好友动态设置页面"] = {页面名称="TIM好友动态设置页面",查询范围={253,   60,302,  110},点击范围={},多点颜色={{0x080808, "4|-2|0xf5f5f5,11|3|0xf5f5f5,0|4|0xf5f5f5,7|6|0x000000,12|7|0xebebeb,1|9|0x979797,6|13|0xf5f5f5,8|-15|0xf5f5f5,4|-16|0x080808"} } }
Page["QQ"]['TIM验证']["输入框清空状态"] = {页面名称="输入框清空状态",查询范围={176,  189,402,  468},点击范围={},多点颜色={{0xea1c27, "14|-25|0xf9ae08,7|-43|0x060606,21|-41|0x5a5959,22|-47|0xffffff,-37|155|0xb0b3bf,-5|34|0xf9ae08,-10|152|0xd6d7de,-18|154|0xf2f3f7,-15|165|0xb0b3bf"} } }

Page["QQ"]['TIM验证']["发送给页面"] = {页面名称="发送给页面",查询范围={314,   62,370,  107},点击范围={},多点颜色={{0x3c3c3c, "-1|6|0x000000,7|5|0x757575,14|1|0xf5f5f5,4|1|0xf5f5f5,19|1|0x121212,16|8|0x585858,15|17|0xf5f5f5,22|13|0x676767,8|14|0x000000"} } }

Page["QQ"]['TIM验证']["TIM聊天页面"] = {页面名称="TIM聊天页面",查询范围={ 155, 1264,214, 1303},点击范围={},多点颜色={{0x8e9098, "4|8|0xfbfbfb,8|4|0xa9abb1,13|3|0xfbfbfb,8|17|0x8e9098,21|18|0xfbfbfb,24|11|0x8e9098,33|16|0xe0e1e3,33|21|0xc0c1c6,3|29|0xe0e0e2"} } }
Page["QQ"]['TIM验证']["TIM聊天激活页面"] = {页面名称="TIM聊天激活页面",查询范围={ 154,  742,215,  795},点击范围={},多点颜色={{0x8e9098, "4|8|0xfbfbfb,8|4|0xa9abb1,13|3|0xfbfbfb,8|17|0x8e9098,21|18|0xfbfbfb,24|11|0x8e9098,33|16|0xe0e1e3,33|21|0xc0c1c6,3|29|0xe0e0e2"} } }
Page["QQ"]['TIM验证']["TIM已激活搜索"] = {页面名称="TIM已激活搜索",查询范围={ 76,   64,160,  100},点击范围={},多点颜色={{0xf7f8f9, "0|2|0xb2b2b2,0|14|0xb2b2b2,0|19|0xb2b2b2,-1|21|0xdfdfe0,8|11|0xf7f8f9,-7|10|0xf7f8f9,-19|17|0xb3b3b3,-23|21|0xbebebe"} } }
Page["QQ"]['TIM验证']["我的好友选择发送名片"] = {页面名称="我的好友选择发送名片",查询范围={ 563,   61,736,  205},点击范围={},多点颜色={{0xf7f8f9, "-2|-11|0x8e8e93,7|-1|0x8e8e93,-3|7|0x8e8e93,-8|1|0x8e8e93,12|84|0xb4b4b4,14|87|0xffffff,16|94|0xffffff,12|98|0x777777,15|100|0xffffff"} } }
Page["QQ"]['TIM验证']["已发送消息"] = {页面名称="已发送消息",查询范围={ 553,  243,733, 1229},点击范围={},多点颜色={{0x0188fb, "12|7|0x0188fb,22|16|0x0188fb,21|35|0x0188fb,15|73|0x0188fb,9|42|0x0188fb,7|20|0x0188fb,15|63|0x0188fb,17|35|0x0188fb,17|35|0x0188fb"} } }
Page["QQ"]['TIM验证']["发送名片按钮页面"] = {页面名称="发送名片按钮页面",查询范围={ 492,  783,571,  825},点击范围={},多点颜色={{0x02a6e0, "0|4|0x54c0e7,6|6|0x00a5e0,10|3|0xf4f4f4,2|2|0xf4f4f4,-3|14|0xf4f4f4,10|16|0xf4f4f4,11|20|0x00a5e0,15|13|0x00a5e0,5|13|0x00a5e0"} } }
Page["QQ"]['TIM验证']["搜索结果为会话"] = {页面名称="搜索结果为会话",查询范围={576,   55,720,  197},点击范围={},多点颜色={{0xf7f8f9, "3|-7|0x8e8e93,-4|-1|0x8e8e93,10|-1|0x8e8e93,2|6|0x8e8e93,75|85|0x8f8f8f,74|89|0xffffff,76|93|0xaaaaaa,76|100|0xffffff,88|103|0xffffff"} } }
Page["QQ"]['TIM验证']["搜索无结果"] = {页面名称="搜索无结果",查询范围={191,   39,740,  502},点击范围={},多点颜色={{0xcccccc, "2|12|0xcccccc,269|-342|0x8e8e93,283|-338|0x8e8e93,279|-332|0x8e8e93,-6|27|0xcccccc,11|27|0xe1e2e3,17|21|0xf6f7f9,13|7|0xf6f7f9,-4|5|0xf6f7f9"} } }


---登录
Page["QQ"]['TIM验证']["TIM一键登录首页"] = {页面名称="TIM一键登录首页",查询范围={222,  293,431,  371},点击范围={},多点颜色={{0x324492, "17|-14|0x1e8bdd,20|6|0xffffff,-6|-7|0x324494,11|-19|0x1d8cdf,13|9|0xffffff,27|6|0xffffff"} } }
Page["QQ"]['TIM验证']["TIM账号密码输入页"] = {页面名称="TIM账号密码输入页",查询范围={327,  933,385,  975},点击范围={},多点颜色={{0xffffff, "-5|-5|0xabd8fe,0|-6|0x0188fb,2|-15|0x0188fb,10|-6|0x0389fb,7|7|0x47a9fc,-1|4|0xb7ddfe,-6|3|0xffffff,-1|-2|0xffffff,9|8|0x0188fb"} } }
Page["QQ"]['TIM验证']["TIM使用QQ登录页"] = {页面名称="TIM使用QQ登录页",查询范围={482,  231,561,  300},点击范围={},多点颜色={{0x3ba1fc, "22|-10|0x0188fb,40|1|0x0084fb,31|21|0x0188fb,10|19|0x0188fb,4|10|0xffffff,10|-5|0xffffff,30|-8|0xffffff,37|13|0xffffff,19|21|0xffffff"} } }
Page["QQ"]['TIM验证']["TIM待办清单2"] = {页面名称="TIM待办清单2",查询范围={121,  217,573,  584},点击范围={},多点颜色={{0x353636, "-131|-125|0x353636,-10|-250|0x353636,129|-125|0x353636,-3|-88|0xffffff,-13|-131|0x0188fb,-26|-77|0x0188fb,41|-78|0x0188fb,42|-136|0xffffff,-47|-127|0xffffff"} } }
Page["QQ"]['TIM验证']["TIM待办清单"] = {页面名称="TIM待办清单",查询范围={259,  280,492,  506},点击范围={},多点颜色={{0x0188fb, "46|21|0x0188fb,39|-17|0xffffff,44|-66|0x0188fb,-36|-20|0x0188fb,117|20|0x0188fb,132|-148|0x0188fb,-22|-96|0x0188fb,138|-112|0xffffff,-31|-132|0x0188fb"} } }
Page["QQ"]['TIM验证']["TIM立即体验"] = {页面名称="TIM立即体验",查询范围={176,  265,518,  549},点击范围={},多点颜色={{0x0188fb, "-21|72|0x0188fb,-95|27|0x0188fb,147|30|0x0188fb,95|74|0x0188fb,119|-31|0x00dcff,117|-55|0x00dcff,141|-27|0x00dcff,38|40|0xffffff,-25|28|0xfcfeff"} } }



Page["QQ"]['TIM验证']["QQ已有账号密码页面"] = {页面名称="QQ已有账号密码页面",查询范围={225,  199,536,  607},点击范围={},多点颜色={{0xea1c27, "6|-16|0xf9ae08,-13|-25|0x000000,23|-26|0x000000,0|-34|0x040404,-16|41|0xf9ae08,-42|296|0x000000,-26|298|0xf2f3f7,-12|300|0x000000,15|300|0x000000"} } }
Page["QQ"]['TIM验证']["TIMQQ禁止登录"] = {页面名称="TIMQQ禁止登录",查询范围={200,  300,440,  700},点击范围={},多点颜色={{0x363636, "0|3|0x000000,0|8|0x4b4b4b,6|27|0x000000,6|7|0x050505,9|1|0xaeaeae,17|0|0x555555,5|-4|0xffffff,4|23|0xffffff,13|24|0xffffff"} } }
Page["QQ"]['TIM验证']["TIM下线通知"] = {页面名称="TIM下线通知",查询范围={330,  785,400,  826},点击范围={},多点颜色={{0xa1ccfb, "-1|7|0x0079ff,-5|14|0x94c5fb,1|14|0xf9f9f9,2|18|0xf9f9f9,-1|22|0x0079ff,4|22|0x0079ff,-5|8|0xf9f9f9,4|4|0xf9f9f9,9|11|0x0079ff"} } }
Page["QQ"]['TIM验证']["QQ安全提示"] = {页面名称="QQ安全提示",查询范围={298,  558,344,  603},点击范围={},多点颜色={{0xcbcbcb, "-8|1|0xffffff,4|1|0xffffff,-7|10|0xffffff,5|9|0xffffff,-7|19|0x000000,7|14|0x000000,1|24|0x000000,12|28|0x2f2f2f,2|29|0xffffff"} } }
Page["QQ"]['TIM验证']["TIM添加好友风险提示"] = {页面名称="TIM添加好友风险提示",查询范围={187,  740,299,  789},点击范围={},多点颜色={{0x91c4fb, "-5|9|0x1082ff,-5|12|0x007aff,1|11|0x007aff,-2|14|0xa0ccfb,4|14|0xf9f9f9,-6|15|0xf9f9f9,0|6|0xf9f9f9,2|23|0xf9f9f9,-2|22|0x76b6fc"} } }
Page["QQ"]['TIM验证']["TIM安全提示"] = {页面名称="TIM安全提示",查询范围={277,  569,347,  620},点击范围={},多点颜色={{0xe5e5e5, "17|-6|0x090909,32|-3|0xb8b8b8,24|2|0xf9f9f9,9|3|0xf9f9f9,14|4|0x000000,3|9|0x000000,27|9|0x000000,17|15|0xf9f9f9,19|22|0x000000"} } }
Page["QQ"]['TIM验证']["TIM封号"] = {页面名称="TIM封号",查询范围={297,  718,457,  979},点击范围={},多点颜色={{0xb3dcfe, "-6|4|0x0188fb,3|10|0xffffff,14|10|0xf8fcff,7|3|0xffffff,13|17|0x5fb4fd,-7|29|0xffffff,2|-207|0xededed,2|-204|0xaeaeae,7|-190|0xffffff"} } }
Page["QQ"]['TIM验证']["TIM下线通知资金管理弹出页面"] = {页面名称="TIM下线通知资金管理弹出页面",查询范围={225,  677,286,  717},点击范围={},多点颜色={{0xbbe4fa, "1|-6|0x40b9fd,1|-11|0x02a5ff,1|-19|0x6cc8fc,-5|-25|0xc3e6fa,6|-23|0x33b5fe,6|-21|0xf9f9f9,5|-14|0xf9f9f9,-2|-14|0xf9f9f9,-1|-21|0xf9f9f9"} } }
Page["QQ"]['TIM验证']["TIM登录失败"] = {页面名称="TIM登录失败",查询范围={335,  736,409,  777},点击范围={},多点颜色={{0x0079ff, "-1|6|0x0079ff,-3|12|0x0079ff,2|3|0xf9f9f9,2|14|0xf9f9f9,-4|17|0xf9f9f9,-2|21|0x3f9afd,6|20|0xf1f5f9,11|-1|0x0079ff,15|1|0xcde2fa"} } }
Page["QQ"]['TIM验证']["TIM重新登录偏色页"] = {页面名称="TIM重新登录偏色页",查询范围={130,  704,240,  744},点击范围={},多点颜色={{0x61c5fd, "7|-2|0x23affe,6|3|0xf9f9f9,5|-5|0xf9f9f9,23|-3|0xf9f9f9,24|-9|0x00a4ff,30|-7|0x01a4ff,26|8|0xf9f9f9,29|12|0x4dbdfc,18|2|0x00a4ff"} } }
Page["QQ"]['TIM验证']["IPhone弹出对话框好页面"] = {页面名称="IPhone弹出对话框好页面",查询范围={359,  452,637,  880},点击范围={},多点颜色={{0xbad9fb, "-1|5|0xd7e8fa,-4|17|0xb0d4fb,2|21|0x007aff,1|12|0x84bdfc,13|8|0xf9f9f9,12|18|0xf9f9f9,17|27|0x007aff,17|16|0x007aff,13|3|0x007aff"} } }
Page["QQ"]['TIM验证']["打开到视频页面"] = {页面名称="打开到视频页面",查询范围={673,   71,742,  126},点击范围={},多点颜色={{0xf7f7f7, "-1|-10|0x17171a,14|13|0xf7f7f7,-6|10|0xf7f7f7,3|8|0x17171a,-2|-2|0xf7f7f7,-6|-7|0xf7f7f7,-10|-10|0xf7f7f7,10|-5|0xababac,10|-4|0x1a1a1d"} } }
Page["QQ"]['TIM验证']["登录注册QQ登录验证"] = {页面名称="登录注册QQ登录验证",查询范围={ 40,  426,104,  502},点击范围={},多点颜色={{0xffffff, "2|12|0xffffff,10|7|0x989eb4,21|-2|0xffffff,21|6|0xffffff,23|14|0xffffff,29|8|0x989eb4,17|26|0x989eb4,1|7|0xb2b6c7,-5|7|0x989eb4"} } }
Page["QQ"]['TIM验证']["登录注册人脸识别页面"] = {页面名称="登录注册人脸识别页面",查询范围={ 44,  574,112,  651},点击范围={},多点颜色={{0xffffff, "2|12|0xffffff,10|7|0x989eb4,21|-2|0xffffff,21|6|0xffffff,23|14|0xffffff,29|8|0x989eb4,17|26|0x989eb4,1|7|0xb2b6c7,-5|7|0x989eb4"} } }
Page["QQ"]['TIM验证']["TIM登录中QQ封号"] = {页面名称="TIM登录中QQ封号",查询范围={ 353,  851,614, 1237},点击范围={},多点颜色={{0x3447a0, "-51|13|0xffffff,-50|-20|0x0a87e9,81|-206|0xffffff,77|-212|0x0086f1,72|-206|0xffffff,69|-212|0x0488f0,61|-206|0xffffff,49|-205|0x98cef9,14|-208|0xf7fbff"} } }
Page["QQ"]['TIM验证']["QQ登录账号暂时无法登录页面"] = {页面名称="QQ登录账号暂时无法登录页面",查询范围={ 226,  516,278,  558},点击范围={},多点颜色={{0x000000, "26|12|0xffffff,4|10|0x000000,4|-5|0x000000,4|21|0x000000,1|12|0x343434,7|11|0xffffff,21|-4|0xffffff,25|1|0xe1e1e1,19|17|0xffffff"} } }
Page["QQ"]['TIM验证']["QQ登录扫一扫"] = {页面名称="QQ登录扫一扫",查询范围={ 282,  777,328,  820},点击范围={},多点颜色={{0x1b1b1b, "-1|12|0xf7f7f9,-1|27|0x292929,-4|9|0xf7f7f9,2|9|0x89898a,-3|20|0xf7f7f9,16|5|0xf7f7f9,16|16|0xf7f7f9,21|2|0x000000,15|12|0x191919"} } }


Page["QQ"]['TIM验证']["TIME关联账号页面"] = {页面名称="TIME关联账号页面",查询范围={ 227,  433,509,  669},点击范围={},多点颜色={{0x1891ed, "30|-9|0x3348a1,-3|66|0xffffff,27|64|0x2697eb,117|32|0x333333,-4|-33|0x1690ed,25|82|0x2496eb,-8|113|0xffffff,9|93|0xffffff,34|92|0x2898ea"} } }
Page["QQ"]['TIM验证']["空间需要刷新页面5"] = {页面名称="空间需要刷新页面5",查询范围={ 610,  552,724,  647},点击范围={},多点颜色={{0x1e1e1e, "6|-10|0x131313,-6|-28|0x303030,-9|-32|0xffffff,-20|-42|0xffffff,-7|-46|0xffffff,-3|-8|0x0a0a0a,3|-10|0xffffff,-21|-40|0xffffff,-14|-49|0x222222"} } }
Page["QQ"]['TIM验证']["空间需要刷新页面4"] = {页面名称="空间需要刷新页面4",查询范围={ 424,  361,744,  952},点击范围={},多点颜色={{0x9c9c9c, "-118|45|0x656565,-4|13|0xffffff,5|14|0xffffff,16|20|0xffffff,17|24|0xffffff,25|39|0x2d2d2d,28|45|0xffffff,22|45|0x0a0a0a,-120|46|0xffffff"} } }
Page["QQ"]['TIM验证']["空间需要刷新页面3"] = {页面名称="空间需要刷新页面3",查询范围={  9,   60,135,  117},点击范围={},多点颜色={{0xffffff, "6|3|0xb9b9b9,27|5|0xffffff,35|3|0xffffff,49|6|0xbdbdbd,45|14|0xc7c7c6,42|25|0xd4d4d4,72|7|0xbdbdbd,62|-3|0xafafaf,60|13|0xc7c7c6"} } }
Page["QQ"]['TIM验证']["空间需要刷新页面2"] = {页面名称="空间需要刷新页面2",查询范围={  432,  549,745,  649},点击范围={},多点颜色={{0xffffff, "2|-3|0xe0e0e0,-7|-28|0xffffff,-13|-30|0x7e7e7e,-125|-20|0x9f9f9f,-136|-26|0x262626,-129|-24|0xcacaca,-145|2|0xffffff,-155|2|0xffffff,-147|8|0xaeaeae"} } }
Page["QQ"]['TIM验证']["空间需要刷新页面"] = {页面名称="空间需要刷新页面",查询范围={ 620,  516,718,  653},点击范围={},多点颜色={{0x0a0a0a, "14|28|0x7e7e7e,9|34|0xa9a9a9,14|35|0xffffff,7|16|0x0d0d0d,4|10|0xffffff,-5|0|0xffffff,8|-42|0x5b5b5b,-6|-42|0x5b5b5b,28|-37|0x595959"} } }
Page["QQ"]['TIM验证']["TIM邮件"] = {页面名称="TIM邮件",查询范围={ 137,  384, 641,  711},点击范围={},多点颜色={{0xa6d4ff, "17|14|0x5ab0ff,2|31|0x359eff,-154|-60|0xa8d0fe,156|-85|0x61aaff,185|-96|0xb8d8fd,209|-123|0x61aaff,163|-105|0xffffff,157|17|0xb7dcff"} } }
Page["QQ"]['TIM验证']["TIM验证有问题一"] = {页面名称="TIM验证有问题一",查询范围={ 23,  145,69,  262},点击范围={},多点颜色={{0x989898, "-3|14|0x333333,-1|20|0xf4f4f4,-4|5|0xf4f4f4,-8|13|0xf4f4f4,-8|71|0x000000,-7|79|0x000000,2|80|0x000000,6|75|0xffffff,-8|69|0xafafaf"} } }
Page["QQ"]['TIM验证']["文件助手"] = {页面名称="文件助手",查询范围={ 13,  194,112,  286},点击范围={},多点颜色={{0x1e8df1, "8|-3|0x1e8df1,-15|-3|0xffffff,-22|19|0xffffff,6|7|0x1e8df1,13|-7|0x8ec6f8,-1|-15|0x1e8df1,-28|3|0x1e8df1,25|20|0x1e8df1,-8|30|0x1e8df1"} } }



Page["QQ"]['TIM验证']["QQ掉登"] = {页面名称="QQ掉登",查询范围={251,  208,496,  609},点击范围={},多点颜色={{0xea1c27, "-1|12|0xea1c27,-9|41|0xf9ae08,35|45|0xfbb51e,4|-34|0x000000,19|296|0xeeeff2,30|285|0xdfe0e6,38|303|0xb0b3bf,45|302|0xf2f3f7,60|296|0xc3c5cf"} } }
--Page["QQ"]['TIM验证']["TIM通讯录弹出页"] = {页面名称="TIM通讯录弹出页",查询范围={212,  243,405,  3789},点击范围={},多点颜色={{0x333333, "12|3|0x3448a1,21|-23|0xf4f4f4,13|26|0x0086f1,2|33|0xf4f4f4,8|20|0x3448a1,10|4|0x3448a1,17|-8|0x3448a1,26|-3|0x0086f1,-2|1|0x333333"} } }
Page["QQ"]['TIM验证']["TIM绑定手机号码页"] = {页面名称="TIM绑定手机号码页",查询范围={212,  243,405,  3789},点击范围={},多点颜色={{0x333333, "12|3|0x3448a1,21|-23|0xf4f4f4,13|26|0x0086f1,2|33|0xf4f4f4,8|20|0x3448a1,10|4|0x3448a1,17|-8|0x3448a1,26|-3|0x0086f1,-2|1|0x333333"} } }
Page["QQ"]['TIM验证']["TIM通讯录弹出页"] = {页面名称="TIM通讯录弹出页",查询范围={427,  386,584,  511},点击范围={},多点颜色={{0xf2a913, "-41|13|0x523c19,-53|-25|0xe52520,7|-41|0x1d1917,-45|-65|0xfbc53d,-42|-86|0xfeffff,-65|-84|0xfeffff,-64|-76|0x050611,-51|-94|0x333334,-49|-24|0xdd231d"} } }
Page["QQ"]['TIM验证']["TIM下线重新登录页"] = {页面名称="TIM下线重新登录页",查询范围={284,  474,342,  517},点击范围={},多点颜色={{0x000000, "1|31|0x000000,15|15|0x000000,6|16|0xf9f9f9,9|2|0xf9f9f9,-7|3|0xf9f9f9,-12|0|0x070707,15|-1|0x000000,3|2|0x272727,3|30|0x272727"} } }
Page["QQ"]['TIM验证']["TIM更多页面"] = {页面名称="TIM更多页面",查询范围={324,   63,383,  105},点击范围={},多点颜色={{0xf5f5f5, "0|13|0x000000,-2|24|0xd4d4d4,-14|30|0x1d1d1d,6|30|0x121212,15|30|0x000000,9|24|0xf5f5f5,-1|32|0xf5f5f5,-10|26|0xf5f5f5,8|15|0xf5f5f5"} } }

---TIM----click
Page["QQ"]['TIM验证']["TIM咨询通道聊天设置头像按钮"] = {点击范围={ 46,  195,108,  264} }





Page["QQ"]['TIM验证']["TIM输入法发送按钮"] = {点击范围={572, 1254,738, 1321} }
Page["QQ"]['TIM验证']["TIM发送给搜索按钮"] = {点击范围={ 329,  152,448,  181} }
Page["QQ"]['TIM验证']["TIM陌生人页面右上角人物标记按钮"] = {点击范围={ 688,   71,719,   97} }
Page["QQ"]['TIM验证']["TIM消息页按钮"] = {点击范围={98, 1264,152, 1303} }
Page["QQ"]['TIM验证']["TIM消息页搜索按钮"] = {点击范围={266,  139,327,  189} }
Page["QQ"]['TIM验证']["TIM搜索框清空按钮"] = {点击范围={657,   72,709,   92} }
Page["QQ"]['TIM验证']["TIM搜索页面成功按钮"] = {点击范围={54,  153,83,  185} }
Page["QQ"]['TIM验证']["TIM添加对象页面加好友按钮"] = {点击范围={303, 1255,420, 1322} }
Page["QQ"]['TIM验证']["TIM添加对象页面点击QQ空间按钮"] = {点击范围={83,  781,261,  851} }
Page["QQ"]['TIM验证']["TIM空间页面点击QQ空间按钮"] = {点击范围={303,  874,435,  904} }
Page["QQ"]['TIM验证']["TIM验证信息下一步按钮"] = {点击范围={637,   70,713,   96} }
Page["QQ"]['TIM验证']["TIM发送按钮"] = {点击范围={665,   67,723,   96} }
Page["QQ"]['TIM验证']["TIM左上角返回按钮"] = {点击范围={57,   69,109,   95} }
Page["QQ"]['TIM验证']["TIM添加失败弹出框页面确认按钮"] = {点击范围={329,  711,420,  749} }
Page["QQ"]['TIM验证']["TIM启用通讯录关闭按钮"] = {点击范围={656,   68,710,   93} }
Page["QQ"]['TIM验证']["TIM拒绝任何人添加确定按钮"] = {点击范围={342,  745,402,  770} }
Page["QQ"]['TIM验证']["TIM下线通知重新登录页按钮"] = {点击范围={435,  837, 575,  868} }




Page["QQ"]['TIM验证']["TIM消息首页右上角按钮"] = {点击范围={690,   70,718,   93} }
Page["QQ"]['TIM验证']["TIM消息页菜单中添加好友按钮"] = {点击范围={518,  279,599,  302} }
Page["QQ"]['TIM验证']["TIM立即体验按钮"] = {点击范围={286, 1103,470, 1154} }

---登录按钮
Page["QQ"]['TIM验证']["TIM登录一键登录"] = {点击范围={398, 1038,420, 1056} }
Page["QQ"]['TIM验证']["TIM登录"] = {点击范围={334,  930,409,  987} }
Page["QQ"]['TIM验证']["TIM授权登录"] = {点击范围={319,  709,430,  747} }
---空间验证----

Page["QQ"]['空间验证']["空间一键登录页面"] = {页面名称="空间一键登录页面",查询范围={231,  149,479,  394},点击范围={},多点颜色={{0xffffff, "4|19|0xffcd00,58|16|0xffcd00,-3|54|0xffffff,41|41|0xffcd00,41|98|0xffcd00,49|83|0xf1a308,-24|46|0xffcd00,-41|113|0xffcd00,65|107|0xffcd00"} } }
Page["QQ"]['空间验证']["空间账号授权页面"] = {页面名称="空间账号授权页面",查询范围={465,  620,575,  715},点击范围={},多点颜色={{0xffffff, "-18|4|0xffc028,-13|-8|0xffc028,0|10|0xffc028,-15|14|0xffffff,-16|38|0x2076cd,-40|17|0x267dd4,17|0|0xffc028,21|15|0x277ed4,-9|37|0x2077cd"} } }

----
Page["QQ"]['空间验证']["空间主页面"] = {页面名称="空间主页面",查询范围={335, 1246,412, 1320},点击范围={},多点颜色={{0x1b2328, "-6|-7|0xffd616,10|-8|0xffd513,-7|6|0xffd514,10|5|0xffd412,18|-1|0x1b2328,2|-19|0xffd717,-13|0|0x1b2328,3|13|0x1b2328,1|0|0x1b2328"} } }
Page["QQ"]['空间验证']["空间我的页面"] = {页面名称="空间我的页面",查询范围={502, 1249,573, 1326},点击范围={},多点颜色={{0xffc600, "-13|3|0xffc600,-24|-8|0xffffff,7|-9|0xffffff,-7|-9|0xffffff,-6|-17|0xffc600,-5|-22|0xffc90d,-12|-19|0xfff3cd,-3|0|0xffc600,-9|-14|0xffc600"} } }
Page["QQ"]['空间验证']["空间好友页面"] = {页面名称="空间好友页面",查询范围={329,   63,373,  103},点击范围={},多点颜色={{0x2d2d2d, "-2|14|0x2d2d2d,-8|21|0x2d2d2d,2|17|0x2d2d2d,3|11|0xf8f8f8,-7|17|0xf8f8f8,-4|9|0xf8f8f8,-3|3|0xf3f3f3,-7|-2|0xf8f8f8,-1|0|0x2d2d2d"} } }
Page["QQ"]['空间验证']["空间全部好友搜索页面"] = {页面名称="空间全部好友搜索页面",查询范围={301,   62,345,  102},点击范围={},多点颜色={{0x2d2d2d, "-1|7|0xf8f8f8,-5|4|0x2d2d2d,-12|0|0xf8f8f8,-7|14|0xf8f8f8,-7|18|0x2d2d2d,-7|22|0xf8f8f8,1|25|0x525252,-12|26|0x7c7c7c,12|27|0x2d2d2d"} } }
Page["QQ"]['空间验证']["空间全部好友搜索有账号状态"] = {页面名称="空间全部好友搜索有账号状态",查询范围={566,  146,721,  204},点击范围={},多点颜色={{0xffffff, "0|-9|0xdedede,-8|0|0xdedede,11|2|0xdedede,3|9|0xdedede,74|-13|0x181818,74|-2|0x535353,78|-2|0xececec,79|-10|0xececec,75|8|0x000000"} } }
Page["QQ"]['空间验证']["空间加为好友页面"] = {页面名称="空间加为好友页面",查询范围={298,  747,343,  878},点击范围={},多点颜色={{0xffffff, "-4|6|0x2863ad,-14|1|0x2863ad,-13|-8|0x2863ad,-1|-9|0x2863ad,-4|10|0x2863ad,-14|10|0x2863ad,-12|16|0xdce6f2,-4|17|0xffffff,0|-2|0xffffff"} } }
Page["QQ"]['空间验证']["空间访问有密码加为好友页面"] = {页面名称="空间访问有密码加为好友页面",查询范围={15,  945,122, 1328},点击范围={},多点颜色={{0x306298, "-3|-3|0xececec,4|-4|0xececec,-2|3|0xececec,4|7|0xececec,13|5|0xececec,11|15|0x285c95,5|17|0x2c5f97,2|18|0xadbed0,-4|18|0x2c5f97"} } }
Page["QQ"]['空间验证']["空间输入验证信息页面"] = {页面名称="空间输入验证信息页面",查询范围={ 8,   60,100,  237},点击范围={},多点颜色={{0x8d8d8d, "-2|7|0x626262,-2|13|0xf8f8f8,-2|18|0xf8f8f8,-2|24|0xf8f8f8,-9|131|0x777777,-18|137|0xcbcbcb,-5|135|0x777777,-7|138|0x777777,-9|150|0xffffff"} } }
Page["QQ"]['空间验证']["空间任何人不得查看页面"] = {页面名称="空间任何人不得查看页面",查询范围={ 302,  586,464,  750},点击范围={},多点颜色={{0xb7b7b7, "14|25|0xececec,45|18|0xb7b7b7,-3|44|0xb7b7b7,16|44|0xececec,31|44|0xb7b7b7,18|65|0xb7b7b7,-32|72|0xb7b7b7,73|71|0xb7b7b7,16|21|0xececec"} } }


Page["QQ"]['空间验证']["空间验证红色频繁页面"] = {页面名称="空间验证红色频繁页面",查询范围={15,   78,122,  137},点击范围={},多点颜色={{0xfe6c6c, "-2|9|0xfe6c6c,-2|19|0xfe6c6c,4|13|0xffffff,6|6|0xffffff,20|-5|0xfe6c6c,22|11|0xfe6c6c,24|2|0xfe6c6c,8|3|0xffffff,-1|20|0xfe6c6c"} } }
Page["QQ"]['空间验证']["空间验添加需要答案页面"] = {页面名称="空间验添加需要答案页面",查询范围={14,  192,71,  231},点击范围={},多点颜色={{0x0d0d0d, "-1|6|0xffffff,8|5|0xffffff,7|14|0xffffff,4|18|0x4a4a4a,10|17|0xffffff,-4|13|0x000000,-4|23|0x000000,16|25|0xeaeaea,1|1|0x3e3e3e"} } }
Page["QQ"]['空间验证']["空间验证成功蓝色页面"] = {页面名称="空间验证成功蓝色页面",查询范围={10,   54,104,  112},点击范围={},多点颜色={{0xffffff, "-7|4|0x12b7f5,5|4|0x12b7f5,-6|13|0x12b7f5,-2|22|0x12b7f5,1|14|0xffffff,12|8|0x12b7f5,-10|10|0x12b7f5,0|2|0xffffff"} } }

Page["QQ"]['空间验证']["空间确认添加为好友"] = {页面名称="空间确认添加为好友",查询范围={475,  721,532,  760},点击范围={},多点颜色={{0x000000, "5|-3|0xffffff,-3|-3|0xffffff,3|5|0xffffff,13|-6|0x000000,15|-9|0x000000,24|-7|0x161616,22|1|0xffffff,12|4|0x000000,18|9|0x828282"} } }
-----

Page["QQ"]['空间验证']["空间服务协议和隐私政策页面"] = {页面名称="空间服务协议和隐私政策页面",查询范围={182,  376,222,  424},点击范围={},多点颜色={{0x848484, "0|10|0x000000,0|18|0x000000,-3|33|0x030303,4|27|0xffffff,3|14|0xffffff,4|3|0xadadad,7|3|0x7d7d7d,8|19|0x000000,5|33|0x393939"} } }

---空间验证----

Page["QQ"]['空间验证']["空间全部好友搜索框点击范围"] = {点击范围={577,  160,602,  181} }
Page["QQ"]['空间验证']["空间全部好友搜索框输入法搜索按钮"] = {点击范围={658, 1277,725, 1318} }
Page["QQ"]['空间验证']["空间返回按钮"] = {点击范围={57,   69,117,   93} }
Page["QQ"]['空间验证']["空间好友页面点击全部好友按钮"] = {点击范围={32,  476,142,  507} }
Page["QQ"]['空间验证']["空间我的页面点击好友按钮"] = {点击范围={175,  494,250,  526} }
Page["QQ"]['空间验证']["空间我的坐标点"] = {点击范围={518, 1304,553, 1319} }
Page["QQ"]['空间验证']["空间授权登录按钮"] = {点击范围={328,  964,415, 1004} }
Page["QQ"]['空间验证']["空间一键登录按钮"] = {点击范围={277,  727,452,  769} }
Page["QQ"]['空间验证']["空间服务协议和隐私政策页面同意按钮"] = {点击范围={485,  951,563,  982} }
Page["QQ"]['空间验证']["验证消息完成按钮"] = {点击范围={ 663,   71,723,  106} }


-- 添加好友部分

Page["QQ"]['添加好友']["春节红色广告"] = {点击范围={709,  166,735,  186} }
Page["QQ"]['添加好友']["点击联系人按钮"] = {点击范围={247, 1249,308, 1305} }
Page["QQ"]['添加好友']["点击联系人右上角添加按钮"] = {点击范围={701,87,720,94} }
Page["QQ"]['添加好友']["搜索结果按钮"] = {点击范围={49,178,117,213} }
Page["QQ"]['添加好友']["发送验证按钮"] = {点击范围={672,70,730,97} }
Page["QQ"]['添加好友']["添加首页搜索框"] = {点击范围={104,  174,213,  233} }
Page["QQ"]['添加好友']["搜索取消"] = {点击范围={656,77,713,104} }
Page["QQ"]['添加好友']["风险提示点击继续按钮"] = {点击范围={194,  771,249,  799} }
Page["QQ"]['添加好友']["点击输入框按钮"] = {点击范围={88, 1173,186, 1227} }
Page["QQ"]['添加好友']["添加失败确定"] = {点击范围={341,  755,402,  780} }
Page["QQ"]['添加好友']["联系人界面点击搜索按钮"] = {点击范围={295,  162,422,  217} }
Page["QQ"]['添加好友']["联系人搜索界面清空输入框按钮"] = {点击范围={583,   77,598,   94} }
Page["QQ"]['添加好友']["键盘发送按钮"] = {点击范围={597, 1268,716, 1316} }
Page["QQ"]['添加好友']["添加对象首页底部加好友按钮"] = {点击范围={268,1250,469,1300} }
Page["QQ"]['添加好友']["消息页面删除消息按钮"] = {点击范围={648,  295,717,  348} }
Page["QQ"]['添加好友']["安全提示确定"] = {点击范围={316,  742,435,  779} }
Page["QQ"]['添加好友']["联系人首页"] = {页面名称="联系人首页",查询范围={232,1241,334,1319},点击范围={},多点颜色={{0x7ddcff, "16|-4|0x83dfff,16|7|0xeefaff,27|13|0x59cefe,19|30|0xcaefff,14|48|0x03081a"} } }
Page["QQ"]['添加好友']["添加首页"] = {页面名称="添加首页",查询范围={275,   62,329,  104},点击范围={},多点颜色={{0x000000, "-2|27|0x000000,-4|21|0xedeff5,-3|12|0xedeff5,6|9|0x838487,13|18|0x000000,21|26|0x000000,20|22|0xedeff5,15|4|0xedeff5,11|25|0xedeff5"} } }
Page["QQ"]['添加好友']["搜索页面"] = {页面名称="搜索页面",查询范围={100,   52,715,  120},点击范围={},多点颜色={{0xb0b3bf, "43|-2|0xb0b3bf,32|10|0xb0b3bf,25|13|0xf5f6fa,544|10|0x83c1ff"} } }
Page["QQ"]['添加好友']["搜索结果"] = {页面名称="搜索结果",查询范围={23,162,190,231},点击范围={},多点颜色={{0x5f6379, "7|9|0xffffff,12|15|0x5f6379,70|15|0xf7f7f7,83|9|0x050a1c"} } }
Page["QQ"]['添加好友']["添加对象首页"] = {页面名称="添加对象首页",查询范围={306,1249,449,1298},点击范围={},多点颜色={{0x00cafc, "17|10|0xffffff,27|11|0x00cafc,41|2|0xffffff,62|11|0xffffff"} } }
Page["QQ"]['添加好友']["发送验证首页"] = {页面名称="发送验证首页",查询范围={25,   57,745,  406},点击范围={},多点颜色={{0x8b8f9d, "1|-11|0x888c9a,-5|-15|0xf5f6fa,11|-17|0xeaebf0,31|-9|0x878b99,47|-16|0x878b99,9|-298|0x000000,9|-280|0x000000,623|-293|0xffffff,667|-286|0x000000"} } }
Page["QQ"]['添加好友']["发送验证有问题首页"] = {页面名称="发送验证有问题首页",查询范围={ 23,   60,742,  403},点击范围={},多点颜色={{0x878b99, "2|8|0x878b99,7|11|0xf5f6fa,26|0|0x9ea2ae,27|14|0xf5f6fa,-2|-284|0xffffff,311|-276|0x000000,361|-271|0x000000,664|-279|0xffffff,629|-260|0x000000"} } }
Page["QQ"]['添加好友']["搜索首页无搜索结果"] = {页面名称="搜索首页无搜索结果",查询范围={262,   73,304,  109},点击范围={},多点颜色={{0x19baff, "7|-1|0xfeffff,8|8|0xffffff,14|10|0x19baff,2|14|0x19baff"} } }
Page["QQ"]['添加好友']["加好友验证发短信"] = {页面名称="加好友验证发短信",查询范围={29,  153,119,  185},点击范围={},多点颜色={{0xffcc00, "-7|2|0xf6f7fb,1|4|0xfed221,0|9|0xffcc00,0|12|0xffcc00,-3|12|0xf6f7fb,-3|6|0xf6f7fb,-21|9|0x9ea1ad,-39|10|0x878b99,-53|5|0xaaadb8"} } }
Page["QQ"]['添加好友']["风险提示"] = {页面名称="风险提示",查询范围={177,  767,271,  799},点击范围={},多点颜色={{0x000000, "14|0|0x000000,0|12|0x727272,7|2|0xffffff,-14|0|0xffffff"} } }
Page["QQ"]['添加好友']["添加失败"] = {页面名称="添加失败",查询范围={341,  755,402,  780},点击范围={},多点颜色={{0x2d2d2d, "4|11|0xffffff,15|7|0xe9e9e9,30|8|0xffffff,23|-4|0x818181"} } }
Page["QQ"]['添加好友']["消息页面删除消息"] = {页面名称="消息页面删除消息",查询范围={625,  251,747,  393},点击范围={},多点颜色={{0xffffff, "8|8|0xfffafa,20|-5|0xff3b30,30|5|0xff3b30,33|13|0xff443a"} } }
Page["QQ"]['添加好友']["消息页面已发消息"] = {页面名称="消息页面已发消息",查询范围={157,  327,190,  359},点击范围={},多点颜色={{0xffd0a7, "7|-3|0xff8011,15|-10|0xff851b,5|6|0xfff1e5,19|9|0xff8011"} } }
Page["QQ"]['添加好友']["消息页面标为未读"] = {页面名称="消息页面标为未读",查询范围={442,  289,592,  360},点击范围={},多点颜色={{0xfffdfb, "20|6|0xffdba1,11|14|0xffffff,35|13|0xff9c00,44|2|0xffffff"} } }
Page["QQ"]['添加好友']["聊天界面"] = {页面名称="聊天界面",查询范围={529, 1262,563, 1297},点击范围={},多点颜色={{0xeff2fc, "19|2|0xeff2fc,11|12|0xeff2fc,9|2|0x989eb4,9|17|0x989eb4"} } }
Page["QQ"]['添加好友']["聊天界面输入话术"] = {页面名称="聊天界面输入话术",查询范围={717, 1302,740, 1319},点击范围={},多点颜色={{0x007aff, "0|-7|0x007aff,-9|-5|0x007aff,-10|1|0x007aff,-1|-2|0x007aff"} } }
Page["QQ"]['添加好友']["聊天界面输入框已发"] = {页面名称="聊天界面输入框已发",查询范围={32, 1176,117, 1214},点击范围={},多点颜色={{0x000000, "0|7|0x000000,10|20|0xb0b0b0,11|9|0xffffff,41|0|0x1b1b1b"} } }
Page["QQ"]['添加好友']["搜索好友界面"] = {页面名称="搜索好友界面",查询范围={656,70,723,103},点击范围={},多点颜色={{0x58acff, "9|10|0x40a0ff,20|13|0x8cc6ff,36|10|0x8fc7ff,24|23|0x47a3ff"} } }
Page["QQ"]['添加好友']["搜索好友界面清空状态"] = {页面名称="搜索好友界面清空状态",查询范围={583,78,599,97},点击范围={},多点颜色={{0xf5f6fa, "2|10|0xf5f6fa,7|4|0xf5f6fa,-4|2|0xf5f6fa,1|6|0xf5f6fa"} } }
Page["QQ"]['添加好友']["搜索好友界面有输入状态"] = {页面名称="搜索好友界面有输入状态",查询范围={578,76,603,99},点击范围={},多点颜色={{0x8e8e93, "10|-1|0xf5f6fa,9|-11|0x8e8e93,19|-3|0x8e8e93,10|5|0x8e8e93"} } }
Page["QQ"]['添加好友']["搜索结果非好友"] = {页面名称="搜索结果非好友",查询范围={47,  372,94,  421},点击范围={},多点颜色={{0x19baff, "6|0|0xffffff,41|-7|0x19baff,6|-28|0x19baff,17|-8|0x19baff"} } }
Page["QQ"]['添加好友']["搜索结果为好友"] = {页面名称="搜索结果为好友",查询范围={670,  247,708,  274},点击范围={},多点颜色={{0xb0b3bf, "-9|-6|0xeceef5,-2|-8|0xb0b3bf,-10|8|0xeceef5,4|-6|0xeceef5"} } }
Page["QQ"]['添加好友']["安全提示"] = {页面名称="安全提示",查询范围={291,  558,469,  794},点击范围={},多点颜色={{0xffffff, "16|-6|0x000000,13|-8|0x5a5a5a,50|3|0x000000,51|-4|0xffffff,51|76|0xc1c1c1,51|65|0x696969,48|81|0x353535,64|72|0xa1a1a1,44|192|0x000000"} } }
Page["QQ"]['添加好友']["加好友滑块"] = {页面名称="加好友滑块",查询范围={97,  678,205,  736},点击范围={},多点颜色={{0x00cafc, "8|1|0x00cafc,2|10|0x00cafc,11|17|0x00cafc,7|24|0x00cafc"} } }
Page["QQ"]['添加好友']["同意启用"] = {页面名称="同意启用",查询范围={289,  766,484,  812},点击范围={},多点颜色={{0x00cafc, "10|2|0x00cafc,22|14|0x93e8fe,4|17|0x00cafc,39|14|0x00cafc"} } }
Page["QQ"]['添加好友']["红包答题"] = {页面名称="红包答题",查询范围={260,  329,487,  374},点击范围={},多点颜色={{0xe3aa7a, "11|0|0x243883,21|-6|0x243883,7|8|0xe2b788,13|8|0xe9bc89"} } }
Page["QQ"]['添加好友']["QQ空间标志"] = {页面名称="QQ空间标志",查询范围={35,120,66, 1300},点击范围={},多点颜色={{0x989eb4, "13|-5|0x989eb4,23|0|0x989eb4,20|15|0x989eb4,4|13|0x989eb4,1|78|0x989eb4,18|81|0x989eb4,20|91|0x989eb4,6|90|0x989eb4,18|83|0x989eb4"} } }
Page["QQ"]['添加好友']["QQ空间加好友"] = {页面名称="QQ空间加好友",查询范围={309, 1254,363, 1311},点击范围={},多点颜色={{0x00cafc, "6|7|0x00cafc,-2|12|0x00cafc,10|7|0x00cafc,5|1|0x00cafc,18|14|0x00cafc"} } }
Page["QQ"]['添加好友']["QQ空间加好友加密"] = {页面名称="QQ空间加好友加密",查询范围={48, 1173,98, 1212},点击范围={},多点颜色={{0xf9be27, "0|-9|0xfff0a1,-10|-7|0xffcf00,9|-7|0xffe26d,5|1|0xfac22a,2|6|0xfbc92f,-1|-14|0xedeff5,-13|-9|0xedeff5,-10|5|0xedeff5,9|4|0xdca771"} } }
Page["QQ"]['添加好友']["无法查看空间"] = {页面名称="无法查看空间",查询范围={31, 1153,230, 1238},点击范围={},多点颜色={{0xbff2ff, "0|0|0xbff2ff,24|16|0xbff2ff,24|16|0xbff2ff,20|10|0xbff2ff,8|16|0xbff2ff"} } }
Page["QQ"]['添加好友']["QQ空间被封"] = {页面名称="QQ空间被封",查询范围={282,  915,473,  942},点击范围={},多点颜色={{0x00bff8, "22|0|0x00c6fb,43|2|0x00cbfc,71|7|0x00cefc,91|7|0x00d0fc,103|5|0x00d1fc,122|-5|0x000000,108|-9|0xdfe0e8,83|-6|0x00cffc,35|-1|0x00cafc"} } }
Page["QQ"]['添加好友']["直接通过好友"] = {页面名称="直接通过好友",查询范围={29,  426,69,  469},点击范围={},多点颜色={{0x181c2d, "0|-3|0xffffff,-3|-8|0x03081a,3|-10|0xffffff,0|8|0x03081a,0|14|0x03081a,1|17|0x03081a,10|17|0x676a75,-10|8|0xffffff,-11|-3|0xffffff"} } }
Page["QQ"]['添加好友']["QQ空间标志BG"] = {页面名称="QQ空间标志BG",查询范围={35,120,66, 1300},点击范围={},多点颜色={{0x989eb4, "4|2|0x989eb4,14|-3|0x989eb4,24|-1|0x989eb4,24|7|0x989eb4,21|12|0x989eb4,9|13|0x989eb4,6|15|0x989eb4,4|8|0x989eb4,3|3|0x989eb4"} } }
Page["QQ"]['添加好友']["QQ等级太阳"] = {页面名称="QQ等级太阳",查询范围={92,120,358, 1044},点击范围={},多点颜色={{0xfdbf04, "0|-8|0xf3bf6a,-9|2|0xfdd36f,-9|8|0xffba18,-1|13|0xf19300,1|-11|0xfff4a6,-9|-8|0xfffac5,7|-7|0xfff1a6,10|-1|0xffda66,0|3|0xffcd38"} } }
Page["QQ"]['添加好友']["QQ等级月亮"] = {页面名称="QQ等级月亮",查询范围={92,120,450, 1044},点击范围={},多点颜色={{0xf8bc30, "-7|0|0xffb800,-11|-5|0xffcb2f,-12|-8|0xffd956,-13|-13|0xfffff1,-14|-7|0xffee9d,-10|-6|0xffd444,-8|-3|0xffc41c,-8|-2|0xffbe0b,-4|-1|0xffca30"} } }
Page["QQ"]['添加好友']["QQ等级皇冠"] = {页面名称="QQ等级皇冠",查询范围={92,120,358, 1044},点击范围={},多点颜色={{0xffe293, "8|-10|0xbe3200,-5|-9|0xc63900,2|-20|0xffef9a,1|1|0xffb715,10|5|0xffdb7d,5|3|0xd8760f,-6|4|0xf7d7a8,-4|-9|0xc63900,8|-10|0xbe3200"} } }
Page["QQ"]['添加好友']["空间注销"] = {页面名称="空间注销",查询范围={335,  801,582,  948},点击范围={},多点颜色={{0xffa026, "3|30|0xfe9b2a,14|47|0xfea12a,44|27|0xffca1a,45|19|0xfec91a,59|82|0xfed016,100|81|0xfed315,151|97|0xfed812,61|94|0xffd216,36|21|0xffc91b"} } }
Page["QQ"]['添加好友']["已经发过消息"] = {页面名称="已经发过消息",查询范围={264,  129,710, 1223},点击范围={},多点颜色={{0x19baff, "23|4|0x19baff,56|2|0x19baff,-17|0|0x19baff,-41|-2|0x19baff"} } }
Page["QQ"]['添加好友']["已经消息"] = {页面名称="已经消息",查询范围={507,  131,718,  626},点击范围={},多点颜色={{0x19baff, "10|-8|0x19baff,-3|-17|0x19baff,-5|31|0x19baff,15|17|0xebedf6,10|-22|0xebedf6,17|-4|0xdeeaf7,18|-21|0xebedf6,17|-12|0x1dbbff,9|-11|0xe6ecf6"} } }

Page["QQ"]['添加好友']["聊天界面图片选择区"] = {页面名称="聊天界面图片选择区",查询范围={32,  736,737, 1326},点击范围={},多点颜色={{0xb2effe, "30|-5|0xeafbff,44|-5|0xeafbff,66|1|0xf3fcff,-255|-4|0x0f1425,-545|-7|0x03081a,-335|6|0xf7f8f9,1|3|0xb2effe,106|9|0xb2effe,-393|-520|0x00cafc"} } }
Page["QQ"]['添加好友']["聊天界面图片预览已选择"] = {页面名称="聊天界面图片预览已选择",查询范围={672,   51,733,  105},点击范围={},多点颜色={{0xffffff, "-13|0|0x00cafc,-3|-14|0x00cafc,19|5|0xf8f7f6,11|-15|0x03c9fc,0|14|0x00cafc,-29|2|0x1a1a1a,-12|-1|0x00cafc,-6|-6|0xc1f2fe,2|9|0x00cafc"} } }
Page["QQ"]['添加好友']["聊天界面图片预览未选择"] = {页面名称="聊天界面图片预览未选择",查询范围={670,   52,736,  104},点击范围={},多点颜色={{0xc0c0c0, "-10|-8|0x121212,-34|-13|0xe7e7e7,-26|-21|0x121212,-38|-30|0x1a1a1a,-10|-35|0xc6c6c6,6|-25|0xacacac,-9|-14|0x121212,-23|-6|0x121212,-2|1|0x797979"} } }
Page["QQ"]['添加好友']["登录模块开始验证"] = {页面名称="登录模块开始验证",查询范围={248,  753,491,  844},点击范围={},多点颜色={{0xf1fcff, "-14|-5|0x00cafc,1|-12|0x98e9fe,30|-9|0xffffff,41|-2|0xffffff,63|1|0xffffff,98|-4|0x6be0fd,101|-11|0xc5f3fe,105|-15|0x00cafc,128|1|0x00cafc"} } }
Page["QQ"]['添加好友']["搜索结果异常页面"] = {页面名称="搜索结果异常页面",查询范围={31,   65,744,  374},点击范围={},多点颜色={{0x40a0ff, "2|-11|0x4aa5ff,-82|0|0xf5f6fa,-80|-8|0x8e8e93,-73|1|0x8e8e93,-86|3|0x8e8e93,-621|73|0xffffff,-623|93|0xffffff,-594|120|0xffffff,-616|107|0xffffff"} } }


Page["QQ"]['添加好友']["春节广告页面"] = {页面名称="春节广告页面",查询范围={121,  191,603,  370},点击范围={},多点颜色={{0xebcc9b, "24|0|0xebcc9b,48|0|0xebcc9b,70|-19|0xfc4251,37|18|0xb72026,56|-19|0xed3e50,2|-24|0xd93340,4|9|0xc92b33,78|22|0xc92b33,72|-18|0xff505c"} } }
Page["QQ"]['添加好友']["开启QQ之旅"] = {页面名称="开启QQ之旅",查询范围={580,   58,740,  103},点击范围={},多点颜色={{0xf7f2fd, "1|-6|0x874ae7,14|0|0xc8aaf4,29|-8|0xf8f4fe,31|11|0x8f4ee6,49|-8|0xc3a1f2,66|-8|0xddc9f7,61|6|0x9a5ce8,79|-6|0x924fe6,114|0|0x9952e5"} } }
Page["QQ"]['添加好友']["帮我找到好友"] = {页面名称="帮我找到好友",查询范围={383,  794,534,  866},点击范围={},多点颜色={{0xf1bd0e, "18|-16|0x242427,-17|-17|0x66b2fe,-12|-6|0xf3b806,41|1|0xf79911,50|-2|0x5aa5ef,-17|-20|0x66b2fe,30|11|0x4f98e1,28|8|0xf6b402,16|3|0xf3b806"} } }
Page["QQ"]['添加好友']["添加好友需要绑定手机号"] = {页面名称="添加好友需要绑定手机号",查询范围={204,  639,551,  717},点击范围={},多点颜色={{0x00cafc, "15|0|0xffffff,37|-3|0x33d5fd,46|5|0x00cafc,61|-1|0x4edafd,61|-5|0xffffff,92|2|0x27d2fc,88|-1|0x00cafc,99|2|0x27d2fc,121|0|0xffffff"} } }
Page["QQ"]['添加好友']["让好友了解你退出弹窗"] = {页面名称="让好友了解你退出弹窗",查询范围={ 428,  600,746,  776},点击范围={},多点颜色={{0x3ecf48, "37|-20|0x3ecf48,42|18|0x3ecf48,81|-2|0xa178f3,87|-10|0xaa85f4,85|7|0xa983f4,96|-25|0xa178f3,98|19|0xa178f3,120|-4|0xfbfbfb,104|-16|0xfbfbfb"} } }
Page["QQ"]['添加好友']["让好友了解你弹窗"] = {页面名称="让好友了解你弹窗",查询范围={  670,  671,745,  741},点击范围={},多点颜色={{0xffe7c9, "13|-2|0xffb95e,12|-24|0xf4bf76,-3|-18|0xffffff,2|-12|0xffffff,-6|5|0xffffff,-1|14|0xffb95e,10|35|0xfffbf6,34|25|0xf2b258,27|18|0xffffff"} } }
Page["QQ"]['添加好友']["首页有红色过年广告界面"] = {页面名称="首页有红色过年广告界面",查询范围={85,   81,431,  303},点击范围={},多点颜色={{0x27e88b, "8|-1|0x2ae98c,7|-7|0x38f090,6|7|0x1ae187,222|184|0xf3f4f8,233|178|0xb0b3bf,242|194|0xc5c7d1,244|202|0xd4d5dd,265|191|0xbfc2cc,279|195|0xf5f6fa"} } }
Page["QQ"]['添加好友']["暂无照片"] = {页面名称="暂无照片",查询范围={168,  753,331, 1062},点击范围={},多点颜色={{0xeff2fc, "-11|-2|0x00cafc,-26|-2|0x00cafc,-19|15|0xeff2fd,0|19|0xeff2fd,7|22|0x00cafc,84|256|0xbbbbbb,98|254|0xb1b1b2,99|280|0xebecee,95|245|0xebecee"} } }
Page["QQ"]['添加好友']["空间照片弹出页"] = {页面名称="空间照片弹出页",查询范围={352,   52,397,   95},点击范围={},多点颜色={{0x000000, "-2|7|0xe9e9e9,-5|13|0x000000,-6|20|0x4f4f4f,-8|29|0x000000,-1|15|0x000000,-8|10|0x000000,-2|7|0xe9e9e9,-4|14|0xcfcfcf,0|13|0x000000"} } }


